
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>파이썬 소개 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="installation.html" />
    
    
    <link rel="prev" href="preface.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="dedication.html">
            
                <a href="dedication.html">
            
                    
                    헌사
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    들어가며
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="about_python.html">
            
                <a href="about_python.html">
            
                    
                    파이썬 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="installation.html">
            
                <a href="installation.html">
            
                    
                    설치
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="first_steps.html">
            
                <a href="first_steps.html">
            
                    
                    첫 걸음
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="basics.html">
            
                <a href="basics.html">
            
                    
                    기초
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="op_exp.html">
            
                <a href="op_exp.html">
            
                    
                    연산자와 표현식
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="control_flow.html">
            
                <a href="control_flow.html">
            
                    
                    제어 흐름
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="functions.html">
            
                <a href="functions.html">
            
                    
                    함수
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="modules.html">
            
                <a href="modules.html">
            
                    
                    모듈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="data_structures.html">
            
                <a href="data_structures.html">
            
                    
                    자료구조
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="problem_solving.html">
            
                <a href="problem_solving.html">
            
                    
                    문제 해결
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="oop.html">
            
                <a href="oop.html">
            
                    
                    객체지향 프로그래밍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="io.html">
            
                <a href="io.html">
            
                    
                    입출력
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="exceptions.html">
            
                <a href="exceptions.html">
            
                    
                    예외
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="stdlib.html">
            
                <a href="stdlib.html">
            
                    
                    표준 라이브러리
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="more.html">
            
                <a href="more.html">
            
                    
                    기타 주제
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="what_next.html">
            
                <a href="what_next.html">
            
                    
                    더 나아가기
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="floss.html">
            
                <a href="floss.html">
            
                    
                    부록: FLOSS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="about.html">
            
                <a href="about.html">
            
                    
                    부록: 이 책에 관해
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="revision_history.html">
            
                <a href="revision_history.html">
            
                    
                    부록: 개정 이력
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="translations.html">
            
                <a href="translations.html">
            
                    
                    부록: 번역본
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="translation_howto.html">
            
                <a href="translation_howto.html">
            
                    
                    부록: 번역 방법
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="feedback.html">
            
                <a href="feedback.html">
            
                    
                    피드백
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >파이썬 소개</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
                                <section class="normal markdown-section">
                                
                                <h1 id="&#xD30C;&#xC774;&#xC36C;-&#xC18C;&#xAC1C;">&#xD30C;&#xC774;&#xC36C; &#xC18C;&#xAC1C;</h1>
<p>&#xD30C;&#xC774;&#xC36C;&#xC740; <em>&#xB2E8;&#xC21C;</em>&#xD558;&#xBA74;&#xC11C;&#xB3C4; <em>&#xAC15;&#xB825;</em>&#xD558;&#xB2E4;&#xACE0; &#xD560; &#xC218; &#xC788;&#xB294; &#xBA87; &#xC548; &#xB418;&#xB294; &#xC5B8;&#xC5B4; &#xC911; &#xD558;&#xB098;&#xC785;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB2E4; &#xBCF4;&#xBA74; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC5B8;&#xC5B4;&#xC758; &#xBB38;&#xBC95;&#xACFC; &#xAD6C;&#xC870;&#xBCF4;&#xB2E4;&#xB294; &#xBB38;&#xC81C;&#xC758; &#xD574;&#xBC95;&#xC5D0; &#xC9D1;&#xC911;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC5BC;&#xB9C8;&#xB098; &#xC26C;&#xC6B4;&#xC9C0; &#xC54C;&#xAC8C; &#xB420; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xD30C;&#xC774;&#xC36C;&#xC740; &#xACF5;&#xC2DD;&#xC801;&#xC73C;&#xB85C; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xC18C;&#xAC1C;&#xB3FC; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>&#xD30C;&#xC774;&#xC36C;&#xC740; &#xBC30;&#xC6B0;&#xAE30; &#xC27D;&#xACE0; &#xAC15;&#xB825;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xC785;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC740; &#xD6A8;&#xC728;&#xC801;&#xC778; &#xACE0;&#xC218;&#xC900; &#xC790;&#xB8CC;&#xAD6C;&#xC870;&#xB97C; &#xAC16;&#xCD94;&#xACE0; &#xC788;&#xACE0; &#xB2E8;&#xC21C;&#xD558;&#xC9C0;&#xB9CC; &#xD6A8;&#xACFC;&#xC801;&#xC778; &#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xC9C0;&#xC6D0;&#xD569;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC758; &#xC6B0;&#xC544;&#xD55C; &#xBB38;&#xBC95;&#xACFC; &#xB3D9;&#xC801; &#xD0C0;&#xC785; &#xCCB4;&#xACC4;&#xB294; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;&#xB77C;&#xB294; &#xD2B9;&#xC131;&#xACFC; &#xB354;&#xBD88;&#xC5B4; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xD50C;&#xB7AB;&#xD3FC; &#xC0C1;&#xC758; &#xC5EC;&#xB7EC; &#xC601;&#xC5ED;&#xC5D0;&#xC11C; &#xC2A4;&#xD06C;&#xB9BD;&#xD305;&#xACFC; &#xC2E0;&#xC18D;&#xD55C; &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xAC1C;&#xBC1C;&#xC5D0; &#xCD5C;&#xC801;&#xD654;&#xB41C; &#xC5B8;&#xC5B4;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC90D;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p>&#xB2E4;&#xC74C; &#xC808;&#xC5D0;&#xC11C; &#xC774;&#xB7EC;&#xD55C; &#xD2B9;&#xC9D5;&#xC5D0; &#xB300;&#xD574; &#xC880; &#xB354; &#xC790;&#xC138;&#xD788; &#xC124;&#xBA85;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xC774;&#xB984;&#xC5D0;-&#xC5BD;&#xD78C;-&#xC77C;&#xD654;">&#xC774;&#xB984;&#xC5D0; &#xC5BD;&#xD78C; &#xC77C;&#xD654;</h2>
<p>&#xD30C;&#xC774;&#xC36C; &#xC5B8;&#xC5B4;&#xB97C; &#xB9CC;&#xB4E0; &#xADC0;&#xB3C4; &#xBC18; &#xB85C;&#xC12C;(Guido van Rossum)&#xC740; BBC &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC778; &quot;&#xBAAC;&#xD2F0; &#xD30C;&#xC774;&#xC36C;&#xC758; &#xB0A0;&#xC73C;&#xB294; &#xC11C;&#xCEE4;&#xC2A4;&quot;&#xB97C; &#xB530;&#xC11C; &#xD30C;&#xC774;&#xC36C;&#xC774;&#xB77C;&#xB294; &#xC774;&#xB984;&#xC744; &#xC9C0;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADC0;&#xB3C4;&#xB294; &#xBA39;&#xC787;&#xAC10;&#xC744; &#xC704;&#xD574; &#xAE34; &#xBAB8;&#xC73C;&#xB85C; &#xB2E4;&#xB978; &#xB3D9;&#xBB3C;&#xC744; &#xB458;&#xB458; &#xAC10;&#xC2F8;&#xC11C; &#xC73C;&#xC2A4;&#xB7EC;&#xB728;&#xB9AC;&#xB294; &#xC2DD;&#xC73C;&#xB85C; &#xC7A1;&#xC544;&#xBA39;&#xB294; &#xBC40;&#xC744; &#xD2B9;&#xD788; &#xC88B;&#xC544;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xD30C;&#xC774;&#xC36C;&#xC758;-&#xD2B9;&#xC9D5;">&#xD30C;&#xC774;&#xC36C;&#xC758; &#xD2B9;&#xC9D5;</h2>
<h3 id="&#xB2E8;&#xC21C;&#xD568;">&#xB2E8;&#xC21C;&#xD568;</h3>
<p>&#xD30C;&#xC774;&#xC36C;&#xC740; &#xB2E8;&#xC21C;&#xD558;&#xACE0; &#xBBF8;&#xB2C8;&#xBA40;&#xB9AC;&#xC998;&#xC744; &#xC9C0;&#xD5A5;&#xD558;&#xB294; &#xC5B8;&#xC5B4;&#xC785;&#xB2C8;&#xB2E4;. &#xC798; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC77D;&#xB294; &#xAC83;&#xC740; &#xBE44;&#xB85D; &#xB9E4;&#xC6B0; &#xB531;&#xB531;&#xD558;&#xC9C0;&#xB9CC; &#xC601;&#xC5B4;&#xB97C; &#xC77D;&#xB294; &#xAC83;&#xACFC; &#xAC70;&#xC758; &#xD761;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;! &#xD30C;&#xC774;&#xC36C;&#xC758; &#xC774;&#xB7EC;&#xD55C; &#xC758;&#xC0AC;&#xCF54;&#xB4DC; &#xAC19;&#xC740; &#xD2B9;&#xC131;&#xC740; &#xD30C;&#xC774;&#xC36C;&#xC758; &#xD070; &#xAC15;&#xC810; &#xC911; &#xD558;&#xB098;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8; &#xB355;&#xBD84;&#xC5D0; &#xC5B8;&#xC5B4; &#xC790;&#xCCB4;&#xBCF4;&#xB2E4; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xD574;&#xBC95;&#xC5D0; &#xC9D1;&#xC911;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xBC30;&#xC6B0;&#xAE30;-&#xC26C;&#xC6C0;">&#xBC30;&#xC6B0;&#xAE30; &#xC26C;&#xC6C0;</h3>
<p>&#xC55E;&#xC73C;&#xB85C; &#xBCF4;&#xACA0;&#xC9C0;&#xB9CC; &#xD30C;&#xC774;&#xC36C;&#xC740; &#xC2DC;&#xC791;&#xD558;&#xAE30;&#xAC00; &#xAD49;&#xC7A5;&#xD788; &#xC27D;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xBBF8; &#xC55E;&#xC5D0;&#xC11C; &#xC5B8;&#xAE09;&#xD588;&#xB2E4;&#xC2DC;&#xD53C; &#xD30C;&#xC774;&#xC36C;&#xC758; &#xBB38;&#xBC95;&#xC740; &#xAD49;&#xC7A5;&#xD788; &#xB2E8;&#xC21C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xC790;&#xC720;-&#xC624;&#xD508;&#xC18C;&#xC2A4;">&#xC790;&#xC720; &#xC624;&#xD508;&#xC18C;&#xC2A4;</h3>
<p>&#xD30C;&#xC774;&#xC36C;&#xC740; <em>FLOSS</em>(Free/Libr&#xE9; and Open Source Software)&#xC758; &#xD55C; &#xC608;&#xC785;&#xB2C8;&#xB2E4;. &#xAC04;&#xB2E8;&#xD55C; &#xCE21;&#xBA74;&#xC5D0;&#xC11C; &#xBCF4;&#xC790;&#xBA74; &#xC790;&#xC720;&#xB86D;&#xAC8C; &#xC774; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xC0AC;&#xBCF8;&#xC744; &#xBC30;&#xD3EC;&#xD558;&#xACE0;, &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB97C; &#xC77D;&#xC744; &#xC218; &#xC788;&#xACE0;, &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xACE0;, &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC77C;&#xBD80;&#xB97C; &#xC0C8;&#xB85C;&#xC6B4; &#xBB34;&#xB8CC; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. FLOSS&#xB294; &#xC9C0;&#xC2DD;&#xC744; &#xACF5;&#xC720;&#xD558;&#xB294; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB77C;&#xB294; &#xAC1C;&#xB150;&#xC5D0; &#xAE30;&#xBC18;&#xC744; &#xB450;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC774; &#xC88B;&#xC740; &#xC774;&#xC720; &#xC911; &#xD558;&#xB098;&#xAC00; &#xBC14;&#xB85C; &#xC5EC;&#xAE30;&#xC5D0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989;, &#xB2E8;&#xC9C0; &#xAC1C;&#xC120;&#xB41C; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xBCF4;&#xACE0; &#xC2F6;&#xC5B4; &#xD558;&#xB294; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC758; &#xC8FC;&#xB3C4;&#xB85C; &#xD30C;&#xC774;&#xC36C;&#xC774; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C0;&#xACE0; &#xC9C0;&#xC18D;&#xC801;&#xC73C;&#xB85C; &#xAC1C;&#xC120;&#xB418;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xACE0;&#xC218;&#xC900;-&#xC5B8;&#xC5B4;">&#xACE0;&#xC218;&#xC900; &#xC5B8;&#xC5B4;</h3>
<p>&#xD30C;&#xC774;&#xC36C;&#xC73C;&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD558;&#xBA74; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xAD00;&#xB9AC;&#xD558;&#xB294; &#xB4F1;&#xC758; &#xC800;&#xC218;&#xC900; &#xC138;&#xBD80;&#xC0AC;&#xD56D;&#xC5D0; &#xC2E0;&#xACBD; &#xC4F0;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xC774;&#xC2DD;&#xC131;">&#xC774;&#xC2DD;&#xC131;</h3>
<p>&#xC624;&#xD508;&#xC18C;&#xC2A4;&#xB77C;&#xB294; &#xD2B9;&#xC131; &#xB355;&#xBD84;&#xC5D0; &#xD30C;&#xC774;&#xC36C;&#xC740; &#xC5EC;&#xB7EC; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0; &#xC774;&#xC2DD;&#xB3FC; &#xC654;&#xC2B5;&#xB2C8;&#xB2E4;(&#xC989; &#xB2E4;&#xB978; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0;&#xC11C;&#xB3C4; &#xB3D9;&#xC791;&#xD558;&#xB3C4;&#xB85D; &#xBCC0;&#xACBD;&#xB3FC; &#xC654;&#xC2B5;&#xB2C8;&#xB2E4;). &#xBAA8;&#xB4E0; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; &#xC5EC;&#xB7EC;&#xBD84;&#xC774; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xD2B9;&#xD654;&#xB41C; &#xAE30;&#xB2A5;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xC744; &#xB9CC;&#xD07C;&#xB9CC; &#xC2E0;&#xACBD; &#xC4F4;&#xB2E4;&#xBA74; &#xC544;&#xBB34;&#xAC83;&#xB3C4; &#xBCC0;&#xACBD;&#xD558;&#xC9C0; &#xC54A;&#xACE0;&#xB3C4; &#xC774;&#xB7EC;&#xD55C; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0;&#xC11C; &#xBAA8;&#xB450; &#xB3D9;&#xC791;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>GNU/Linux, Windows, FreeBSD, Macintosh, Solaris, OS/2, Amiga, AROS, AS/400, BeOS, OS/390, z/OS, Palm OS, QNX, VMS, Psion, Acorn RISC OS, VxWorks, PlayStation, Sharp Zaurus, Windows CE and PocketPC&#xC5D0;&#xC11C; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</p>
<p>&#xC2EC;&#xC9C0;&#xC5B4; &#xCEF4;&#xD4E8;&#xD130;<em>&#xC640;</em> &#xC544;&#xC774;&#xD3F0;, &#xC544;&#xC774;&#xD328;&#xB4DC;, &#xC548;&#xB4DC;&#xB85C;&#xC774;&#xB4DC;&#xC6A9; &#xAC8C;&#xC784;&#xC744; &#xB9CC;&#xB4E4;&#xAE30; &#xC704;&#xD55C; <a href="http://kivy.org" target="_blank">Kivy</a> &#xAC19;&#xC740; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0;&#xC11C;&#xB3C4; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;">&#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;</h3>
<p>&#xC774; &#xBD80;&#xBD84;&#xC740; &#xC124;&#xBA85;&#xC774; &#xC870;&#xAE08; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>C&#xB098; C++ &#xAC19;&#xC740; &#xCEF4;&#xD30C;&#xC77C; &#xC5B8;&#xC5B4;&#xB85C; &#xC791;&#xC131;&#xB41C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; &#xB2E4;&#xC591;&#xD55C; &#xD50C;&#xB798;&#xADF8;&#xC640; &#xC635;&#xC158;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xC18C;&#xC2A4; &#xC5B8;&#xC5B4;(C&#xB098; C++)&#xC5D0;&#xC11C; &#xCEF4;&#xD4E8;&#xD130; &#xC5B8;&#xC5B4;(&#xBC14;&#xC774;&#xB108;&#xB9AC; &#xCF54;&#xB4DC;, &#xC989; 0&#xACFC; 1)&#xB85C; &#xBCC0;&#xD658;&#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xBCC0;&#xD658;&#xB41C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xBA74; &#xB9C1;&#xCEE4;/&#xB85C;&#xB354; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xAC00; &#xD558;&#xB4DC;&#xB514;&#xC2A4;&#xD06C;&#xC5D0;&#xC11C; &#xBA54;&#xBAA8;&#xB9AC;&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xBCF5;&#xC0AC;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC744; &#xC2DC;&#xC791;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xBC18;&#xBA74; &#xD30C;&#xC774;&#xC36C;&#xC740; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB85C; &#xCEF4;&#xD30C;&#xC77C;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E8;&#xC9C0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xC5D0;&#xC11C; &#xACE7;&#xBC14;&#xB85C; <em>&#xC2E4;&#xD589;</em>&#xD558;&#xAE30;&#xB9CC; &#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC740; &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C; &#xC18C;&#xC2A4;&#xCF54;&#xB4DC;&#xB97C; &#xBC14;&#xC774;&#xD2B8;&#xCF54;&#xB4DC;(bytecode)&#xB77C;&#xACE0; &#xD558;&#xB294; &#xC911;&#xAC04; &#xD615;&#xD0DC;&#xB85C; &#xBCC0;&#xD658;&#xD55C; &#xB2E4;&#xC74C; &#xC774;&#xB97C; &#xCEF4;&#xD4E8;&#xD130;&#xC758; &#xB124;&#xC774;&#xD2F0;&#xBE0C; &#xC5B8;&#xC5B4;&#xB85C; &#xBC88;&#xC5ED;&#xD55C; &#xD6C4; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xBAA8;&#xB4E0; &#xAC83;&#xB4E4;&#xC740; &#xC2E4;&#xC81C;&#xB85C; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xD6E8;&#xC52C; &#xC27D;&#xAC8C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB9CC;&#xB4E4;&#xACE0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xCEF4;&#xD30C;&#xC77C;&#xD558;&#xACE0; &#xC801;&#xC808;&#xD55C; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; &#xB9C1;&#xD06C;&#xD558;&#xACE0; &#xB85C;&#xB4DC;&#xD558;&#xB294; &#xB4F1;&#xC758; &#xAC71;&#xC815;&#xC744; &#xD558;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xB418;&#xAC8C; &#xD574;&#xC90D;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xC774;&#xB7EC;&#xD55C; &#xD2B9;&#xC131;&#xC740; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC774;&#xC2DD;&#xC131;&#xC744; &#xD6E8;&#xC52C; &#xB354; &#xB192;&#xC5EC;&#xC8FC;&#xB294;&#xB370;, &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xB2E4;&#xB978; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0; &#xBCF5;&#xC0AC;&#xD558;&#xAE30;&#xB9CC; &#xD574;&#xB3C4; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5;">&#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5;</h3>
<p>&#xD30C;&#xC774;&#xC36C;&#xC740; &#xC808;&#xCC28;&#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; &#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xB3C4; &#xC9C0;&#xC6D0;&#xD569;&#xB2C8;&#xB2E4;. <em>&#xC808;&#xCC28;&#xC9C0;&#xD5A5;(procedure-oriented)</em> &#xC5B8;&#xC5B4;&#xC5D0;&#xC11C;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC7AC;&#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC870;&#xAC01;&#xC5D0; &#xBD88;&#xACFC;&#xD55C; &#xD504;&#xB85C;&#xC2DC;&#xC800;&#xB098; &#xD568;&#xC218;&#xB97C; &#xC911;&#xC2EC;&#xC73C;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. <em>&#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5;(object-oriented)</em> &#xC5B8;&#xC5B4;&#xC5D0;&#xC11C;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xB370;&#xC774;&#xD130;&#xC640; &#xAE30;&#xB2A5;&#xC744; &#xACB0;&#xD569;&#xD55C; &#xAC1D;&#xCCB4;(object)&#xB97C; &#xC911;&#xC2EC;&#xC73C;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC740; &#xD2B9;&#xD788; C++&#xB098; &#xC790;&#xBC14;(Java) &#xAC19;&#xC740; &#xADDC;&#xBAA8;&#xAC00; &#xD070; &#xC5B8;&#xC5B4;&#xC640; &#xBE44;&#xAD50;&#xD588;&#xC744; &#xB54C; &#xB9E4;&#xC6B0; &#xAC15;&#xB825;&#xD558;&#xC9C0;&#xB9CC; &#xB2E8;&#xC21C;&#xD55C; &#xBC29;&#xBC95;&#xC73C;&#xB85C; OOP&#xB97C; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xD655;&#xC7A5;&#xC131;">&#xD655;&#xC7A5;&#xC131;</h3>
<p>&#xCF54;&#xB4DC;&#xC758; &#xD575;&#xC2EC;&#xBD80;&#xB97C; &#xB9E4;&#xC6B0; &#xBE60;&#xB974;&#xAC8C; &#xC2E4;&#xD589;&#xD574;&#xC57C; &#xD558;&#xAC70;&#xB098; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC758; &#xC77C;&#xBD80;&#xB97C; &#xACF5;&#xAC1C;&#xD558;&#xACE0; &#xC2F6;&#xC9C0; &#xC54A;&#xB2E4;&#xBA74; &#xD574;&#xB2F9; &#xBD80;&#xBD84;&#xC744; C&#xB098; C++&#xB85C; &#xC791;&#xC131;&#xD55C; &#xB2E4;&#xC74C; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xAC8C; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xC784;&#xBCA0;&#xB529;">&#xC784;&#xBCA0;&#xB529;</h3>
<p>C/C++ &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xB0B4;&#xC5D0; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xD0D1;&#xC7AC;&#xD574;&#xC11C; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC9C1;&#xC811; <em>&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB97C; &#xC791;&#xC131;&#xD558;&#xB3C4;&#xB85D;</em> &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xD3ED;&#xB113;&#xC740;-&#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;">&#xD3ED;&#xB113;&#xC740; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;</h3>
<p>&#xD30C;&#xC774;&#xC36C; &#xD45C;&#xC900; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;(Python Standard Library)&#xB294; &#xC815;&#xB9D0; &#xAC70;&#xB300;&#xD569;&#xB2C8;&#xB2E4;. &#xC815;&#xADDC; &#xD45C;&#xD604;&#xC2DD;, &#xBB38;&#xC11C; &#xC0DD;&#xC131;, &#xB2E8;&#xC704; &#xD14C;&#xC2A4;&#xD2B8;, &#xC2A4;&#xB808;&#xB529;, &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;, &#xC6F9; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;, CGI, FTP, &#xC774;&#xBA54;&#xC77C;, XML, XML-RPC, HTML, WAV &#xD30C;&#xC77C;, &#xC554;&#xD638;&#xD654;, GUI(graphical user interfaces) &#xB4F1;&#xC744; &#xBE44;&#xB86F;&#xD574; &#xB2E4;&#xB978; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xD2B9;&#xD654;&#xB41C; &#xAE30;&#xB2A5;&#xB4E4;&#xC744; &#xAD6C;&#xD604;&#xD558;&#xB294; &#xB370; &#xD65C;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC774; &#xC124;&#xCE58;&#xB41C; &#xACF3;&#xC774;&#xB77C;&#xBA74; &#xC774; &#xBAA8;&#xB4E0; &#xAC83;&#xB4E4;&#xC744; &#xC774;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xAC00;&#xB9AC;&#xCF1C; &#xD30C;&#xC774;&#xC36C;&#xC758; <em>&#xBC30;&#xD130;&#xB9AC; &#xD3EC;&#xD568;</em> &#xCCA0;&#xD559;&#xC774;&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD45C;&#xC900; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC; &#xC678;&#xC5D0;&#xB3C4; &#xB2E4;&#xB978; &#xB2E4;&#xC591;&#xD55C; &#xACE0;&#xD488;&#xC9C8; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; <a href="http://pypi.python.org/pypi" target="_blank">Python Package Index</a>&#xC5D0;&#xC11C; &#xCC3E;&#xC544;&#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xC815;&#xB9AC;">&#xC815;&#xB9AC;</h3>
<p>&#xD30C;&#xC774;&#xC36C;&#xC740; &#xC815;&#xB9D0;&#xB85C; &#xD765;&#xBBF8;&#xB86D;&#xACE0; &#xAC15;&#xB825;&#xD55C; &#xC5B8;&#xC5B4;&#xC785;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC740; &#xC131;&#xB2A5;&#xACFC; &#xAE30;&#xB2A5;&#xC131;&#xC744; &#xC801;&#xC808;&#xD788; &#xACB8;&#xBE44;&#xD574;&#xC11C; &#xD30C;&#xC774;&#xC36C;&#xC73C;&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD558;&#xB294; &#xAC83;&#xC744; &#xC7AC;&#xBBF8;&#xC788;&#xACE0; &#xC190;&#xC27D;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5B4; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xD30C;&#xC774;&#xC36C;-3&#xACFC;-&#xD30C;&#xC774;&#xC36C;-2">&#xD30C;&#xC774;&#xC36C; 3&#xACFC; &#xD30C;&#xC774;&#xC36C; 2</h2>
<p>&quot;&#xD30C;&#xC774;&#xC36C; 2 &#xBC84;&#xC804;&quot;&#xACFC; &quot;&#xD30C;&#xC774;&#xC36C; 3 &#xBC84;&#xC804;&quot;&#xC758; &#xCC28;&#xC774;&#xC810;&#xC5D0; &#xAD00;&#xC2EC;&#xC774; &#xC5C6;&#xB2E4;&#xBA74; &#xC774;&#xBC88; &#xC808;&#xC744; &#xAC74;&#xB108;&#xB6F0;&#xC154;&#xB3C4; &#xB429;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC5B4;&#xB5A4; &#xBC84;&#xC804;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xB294;&#xC9C0;&#xB294; &#xC54C;&#xC544;&#xB450;&#xC2DC;&#xAE30; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; &#xD30C;&#xC774;&#xC36C; 3 &#xBC84;&#xC804;&#xC744; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xC50C;&#xC5EC;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD55C; &#xBC84;&#xC804;&#xC758; &#xC0AC;&#xC6A9;&#xBC95;&#xC744; &#xC801;&#xC808;&#xD788; &#xC774;&#xD574;&#xD558;&#xACE0; &#xBC30;&#xC6B0;&#xACE0; &#xB098;&#xBA74; &#xB2E4;&#xB978; &#xBC84;&#xC804;&#xACFC;&#xC758; &#xCC28;&#xC774;&#xC810;&#xACFC; &#xC0AC;&#xC6A9;&#xBC95;&#xC744; &#xC190;&#xC27D;&#xAC8C; &#xBC30;&#xC6B8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5B4;&#xB824;&#xC6B4; &#xBD80;&#xBD84;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xBC30;&#xC6B0;&#xACE0; &#xD30C;&#xC774;&#xC36C; &#xC5B8;&#xC5B4; &#xC790;&#xCCB4;&#xC758; &#xAE30;&#xCD08;&#xB97C; &#xC774;&#xD574;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xAC83;&#xC774; &#xBC14;&#xB85C; &#xC774; &#xCC45;&#xC758; &#xBAA9;&#xD45C;&#xC774;&#xBA70;, &#xADF8;&#xB7EC;&#xD55C; &#xBAA9;&#xD45C;&#xB97C; &#xB2EC;&#xC131;&#xD558;&#xACE0; &#xB098;&#xBA74; &#xC0C1;&#xD669;&#xC5D0; &#xB530;&#xB77C; &#xD30C;&#xC774;&#xC36C; 2&#xB098; &#xD30C;&#xC774;&#xC36C; 3&#xC744; &#xC190;&#xC27D;&#xAC8C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD30C;&#xC774;&#xC36C; 2&#xC640; &#xD30C;&#xC774;&#xC36C; 3&#xC758; &#xC790;&#xC138;&#xD55C; &#xCC28;&#xC774;&#xC810;&#xC740; &#xC544;&#xB798; &#xAE00;&#xC744; &#xCC38;&#xACE0;&#xD558;&#xC138;&#xC694;.</p>
<ul>
<li><a href="http://lwn.net/Articles/547191/" target="_blank">The future of Python 2</a></li>
<li><a href="https://docs.python.org/3/howto/pyporting.html" target="_blank">Porting Python 2 Code to Python 3</a></li>
<li><a href="https://wiki.python.org/moin/PortingToPy3k/BilingualQuickRef" target="_blank">Writing code that runs under both Python2 and 3</a></li>
<li><a href="http://python3porting.com" target="_blank">Supporting Python 3: An in-depth guide</a></li>
</ul>
<h2 id="&#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;-&#xAC00;&#xB77C;&#xC0AC;&#xB300;">&#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38; &#xAC00;&#xB77C;&#xC0AC;&#xB300;</h2>
<p>ESR &#xAC19;&#xC740; &#xD6CC;&#xB96D;&#xD55C; &#xD574;&#xCEE4;&#xAC00; &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xAD00;&#xD574; &#xBB50;&#xB77C;&#xACE0; &#xC774;&#xC57C;&#xAE30;&#xD588;&#xB294;&#xC9C0; &#xAD81;&#xAE08;&#xD558;&#xC2E4; &#xAC81;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><em>&#xC5D0;&#xB9AD; S. &#xB808;&#xC774;&#xBAAC;&#xB4DC;(Eric S. Raymond)</em>&#xB294; &quot;&#xC131;&#xB2F9;&#xACFC; &#xC2DC;&#xC7A5;(The Cathedral and the Bazaar)&quot;&#xC758; &#xC800;&#xC790;&#xC774;&#xBA70;, <em>&#xC624;&#xD508;&#xC18C;&#xC2A4;(Open Source)</em>&#xB77C;&#xB294; &#xC6A9;&#xC5B4;&#xB97C; &#xB9CC;&#xB4E4;&#xC5B4;&#xB0B8; &#xBD84;&#xC774;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#xC5D0;&#xB9AD;&#xC740; <a href="http://www.python.org/about/success/esr/" target="_blank">&#xD30C;&#xC774;&#xC36C;&#xC774; &#xAC00;&#xC7A5; &#xC88B;&#xC544;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xAC00; &#xB410;&#xB2E4;</a>&#xACE0; &#xC774;&#xC57C;&#xAE30;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li><em>&#xBE0C;&#xB8E8;&#xC2A4; &#xC5D0;&#xCF08;(Bruce Eckel)</em>&#xC740; &#xADF8; &#xC720;&#xBA85;&#xD55C; &apos;Thinking in Java&apos;&#xC640; &apos;Thinking in C++&apos;&#xC758; &#xC800;&#xC790;&#xC785;&#xB2C8;&#xB2E4;. &#xBE0C;&#xB8E8;&#xC2A4;&#xB294; &#xD30C;&#xC774;&#xC36C;&#xBCF4;&#xB2E4; &#xC0DD;&#xC0B0;&#xC131;&#xC774; &#xB192;&#xC740; &#xC5B8;&#xC5B4;&#xB294; &#xC5C6;&#xB2E4;&#xACE0; &#xC774;&#xC57C;&#xAE30;&#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xD30C;&#xC774;&#xC36C;&#xC774;&#xC57C;&#xB9D0;&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xC758; &#xC5C5;&#xBB34;&#xB97C; &#xC190;&#xC27D;&#xAC8C; &#xB9CC;&#xB4DC;&#xB294; &#xB370; &#xCD08;&#xC810;&#xC744; &#xB454; &#xC720;&#xC77C;&#xD55C; &#xC5B8;&#xC5B4;&#xC77C; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xC774;&#xC57C;&#xAE30;&#xD558;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#xC790;&#xC138;&#xD55C; &#xC0AC;&#xD56D;&#xC774; &#xAD81;&#xAE08;&#xD558;&#xB2E4;&#xBA74; <a href="http://www.artima.com/intv/aboutme.html" target="_blank">&#xC778;&#xD130;&#xBDF0; &#xC804;&#xBB38;</a>&#xC744; &#xC77D;&#xC5B4;&#xBCF4;&#xC138;&#xC694;.</li>
<li><em>&#xD53C;&#xD130; &#xB178;&#xBE45;(Peter Norvig)</em>&#xC740; &#xC720;&#xBA85;&#xD55C; &#xB9AC;&#xC2A4;&#xD504;(Lisp) &#xC81C;&#xC791;&#xC790;&#xC774;&#xC790; &#xAD6C;&#xAE00;&#xC758; &#xAC80;&#xC0C9; &#xD488;&#xC9C8; &#xCC45;&#xC784;&#xC790;&#xC774;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;(&#xC54C;&#xB824;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD574;&#xC694;, &#xADC0;&#xB3C4; &#xBC18; &#xB85C;&#xC12C;). &#xD53C;&#xD130;&#xB294; <a href="https://news.ycombinator.com/item?id=1803815" target="_blank">&#xD30C;&#xC774;&#xC36C; &#xCF54;&#xB4DC;&#xB97C; &#xC791;&#xC131;&#xD558;&#xB294; &#xAC83;&#xC740; &#xC758;&#xC0AC;&#xCF54;&#xB4DC;&#xB97C; &#xC791;&#xC131;&#xD558;&#xB294; &#xAC83;&#xACFC; &#xAC19;&#xB2E4;</a>&#xB77C;&#xACE0; &#xC774;&#xC57C;&#xAE30;&#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xD30C;&#xC774;&#xC36C;&#xC740; &#xD56D;&#xC0C1; &#xAD6C;&#xAE00;&#xC5D0; &#xC5C6;&#xC5B4;&#xC11C;&#xB294; &#xC548; &#xB420; &#xC694;&#xC18C;&#xC600;&#xB2E4;&#xACE0; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;. &#xC2E4;&#xC81C;&#xB85C; <a href="https://careers.google.com/jobs/" target="_blank">&#xAD6C;&#xAE00;&#xC758; &#xCC44;&#xC6A9;&#xACF5;&#xACE0;</a> &#xD398;&#xC774;&#xC9C0;&#xB97C; &#xD1B5;&#xD574; &#xC774;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370;, &#xC5EC;&#xAE30;&#xC5D4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xC790;&#xACA9; &#xC694;&#xAC74;&#xC73C;&#xB85C; &#xD30C;&#xC774;&#xC36C; &#xC9C0;&#xC2DD;&#xC774; &#xB098;&#xC5F4;&#xB3FC; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>

                                
                                </section>
                            
                        </div>
                    </div>
                
            </div>

            
                
                <a href="preface.html" class="navigation navigation-prev " aria-label="Previous page: 들어가며">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="installation.html" class="navigation navigation-next " aria-label="Next page: 설치">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"파이썬 소개","level":"1.4","depth":1,"next":{"title":"설치","level":"1.5","depth":1,"path":"installation.md","ref":"installation.md","articles":[]},"previous":{"title":"들어가며","level":"1.3","depth":1,"path":"preface.md","ref":"preface.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{"authorUrl":"https://www.swaroopch.com/about/","buyBookUrl":"https://www.swaroopch.com/buybook/","contactUrl":"https://www.swaroopch.com/contact/","downloadUrl":"https://github.com/swaroopch/byte-of-python/releases/latest","officialUrl":"https://python.swaroopch.com/","pythonVersion":"3.6.0","sourceUrl":"https://github.com/swaroopch/byte-of-python","vimBookUrl":"https://vim.swaroopch.com/"},"plugins":[],"pluginsConfig":{"highlight":{},"search":{"maxIndexSize":1000000},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"about_python.md","mtime":"2020-06-14T15:22:43.918Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-06-29T13:51:01.069Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/buttons.js"></script>
        
    

    </body>
</html>

