
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>제어 흐름 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="functions.html" />
    
    
    <link rel="prev" href="op_exp.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="dedication.html">
            
                <a href="dedication.html">
            
                    
                    헌사
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    들어가며
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="about_python.html">
            
                <a href="about_python.html">
            
                    
                    파이썬 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="installation.html">
            
                <a href="installation.html">
            
                    
                    설치
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="first_steps.html">
            
                <a href="first_steps.html">
            
                    
                    첫 걸음
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="basics.html">
            
                <a href="basics.html">
            
                    
                    기초
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="op_exp.html">
            
                <a href="op_exp.html">
            
                    
                    연산자와 표현식
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.9" data-path="control_flow.html">
            
                <a href="control_flow.html">
            
                    
                    제어 흐름
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="functions.html">
            
                <a href="functions.html">
            
                    
                    함수
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="modules.html">
            
                <a href="modules.html">
            
                    
                    모듈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="data_structures.html">
            
                <a href="data_structures.html">
            
                    
                    자료구조
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="problem_solving.html">
            
                <a href="problem_solving.html">
            
                    
                    문제 해결
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="oop.html">
            
                <a href="oop.html">
            
                    
                    객체지향 프로그래밍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="io.html">
            
                <a href="io.html">
            
                    
                    입출력
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="exceptions.html">
            
                <a href="exceptions.html">
            
                    
                    예외
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="stdlib.html">
            
                <a href="stdlib.html">
            
                    
                    표준 라이브러리
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="more.html">
            
                <a href="more.html">
            
                    
                    기타 주제
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="what_next.html">
            
                <a href="what_next.html">
            
                    
                    더 나아가기
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="floss.html">
            
                <a href="floss.html">
            
                    
                    부록: FLOSS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="about.html">
            
                <a href="about.html">
            
                    
                    부록: 이 책에 관해
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="revision_history.html">
            
                <a href="revision_history.html">
            
                    
                    부록: 개정 이력
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="translations.html">
            
                <a href="translations.html">
            
                    
                    부록: 번역본
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="translation_howto.html">
            
                <a href="translation_howto.html">
            
                    
                    부록: 번역 방법
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="feedback.html">
            
                <a href="feedback.html">
            
                    
                    피드백
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >제어 흐름</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="control-flow">&#xC81C;&#xC5B4; &#xD750;&#xB984; </h1>
<p>&#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xC0B4;&#xD3B4;&#xBCF8; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; &#xC5B8;&#xC81C;&#xB098; &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xC758;&#xD574; &#xC815;&#xD655;&#xD788; &#xC704;&#xC5D0;&#xC11C; &#xC544;&#xB798;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xBB38;&#xC7A5;&#xC73C;&#xB85C; &#xAD6C;&#xC131;&#xB410;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xB3D9;&#xC791; &#xD750;&#xB984;&#xC744; &#xBC14;&#xAFB8;&#xACE0; &#xC2F6;&#xB2E4;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xD574;&#xC57C; &#xD560;&#xAE4C;&#xC694;? &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xD604;&#xC7AC; &#xC2DC;&#xAC01;&#xC5D0; &#xB530;&#xB77C; &apos;Good Morning&apos;&#xC774;&#xB098; &apos;Good Evening&apos;&#xC744; &#xCD9C;&#xB825;&#xD558;&#xB294; &#xAC83;&#xACFC; &#xAC19;&#xC774; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xC5B4;&#xB5A4; &#xACB0;&#xC815;&#xC744; &#xBC1B;&#xC544;&#xB4E4;&#xC5EC; &#xB2E4;&#xC591;&#xD55C; &#xC0C1;&#xD669;&#xC5D0; &#xB530;&#xB77C; &#xB2E4;&#xB978; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD558;&#xAC8C; &#xB9CC;&#xB4E4;&#xACE0; &#xC2F6;&#xB2E4;&#xBA74; &#xC5B4;&#xB5A8;&#xAE4C;&#xC694;?</p>
<p>&#xC81C;&#xC5B4; &#xD750;&#xB984; &#xBB38;&#xC7A5;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xBA74; &#xC774; &#xAC19;&#xC740; &#xC77C;&#xC744; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xB294; <code>if</code>, <code>for</code>, <code>while</code>&#xC774;&#xB77C;&#xB294; &#xC138; &#xAC00;&#xC9C0; &#xC81C;&#xC5B4; &#xD750;&#xB984; &#xBB38;&#xC7A5;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="if-&#xBB38;"><code>if</code> &#xBB38;</h2>
<p><code>if</code> &#xBB38;&#xC740; &#xC870;&#xAC74;(condition)&#xC744; &#xAC80;&#xC0AC;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xC989;, &#xC870;&#xAC74;&#xC774; &#xCC38;<em>&#xC774;&#xB77C;&#xBA74;(if)</em> &#xBB38;&#xC7A5; &#xBE14;&#xB85D;(<em>if &#xBE14;&#xB85D;</em>)&#xC744; &#xC2E4;&#xD589;&#xD558;&#xACE0;, <em>&#xADF8;&#xB807;&#xC9C0; &#xC54A;&#xB2E4;&#xBA74;(else)</em> &#xB2E4;&#xB978; &#xBB38;&#xC7A5; &#xBE14;&#xB85D;(<em>else &#xBE14;&#xB85D;</em>)&#xC744; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. <em>else</em> &#xC808;&#xC740; &#xC120;&#xD0DD;&#xC0AC;&#xD56D;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xC81C;(<code>if.py</code>):</p>
<!-- Tags expansion does not happen inside code blocks https://github.com/GitbookIO/gitbook/issues/707 -->
<pre><code class="lang-python">number = <span class="hljs-number">23</span>
guess = int(input(<span class="hljs-string">&apos;Enter an integer : &apos;</span>))

<span class="hljs-keyword">if</span> guess == number:
    <span class="hljs-comment"># &#xC774;&#xACF3;&#xC5D0;&#xC11C; &#xC0C8; &#xBE14;&#xB85D;&#xC744; &#xC2DC;&#xC791;</span>
    print(<span class="hljs-string">&apos;Congratulations, you guessed it.&apos;</span>)
    print(<span class="hljs-string">&apos;(but you do not win any prizes!)&apos;</span>)
    <span class="hljs-comment"># &#xC774;&#xACF3;&#xC5D0;&#xC11C; &#xC0C8; &#xBE14;&#xB85D;&#xC744; &#xC885;&#xB8CC;</span>
<span class="hljs-keyword">elif</span> guess &lt; number:
    <span class="hljs-comment"># &#xB610; &#xB2E4;&#xB978; &#xBE14;&#xB85D;</span>
    print(<span class="hljs-string">&apos;No, it is a little higher than that&apos;</span>)
    <span class="hljs-comment"># &#xBE14;&#xB85D; &#xC548;&#xC5D0;&#xC11C; &#xC6D0;&#xD558;&#xB294; &#xBB34;&#xC5C7;&#xC774;&#xB4E0; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;...</span>
<span class="hljs-keyword">else</span>:
    print(<span class="hljs-string">&apos;No, it is a little lower than that&apos;</span>)
    <span class="hljs-comment"># &#xC5EC;&#xAE30;&#xC5D0; &#xB3C4;&#xB2EC;&#xD588;&#xB2E4;&#xBA74; &#xBD84;&#xBA85; guessed &gt; number&#xC77C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;</span>

print(<span class="hljs-string">&apos;Done&apos;</span>)
<span class="hljs-comment"># if &#xBB38;&#xC758; &#xC2E4;&#xD589;&#xC774; &#xB05D;&#xB098;&#xBA74; &#xC774; &#xB9C8;&#xC9C0;&#xB9C9; &#xBB38;&#xC7A5;&#xC774; &#xD56D;&#xC0C1; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;</span>
</code></pre>

<p>&#xCD9C;&#xB825; &#xACB0;&#xACFC;:</p>
<pre><code>$ python if.py
Enter an integer : 50
No, it is a little lower than that
Done

$ python if.py
Enter an integer : 22
No, it is a little higher than that
Done

$ python if.py
Enter an integer : 23
Congratulations, you guessed it.
(but you do not win any prizes!)
Done
</code></pre>

<p><strong>&#xB3D9;&#xC791; &#xC6D0;&#xB9AC;</strong></p>
<p>&#xC774; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xCD94;&#xCE21;&#xD55C; &#xC22B;&#xC790;&#xB97C; &#xBC1B;&#xC544; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xBBF8;&#xB9AC; &#xC9C0;&#xC815;&#xD574;&#xB454;  &#xC22B;&#xC790;&#xAC00; &#xB9DE;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xC81C;&#xC5D0;&#xC11C;&#xB294; <code>number</code> &#xBCC0;&#xC218;&#xB97C; <code>23</code>&#xACFC; &#xAC19;&#xC740; &#xC815;&#xC22B;&#xAC12;&#xC73C;&#xB85C; &#xC9C0;&#xC815;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7F0; &#xB2E4;&#xC74C;, <code>input()</code> &#xD568;&#xC218;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xCD94;&#xCE21;&#xD55C; &#xC22B;&#xC790;&#xB97C; &#xBC1B;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD568;&#xC218;(function)&#xB294; &#xC7AC;&#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC870;&#xAC01;&#xC785;&#xB2C8;&#xB2E4;. &#xD568;&#xC218;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; <a href="functions.html#functions">&#xB2E4;&#xC74C; &#xC7A5;</a>&#xC5D0;&#xC11C; &#xC790;&#xC138;&#xD788; &#xC54C;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xC81C;&#xC5D0;&#xC11C;&#xB294; &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xB0B4;&#xC7A5;&#xB41C; <code>input</code> &#xD568;&#xC218;&#xC5D0; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xC804;&#xB2EC;&#xD558;&#xB294;&#xB370;, <code>input</code> &#xD568;&#xC218;&#xB294; &#xC774; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xD654;&#xBA74;&#xC5D0; &#xCD9C;&#xB825;&#xD558;&#xACE0; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xBB54;&#xAC00;&#xB97C; &#xC785;&#xB825;&#xD558;&#xAE30;&#xB97C; &#xAE30;&#xB2E4;&#xB9BD;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xBB54;&#xAC00;&#xB97C; &#xC785;&#xB825;&#xD558;&#xACE0; <code>&#xC5D4;&#xD130;</code> &#xD0A4;&#xB97C; &#xB204;&#xB974;&#xBA74; <code>input()</code> &#xD568;&#xC218;&#xAC00; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC785;&#xB825;&#xD55C; &#xB0B4;&#xC6A9;&#xC744; &#xBB38;&#xC790;&#xC5F4;&#xB85C; &#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7FC; &#xC774; &#xBB38;&#xC790;&#xC5F4;&#xC744; <code>int</code>&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xC815;&#xC218;&#xB85C; &#xBCC0;&#xD658;&#xD55C; &#xD6C4; <code>guess</code> &#xBCC0;&#xC218;&#xC5D0; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC2E4;, <code>int</code>&#xB294; &#xD074;&#xB798;&#xC2A4;&#xC9C0;&#xB9CC; &#xC9C0;&#xAE08; &#xB2F9;&#xC7A5;&#xC740; <code>int</code>&#xB85C; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xC815;&#xC218;&#xB85C; &#xBCC0;&#xD658;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xACE0;&#xB9CC; &#xC54C;&#xACE0; &#xACC4;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;(&#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC785;&#xB825;&#xD55C; &#xD14D;&#xC2A4;&#xD2B8; &#xBB38;&#xC790;&#xC5F4;&#xC5D0; &#xC815;&#xC218; &#xC22B;&#xC790;&#xAC00; &#xB2F4;&#xACA8; &#xC788;&#xB2E4;&#xB294; &#xAC00;&#xC815;&#xD558;&#xC5D0;).</p>
<p>&#xB2E4;&#xC74C;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xCD94;&#xCE21;&#xD55C; &#xC22B;&#xC790;&#xC640; &#xC55E;&#xC5D0;&#xC11C; &#xBBF8;&#xB9AC; &#xC120;&#xD0DD;&#xD574;&#xB454; &#xC22B;&#xC790;&#xB97C; &#xBE44;&#xAD50;&#xD569;&#xB2C8;&#xB2E4;. &#xB450; &#xC22B;&#xC790;&#xAC00; &#xAC19;&#xC73C;&#xBA74; &#xCD94;&#xCE21;&#xC5D0; &#xC131;&#xACF5;&#xD588;&#xB2E4;&#xB294; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xCD9C;&#xB825;&#xD569;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C;&#xB294; &#xC5B4;&#xB290; &#xBB38;&#xC7A5;&#xC774; &#xC5B4;&#xB290; &#xBE14;&#xB85D;&#xC5D0; &#xC18D;&#xD558;&#xB294;&#xC9C0; &#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xAC8C; &#xC54C;&#xB824;&#xC8FC;&#xAE30; &#xC704;&#xD574; &#xB4E4;&#xC5EC;&#xC4F0;&#xAE30;&#xB97C; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xB294; &#xB370; &#xC8FC;&#xC758;&#xD569;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xC11C; &#xB4E4;&#xC5EC;&#xC4F0;&#xAE30;&#xAC00; &#xC544;&#xC8FC; &#xC911;&#xC694;&#xD55C; &#xC774;&#xC720;&#xAC00; &#xBC14;&#xB85C; &#xC5EC;&#xAE30;&#xC5D0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &quot;&#xC77C;&#xAD00;&#xB41C; &#xB4E4;&#xC5EC;&#xC4F0;&#xAE30;&quot; &#xADDC;&#xCE59;&#xC744; &#xAF2D; &#xC9C0;&#xCF1C;&#xC8FC;&#xC2DC;&#xAE38; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;.</p>
<p><code>if</code> &#xBB38; &#xB05D;&#xC5D0; &#xCF5C;&#xB860;(:)&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xB123;&#xC5C8;&#xB294;&#xC9C0; &#xB208;&#xC5EC;&#xACA8;&#xBD05;&#xC2DC;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xAC8C; &#xBB38;&#xC7A5; &#xBE14;&#xB85D;&#xC774; &#xB4A4;&#xC774;&#xC5B4;&#xC11C; &#xB4F1;&#xC7A5;&#xD55C;&#xB2E4;&#xB294; &#xC0AC;&#xC2E4;&#xC744; &#xC54C;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xACE0; &#xB098;&#xC11C; &#xCD94;&#xCE21;&#xD55C; &#xC22B;&#xC790;&#xAC00; &#xC2E4;&#xC81C; &#xC22B;&#xC790;&#xBCF4;&#xB2E4; &#xC791;&#xC740;&#xC9C0; &#xD655;&#xC778;&#xD574;&#xC11C; &#xB9CC;&#xC57D; &#xADF8;&#xB807;&#xB2E4;&#xBA74; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xC870;&#xAE08; &#xB354; &#xB192;&#xC740; &#xC22B;&#xC790;&#xB97C; &#xC785;&#xB825;&#xD574;&#xC57C; &#xD55C;&#xB2E4;&#xACE0; &#xC54C;&#xB9BD;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; <code>elif</code> &#xC808;&#xC744; &#xC0AC;&#xC6A9;&#xD588;&#xB294;&#xB370;, <code>elif</code> &#xC808;&#xC740; &#xC2E4;&#xC81C;&#xB85C; &#xB450; &#xAC1C;&#xC758; &#xC5F0;&#xAD00;&#xB41C; <code>if else-if else</code> &#xBB38;&#xC744; &#xD558;&#xB098;&#xC758; <code>if-elif-else</code> &#xBB38;&#xC73C;&#xB85C; &#xD569;&#xCE5C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xD558;&#xBA74; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD558;&#xAE30;&#xAC00; &#xB354; &#xC26C;&#xC6CC;&#xC9C0;&#xACE0; &#xB4E4;&#xC5EC;&#xC4F0;&#xAE30;&#xC758; &#xC591;&#xC744; &#xC904;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><code>elif</code>&#xC640; <code>else</code> &#xBB38;&#xC5D0;&#xB3C4; &#xBC18;&#xB4DC;&#xC2DC; &#xB05D;&#xC5D0; &#xCF5C;&#xB860;&#xC744; &#xB123;&#xACE0; &#xADF8; &#xB4A4;&#xC5D0; &#xAC01;&#xAC01;&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xB294; &#xBB38;&#xC7A5; &#xBE14;&#xB85D;&#xC774; &#xC640;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;(&#xBB3C;&#xB860; &#xB4E4;&#xC5EC;&#xC4F0;&#xAE30;&#xB3C4; &#xC801;&#xC808;&#xD788; &#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;).</p>
<p><code>if</code> &#xBB38;&#xC758; if &#xBE14;&#xB85D; &#xC548;&#xC5D0; &#xB610; &#xB2E4;&#xB978; <code>if</code> &#xBB38;&#xC744; &#xB458; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xC911;&#xCCA9; <code>if</code> &#xBB38;&#xC774;&#xB77C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><code>elif</code>&#xC640; <code>else</code> &#xBD80;&#xBD84;&#xC740; &#xC120;&#xD0DD;&#xC0AC;&#xD56D;&#xC774;&#xB77C;&#xB294; &#xC810;&#xC744; &#xAE30;&#xC5B5;&#xD558;&#xC138;&#xC694;. <code>if</code> &#xBB38;&#xC758; &#xAC00;&#xC7A5; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xD615;&#xD0DC;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="lang-python"><span class="hljs-keyword">if</span> <span class="hljs-keyword">True</span>:
    print(<span class="hljs-string">&apos;Yes, it is true&apos;</span>)
</code></pre>
<p><code>if</code> &#xBB38;&#xACFC; <code>elif</code>, <code>else</code> &#xC808;&#xC758; &#xC2E4;&#xD589;&#xC744; &#xBAA8;&#xB450; &#xB9C8;&#xCE58;&#xACE0; &#xB098;&#xBA74; <code>if</code> &#xBB38;&#xC774; &#xB2F4;&#xAE34; &#xBE14;&#xB85D; &#xB2E4;&#xC74C;&#xC5D0; &#xC788;&#xB294; &#xBB38;&#xC7A5;&#xC73C;&#xB85C; &#xB118;&#xC5B4;&#xAC11;&#xB2C8;&#xB2E4;. &#xC608;&#xC81C;&#xC5D0;&#xC11C;&#xB294; &#xBA54;&#xC778; &#xBE14;&#xB85D;(main block, &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC2E4;&#xD589;&#xC774; &#xC2DC;&#xC791;&#xB418;&#xB294;)&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xBA70;, &#xB2E4;&#xC74C;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xD560; &#xBB38;&#xC7A5;&#xC740; <code>print(&apos;Done&apos;)</code> &#xBB38;&#xC774; &#xB429;&#xB2C8;&#xB2E4;. &#xC774; &#xBB38;&#xC7A5;&#xB9C8;&#xC800; &#xC2E4;&#xD589;&#xD558;&#xACE0; &#xB098;&#xBA74; &#xD30C;&#xC774;&#xC36C;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xB05D;&#xB0AC;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD558;&#xACE0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC2E4;&#xD589;&#xC744; &#xB9C8;&#xCE69;&#xB2C8;&#xB2E4;.</p>
<p>&#xC544;&#xC8FC; &#xAC04;&#xB2E8;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC778;&#xB370;&#xB3C4; &#xC54C;&#xC544;&#xC57C; &#xD560; &#xC0AC;&#xD56D;&#xB4E4;&#xC774; &#xB9CE;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xBAA8;&#xB4E0; &#xAC83;&#xB4E4;&#xC740; &#xAF64;&#xB098; &#xC9C1;&#xAD00;&#xC801;&#xC785;&#xB2C8;&#xB2E4;(C/C++&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xBCF8; &#xBD84;&#xB4E4;&#xC5D0;&#xAC8C;&#xB294; &#xB180;&#xB784; &#xB9CC;&#xD07C; &#xB2E8;&#xC21C;&#xD560; &#xAC81;&#xB2C8;&#xB2E4;). &#xCD08;&#xC7A5;&#xBD80;&#xD130; &#xC774; &#xBAA8;&#xB4E0; &#xAC83;&#xB4E4;&#xC744; &#xC54C;&#xC544;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xBD80;&#xB2F4;&#xC740; &#xC788;&#xACA0;&#xC9C0;&#xB9CC; &#xBA87; &#xBC88; &#xC5F0;&#xC2B5;&#xD558;&#xB2E4; &#xBCF4;&#xBA74; &#xAE08;&#xBC29; &#xC775;&#xC219;&#xD574;&#xC9C0;&#xACE0; &#xC790;&#xC5F0;&#xC2A4;&#xB7FD;&#xAC8C; &#xB290;&#xAEF4;&#xC9C8; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p><strong>C/C++ &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xB97C; &#xC704;&#xD55C; &#xBA54;&#xBAA8;</strong></p>
<p>&#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xB294; <code>switch</code> &#xBB38;&#xC774; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. <code>if..elif..else</code> &#xBB38;&#xC744; &#xC774;&#xC6A9;&#xD574; <code>switch</code> &#xBB38;&#xACFC; &#xB611;&#xAC19;&#xC774; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;(&#xADF8;&#xB9AC;&#xACE0; &#xC5B4;&#xB5A4; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; <a href="data_structures.html#dictionary">&#xB515;&#xC154;&#xB108;&#xB9AC;</a>&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xB354; &#xBE60;&#xB974;&#xAC8C; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;).</p>
</blockquote>
<h2 id="while-&#xBB38;">while &#xBB38;</h2>
<p><code>while</code> &#xBB38;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xBA74; &#xC870;&#xAC74;&#xC774; &#xCC38;&#xC77C; &#xB3D9;&#xC548; &#xBC18;&#xBCF5;&#xD574;&#xC11C; &#xBB38;&#xC7A5; &#xBE14;&#xB85D;&#xC744; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <code>while</code> &#xBB38;&#xC740; <em>&#xBC18;&#xBCF5;&#xBB38;(loop)</em>&#xC758; &#xC77C;&#xC885;&#xC785;&#xB2C8;&#xB2E4;. <code>while</code> &#xBB38;&#xC5D0;&#xB294; &#xC120;&#xD0DD;&#xC801;&#xC73C;&#xB85C; <code>else</code> &#xC808;&#xC744; &#xB458; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xC81C;(<code>while.py</code>):</p>
<pre><code class="lang-python">number = <span class="hljs-number">23</span>
running = <span class="hljs-keyword">True</span>

<span class="hljs-keyword">while</span> running:
    guess = int(input(<span class="hljs-string">&apos;Enter an integer : &apos;</span>))

    <span class="hljs-keyword">if</span> guess == number:
        print(<span class="hljs-string">&apos;Congratulations, you guessed it.&apos;</span>)
        <span class="hljs-comment"># &#xB2E4;&#xC74C; &#xCF54;&#xB4DC;&#xB294; while &#xBB38;&#xC744; &#xC911;&#xB2E8;&#xD558;&#xAC8C; &#xD569;&#xB2C8;&#xB2E4;</span>
        running = <span class="hljs-keyword">False</span>
    <span class="hljs-keyword">elif</span> guess &lt; number:
        print(<span class="hljs-string">&apos;No, it is a little higher than that.&apos;</span>)
    <span class="hljs-keyword">else</span>:
        print(<span class="hljs-string">&apos;No, it is a little lower than that.&apos;</span>)
<span class="hljs-keyword">else</span>:
    print(<span class="hljs-string">&apos;The while loop is over.&apos;</span>)
    <span class="hljs-comment"># &#xC774;&#xACF3;&#xC5D0;&#xC11C; &#xD558;&#xACE0; &#xC2F6;&#xC740; &#xC791;&#xC5C5;&#xC744; &#xD569;&#xB2C8;&#xB2E4;</span>

print(<span class="hljs-string">&apos;Done&apos;</span>)
</code></pre>

<p>&#xCD9C;&#xB825; &#xACB0;&#xACFC;:</p>
<pre><code>$ python while.py
Enter an integer : 50
No, it is a little lower than that.
Enter an integer : 22
No, it is a little higher than that.
Enter an integer : 23
Congratulations, you guessed it.
The while loop is over.
Done
</code></pre>

<p><strong>&#xB3D9;&#xC791; &#xC6D0;&#xB9AC;</strong></p>
<p>&#xC774; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C;&#xB3C4; &#xC22B;&#xC790; &#xB9DE;&#xCD94;&#xAE30; &#xAC8C;&#xC784;&#xC744; &#xD558;&#xC9C0;&#xB9CC; &#xC774;&#xBC88;&#xC5D0;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xB9DE;&#xCD9C; &#xB54C;&#xAE4C;&#xC9C0; &#xACC4;&#xC18D; &#xC22B;&#xC790;&#xB97C; &#xC785;&#xB825;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989;, &#xC774;&#xC804; &#xC808;&#xC5D0;&#xC11C;&#xCC98;&#xB7FC; &#xC22B;&#xC790;&#xB97C; &#xCD94;&#xCE21;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB9E4;&#xBC88; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; <code>while</code> &#xBB38;&#xC758; &#xC4F0;&#xC784;&#xC0C8;&#xB97C; &#xC798; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xBC88;&#xC5D0;&#xB294; <code>input</code>&#xACFC; <code>if</code> &#xBB38;&#xC744; <code>while</code> &#xBB38; &#xC548;&#xC73C;&#xB85C; &#xC62E;&#xAE30;&#xACE0; <code>while</code> &#xBB38; &#xC55E;&#xC5D0;&#xC11C; <code>running</code> &#xBCC0;&#xC218;&#xB97C; <code>True</code>&#xB85C; &#xC9C0;&#xC815;&#xD569;&#xB2C8;&#xB2E4;. &#xBA3C;&#xC800; <code>running</code> &#xBCC0;&#xC218;&#xB97C; &#xAC80;&#xC0AC;&#xD574;&#xC11C; <code>True</code>&#xC774;&#xBA74; <em>while &#xBE14;&#xB85D;</em>&#xC744; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xBE14;&#xB85D;&#xC774; &#xC2E4;&#xD589;&#xB418;&#xACE0; &#xB098;&#xBA74; &#xC870;&#xAC74;&#xC744; &#xB2E4;&#xC2DC; &#xAC80;&#xC0AC;&#xD558;&#xBA70;, &#xC774; &#xACBD;&#xC6B0; &#xC870;&#xAC74;&#xC740; <code>running</code> &#xBCC0;&#xC218;&#xC785;&#xB2C8;&#xB2E4;. <code>running</code> &#xBCC0;&#xC218;&#xC758; &#xAC12;&#xC774; &#xCC38;&#xC774;&#xBA74; <code>while</code> &#xBE14;&#xB85D;&#xC744; &#xB2E4;&#xC2DC; &#xC2E4;&#xD589;&#xD558;&#xACE0;, &#xADF8;&#xB807;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; &#xC120;&#xD0DD;&#xC801;&#xC778; else &#xBE14;&#xB85D;&#xC744; &#xC2E4;&#xD589;&#xD55C; &#xD6C4; &#xB2E4;&#xC74C; &#xBB38;&#xC7A5;&#xC73C;&#xB85C; &#xB118;&#xC5B4;&#xAC11;&#xB2C8;&#xB2E4;.</p>
<p><code>else</code> &#xBE14;&#xB85D;&#xC740; <code>while</code> &#xBB38;&#xC758; &#xC870;&#xAC74;&#xC774; <code>False</code>&#xAC00; &#xB418;&#xBA74; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;. &#xC870;&#xAC74;&#xC744; &#xCC98;&#xC74C;&#xC73C;&#xB85C; &#xAC80;&#xC0AC;&#xD55C; &#xACBD;&#xC6B0;&#xC5D0;&#xB3C4; <code>else</code> &#xBE14;&#xB85D;&#xC774; &#xC2E4;&#xD589;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <code>while</code> &#xBB38;&#xC5D0; &#xC788;&#xB294; <code>else</code> &#xC808;&#xC740; <code>break</code> &#xBB38;&#xC744; &#xD1B5;&#xD574; &#xBC18;&#xBCF5;&#xBB38;&#xC5D0;&#xC11C; &#xBE60;&#xC838;&#xB098;&#xAC00;&#xC9C0; &#xC54A;&#xB294; &#xC774;&#xC0C1; &#xC5B8;&#xC81C;&#xB098; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><code>True</code>&#xC640; <code>False</code>&#xB294; &#xBD88;&#xB9AC;&#xC5B8;(Boolean) &#xD0C0;&#xC785;&#xC774;&#xB77C;&#xACE0; &#xD558;&#xBA70;, &#xAC01;&#xAC01; <code>1</code>&#xACFC; <code>0</code>&#xC5D0; &#xC0C1;&#xC751;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xAC04;&#xC8FC;&#xB429;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p><strong>C/C++ &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xB97C; &#xC704;&#xD55C; &#xBA54;&#xBAA8;</strong></p>
<p><code>while</code> &#xBB38;&#xC5D0; <code>else</code> &#xC808;&#xC744; &#xB458; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC810;&#xC744; &#xAE30;&#xC5B5;&#xD558;&#xC138;&#xC694;.</p>
</blockquote>
<h2 id="for-&#xBB38;"><code>for</code> &#xBB38;</h2>
<p><code>for..in</code> &#xBB38;&#xC740; &#xAC1D;&#xCCB4;&#xC758; &#xC2DC;&#xD000;&#xC2A4;(sequence)&#xB97C; <em>&#xC21C;&#xD68C;(iterate)</em>&#xD558;&#xB294;, &#xC989; &#xC21C;&#xC11C;&#xB300;&#xB85C; &#xAC01; &#xD56D;&#xBAA9;&#xC744; &#xD1B5;&#xACFC;&#xD558;&#xB294; &#xB610; &#xB2E4;&#xB978; &#xBC18;&#xBCF5;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. <a href="data_structures.html#sequence">&#xC2DC;&#xD000;&#xC2A4;</a>&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xC774;&#xD6C4; &#xC7A5;&#xC5D0;&#xC11C; &#xC790;&#xC138;&#xD788; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC9C0;&#xAE08; &#xB2F9;&#xC7A5;&#xC740; &#xC2DC;&#xD000;&#xC2A4;&#xAC00; &#xC5EC;&#xB7EC; &#xD56D;&#xBAA9;&#xC744; &#xC21C;&#xC11C;&#xB300;&#xB85C; &#xBB36;&#xC740; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xC54C;&#xACE0; &#xACC4;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xC81C;(<code>for.py</code>):</p>
<pre><code class="lang-python"><span class="hljs-keyword">for</span> i <span class="hljs-keyword">in</span> range(<span class="hljs-number">1</span>, <span class="hljs-number">5</span>):
    print(i)
<span class="hljs-keyword">else</span>:
    print(<span class="hljs-string">&apos;The for loop is over&apos;</span>)
</code></pre>

<p>&#xCD9C;&#xB825; &#xACB0;&#xACFC;:</p>
<pre><code>$ python for.py
1
2
3
4
The for loop is over
</code></pre>

<p><strong>&#xB3D9;&#xC791; &#xC6D0;&#xB9AC;</strong></p>
<p>&#xC774; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C;&#xB294; &#xC22B;&#xC790; <em>&#xC2DC;&#xD000;&#xC2A4;</em>&#xB97C; &#xCD9C;&#xB825;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xB0B4;&#xC7A5;&#xB41C; <code>range</code> &#xD568;&#xC218;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xC22B;&#xC790; &#xC2DC;&#xD000;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><code>range</code> &#xD568;&#xC218;&#xC5D0; &#xC22B;&#xC790;&#xB97C; &#xB450; &#xAC1C; &#xC804;&#xB2EC;&#xD558;&#xBA74; <code>range</code> &#xD568;&#xC218;&#xB294; &#xCCAB; &#xBC88;&#xC9F8; &#xC22B;&#xC790;&#xC5D0;&#xC11C; &#xC2DC;&#xC791;&#xD574; &#xB450; &#xBC88;&#xC9F8; &#xC22B;&#xC790;&#xAE4C;&#xC9C0;&#xB97C; &#xBC94;&#xC704;&#xB85C; &#xD558;&#xB294; &#xC22B;&#xC790; &#xC2DC;&#xD000;&#xC2A4;&#xB97C; &#xB3CC;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, <code>range(1,5)</code>&#xB294; <code>[1, 2, 3, 4]</code> &#xC2DC;&#xD000;&#xC2A4;&#xB97C; &#xB3CC;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;. &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; <code>range</code>&#xC5D0;&#xC11C;&#xB294; 1&#xC529; &#xC22B;&#xC790;&#xAC00; &#xC62C;&#xB77C;&#xAC11;&#xB2C8;&#xB2E4;. <code>range</code>&#xC5D0; &#xC138; &#xBC88;&#xC9F8; &#xC22B;&#xC790;&#xB97C; &#xC9C0;&#xC815;&#xD558;&#xBA74; &#xADF8; &#xAC12;&#xB9CC;&#xD07C; &#xC22B;&#xC790;&#xAC00; &#xC62C;&#xB77C;&#xAC11;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, <code>range(1,5,2)</code>&#xB294; <code>[1,3]</code>&#xC744; &#xB3CC;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;. &#xCC38;&#xACE0;&#xB85C; &#xC22B;&#xC790; &#xBC94;&#xC704;&#xB294; &#xB450; &#xBC88;&#xC9F8; &#xC22B;&#xC790; &#xC804;&#xAE4C;&#xC9C0;, &#xC989; &#xB450; &#xBC88;&#xC9F8; &#xC22B;&#xC790;&#xB294; &#xD3EC;&#xD568;&#xB418;&#xC9C0; <em>&#xC54A;&#xB294;&#xB2E4;&#xB294;</em> &#xC810;&#xC744; &#xAE30;&#xC5B5;&#xD558;&#xC138;&#xC694;.</p>
<p><code>range()</code>&#xB294; &#xD55C; &#xBC88;&#xC5D0; &#xC22B;&#xC790; &#xD558;&#xB098;&#xB9CC; &#xC0DD;&#xC131;&#xD558;&#xBBC0;&#xB85C; &#xB9CC;&#xC57D; &#xC804;&#xCCB4; &#xC22B;&#xC790; &#xB9AC;&#xC2A4;&#xD2B8;&#xAC00; &#xD544;&#xC694;&#xD558;&#xB2E4;&#xBA74; <code>range()</code>&#xB97C; &#xB300;&#xC0C1;&#xC73C;&#xB85C; <code>list()</code>&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, <code>list(range(5))</code>&#xB294; <code>[0, 1, 2, 3, 4]</code>&#xB97C; &#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;. &#xB9AC;&#xC2A4;&#xD2B8;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; <a href="data_structures.html#data-structures">&#xC790;&#xB8CC;&#xAD6C;&#xC870;</a> &#xC7A5;&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC5B4;&#xC11C; <code>for</code> &#xBB38;&#xC740; &#xC774; &#xBC94;&#xC704;&#xB97C; &#xC21C;&#xD68C;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xC81C;&#xC758; <code>for i in range(1,5)</code>&#xB294; <code>for i in [1, 2, 3, 4]</code>&#xC5D0; &#xC0C1;&#xC751;&#xD558;&#xBA70;, &#xC774;&#xAC83;&#xC740; &#xB9C8;&#xCE58; &#xC2DC;&#xD000;&#xC2A4; &#xC548;&#xC758; &#xAC01; &#xC22B;&#xC790;(&#xB610;&#xB294; &#xAC1D;&#xCCB4;)&#xB97C; &#xD55C; &#xBC88;&#xC5D0; &#xD558;&#xB098;&#xC529; <code>i</code>&#xC5D0; &#xD560;&#xB2F9;&#xD55C; &#xB2E4;&#xC74C;, &#xAC01; <code>i</code> &#xAC12;&#xC5D0; &#xB300;&#xD574; &#xBB38;&#xC7A5; &#xBE14;&#xB85D;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAC83;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xC81C;&#xC5D0;&#xC11C;&#xB294; &#xBB38;&#xC7A5; &#xBE14;&#xB85D;&#xC5D0;&#xC11C; <code>i</code>&#xC758; &#xAC12;&#xC744; &#xCD9C;&#xB825;&#xD558;&#xAE30;&#xB9CC; &#xD569;&#xB2C8;&#xB2E4;.
<code>else</code> &#xBD80;&#xBD84;&#xC740; &#xC120;&#xD0DD;&#xC0AC;&#xD56D;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xBD80;&#xBD84;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xBA74; <a href="#break-statement">break</a> &#xBB38;&#xC744; &#xB9CC;&#xB098;&#xC9C0; &#xC54A;&#xB294; &#xC774;&#xC0C1; <code>for</code> &#xBB38;&#xC774; &#xB05D;&#xB098;&#xACE0; &#xB098;&#xC11C; &#xC5B8;&#xC81C;&#xB098; &#xD55C; &#xBC88; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xCC38;&#xACE0;&#xB85C; <code>for..in</code> &#xBB38;&#xC740; &#xC5B4;&#xB5A4; &#xC2DC;&#xD000;&#xC2A4;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB3C4; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C;&#xB294; &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xB0B4;&#xC7A5;&#xB41C; <code>range</code> &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; &#xC0DD;&#xC131;&#xB41C; &#xC22B;&#xC790; &#xB9AC;&#xC2A4;&#xD2B8;&#xB97C; &#xC0AC;&#xC6A9;&#xD588;&#xC9C0;&#xB9CC; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC5B4;&#xB5A4; &#xC885;&#xB958;&#xC758; &#xAC1D;&#xCCB4; &#xC2DC;&#xD000;&#xC2A4;&#xC5D0;&#xB3C4; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xB0B4;&#xC6A9;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xC774;&#xD6C4; &#xC7A5;&#xC5D0;&#xC11C; &#xC790;&#xC138;&#xD788; &#xC54C;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p><strong>C/C++/Java/C# &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xB97C; &#xC704;&#xD55C; &#xBA54;&#xBAA8;</strong></p>
<p>&#xD30C;&#xC774;&#xC36C;&#xC758; <code>for</code> &#xBB38;&#xC740; C/C++&#xC758; <code>for</code> &#xBB38;&#xACFC; &#xD604;&#xACA9;&#xD788; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;. C# &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xB77C;&#xBA74; &#xD30C;&#xC774;&#xC36C;&#xC758; <code>for</code> &#xBB38;&#xC774; C#&#xC758; <code>foreach</code> &#xBB38;&#xACFC; &#xBE44;&#xC2B7;&#xD558;&#xB2E4;&#xACE0; &#xB290;&#xB084; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC790;&#xBC14; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xB77C;&#xBA74; C# &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xC640; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; &#xC790;&#xBC14; 1.5&#xC758; <code>for (int i : IntArray)</code>&#xC640; &#xBE44;&#xC2B7;&#xD558;&#xB2E4;&#xACE0; &#xB290;&#xAEF4;&#xC9C8; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>C/C++&#xC5D0;&#xC11C; <code>for (int i = 0; i &lt; 5; i++)</code>&#xB77C;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xC791;&#xC131;&#xD558;&#xACE0; &#xC2F6;&#xB2E4;&#xBA74; &#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xC11C;&#xB294; <code>for i in range(0,5)</code>&#xB77C;&#xACE0; &#xC4F0;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xBCF4;&#xB2E4;&#xC2DC;&#xD53C; <code>for</code> &#xBB38;&#xC774; &#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xC11C;&#xB294; &#xB354; &#xB2E8;&#xC21C;&#xD558;&#xACE0; &#xB354; &#xD45C;&#xD604;&#xB825; &#xC788;&#xC73C;&#xBA70; &#xC5D0;&#xB7EC;&#xAC00; &#xBC1C;&#xC0DD;&#xD560; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xC801;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<h2 id="break-statement">break &#xBB38; </h2>
<p><code>break</code> &#xBB38;&#xC740; &#xBC18;&#xBCF5;&#xBB38;&#xC5D0;&#xC11C; <em>&#xBE60;&#xC838;&#xB098;&#xC624;&#xB294;(break out)</em> &#xB370; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xC989;, &#xBC18;&#xBCF5; &#xC870;&#xAC74;&#xC774; <code>False</code>&#xAC00; &#xB418;&#xC9C0; &#xC54A;&#xC558;&#xAC70;&#xB098; &#xD56D;&#xBAA9; &#xC2DC;&#xD000;&#xC2A4;&#xB97C; &#xC644;&#xC804;&#xD788; &#xC21C;&#xD68C;&#xD558;&#xC9C0; &#xC54A;&#xC558;&#xC744; &#xB54C;&#xB3C4; &#xBC18;&#xBCF5;&#xBB38;&#xC758; &#xC2E4;&#xD589;&#xC744; &#xC911;&#xB2E8;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xD55C; &#xAC00;&#xC9C0; &#xC911;&#xC694;&#xD55C; &#xC810;&#xC740; <code>for</code>&#xB098; <code>while</code> &#xBB38;&#xC5D0;&#xC11C; <code>break</code>&#xB85C; &#xBE60;&#xC838;&#xB098;&#xC62C; &#xACBD;&#xC6B0; <code>else</code> &#xBE14;&#xB85D;&#xC740; &#xC2E4;&#xD589;&#xB418;&#xC9C0; <strong>&#xC54A;&#xB294;&#xB2E4;&#xB294;</strong> &#xC810;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xC81C;(<code>break.py</code>):</p>
<pre><code class="lang-python"><span class="hljs-keyword">while</span> <span class="hljs-keyword">True</span>:
    s = input(<span class="hljs-string">&apos;Enter something : &apos;</span>)
    <span class="hljs-keyword">if</span> s == <span class="hljs-string">&apos;quit&apos;</span>:
        <span class="hljs-keyword">break</span>
    print(<span class="hljs-string">&apos;Length of the string is&apos;</span>, len(s))
print(<span class="hljs-string">&apos;Done&apos;</span>)
</code></pre>

<p>&#xCD9C;&#xB825; &#xACB0;&#xACFC;:</p>
<pre><code>$ python break.py
Enter something : Programming is fun
Length of the string is 18
Enter something : When the work is done
Length of the string is 21
Enter something : if you wanna make your work also fun:
Length of the string is 37
Enter something : use Python!
Length of the string is 11
Enter something : quit
Done
</code></pre>

<p><strong>&#xB3D9;&#xC791; &#xC6D0;&#xB9AC;</strong></p>
<p>&#xC774; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C;&#xB294; &#xACC4;&#xC18D;&#xD574;&#xC11C; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC785;&#xB825;&#xD55C; &#xB0B4;&#xC6A9;&#xC744; &#xBC1B;&#xC544; &#xAE38;&#xC774;&#xB97C; &#xCD9C;&#xB825;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xC81C;&#xC5D0;&#xC11C;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC785;&#xB825;&#xD55C; &#xB0B4;&#xC6A9;&#xC774; <code>&apos;quit&apos;</code>&#xC778;&#xC9C0; &#xAC80;&#xC0AC;&#xD574;&#xC11C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC2E4;&#xD589;&#xC744; &#xC911;&#xB2E8;&#xD558;&#xB294; &#xD2B9;&#xBCC4;&#xD55C; &#xC870;&#xAC74;&#xC744; &#xB2EC;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; &#xBC18;&#xBCF5;&#xBB38;&#xC5D0;&#xC11C; &#xBE60;&#xC838;&#xB098;&#xC640; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xB05D;&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xB294; &#xC2DD;&#xC73C;&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC911;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC785;&#xB825; &#xBB38;&#xC790;&#xC5F4;&#xC758; &#xAE38;&#xC774;&#xB294; &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xB0B4;&#xC7A5;&#xB41C; <code>len</code> &#xD568;&#xC218;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><code>break</code> &#xBB38;&#xC744; <code>for</code> &#xBB38;&#xC5D0;&#xC11C;&#xB3C4; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC810;&#xC744; &#xAE30;&#xC5B5;&#xD558;&#xC138;&#xC694;.</p>
<p><strong>&#xC2A4;&#xC640;&#xB8F9;&#xC758; &#xC2DC;&#xC801; &#xD30C;&#xC774;&#xC36C;</strong></p>
<p>&#xC608;&#xC81C;&#xC5D0;&#xC11C; &#xC785;&#xB825;&#xD55C; &#xBB38;&#xC790;&#xC5F4;&#xC740; &#xC81C;&#xAC00; &#xC4F4; &#xC9E7;&#xC740; &#xC2DC;&#xC785;&#xB2C8;&#xB2E4;.</p>
<pre><code>Programming is fun
When the work is done
if you wanna make your work also fun:
    use Python!
</code></pre><h2 id="continue-statement"><code>continue</code> &#xBB38; </h2>
<p><code>continue</code> &#xBB38;&#xC740; &#xD604;&#xC7AC; &#xBC18;&#xBCF5;&#xBB38; &#xBE14;&#xB85D;&#xC758; &#xB098;&#xBA38;&#xC9C0; &#xBB38;&#xC7A5;&#xC744; &#xAC74;&#xB108;&#xB6F0;&#xACE0; <em>&#xACC4;&#xC18D;&#xD574;&#xC11C;(continue)</em> &#xBC18;&#xBCF5;&#xBB38;&#xC758; &#xB2E4;&#xC74C; &#xBC18;&#xBCF5;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xC81C;(<code>continue.py</code>):</p>
<pre><code class="lang-python"><span class="hljs-keyword">while</span> <span class="hljs-keyword">True</span>:
    s = input(<span class="hljs-string">&apos;Enter something : &apos;</span>)
    <span class="hljs-keyword">if</span> s == <span class="hljs-string">&apos;quit&apos;</span>:
        <span class="hljs-keyword">break</span>
    <span class="hljs-keyword">if</span> len(s) &lt; <span class="hljs-number">3</span>:
        print(<span class="hljs-string">&apos;Too small&apos;</span>)
        <span class="hljs-keyword">continue</span>
    print(<span class="hljs-string">&apos;Input is of sufficient length&apos;</span>)
    <span class="hljs-comment"># &#xC774;&#xACF3;&#xC5D0;&#xC11C; &#xB2E4;&#xB978; &#xCC98;&#xB9AC; &#xB0B4;&#xC6A9;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;...</span>
</code></pre>

<p>&#xCD9C;&#xB825; &#xACB0;&#xACFC;:</p>
<pre><code>$ python continue.py
Enter something : a
Too small
Enter something : 12
Too small
Enter something : abc
Input is of sufficient length
Enter something : quit
</code></pre>

<p><strong>&#xB3D9;&#xC791; &#xC6D0;&#xB9AC;</strong></p>
<p>&#xC774; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xC785;&#xB825;&#xC744; &#xBC1B;&#xC9C0;&#xB9CC; &#xC785;&#xB825; &#xBB38;&#xC790;&#xC5F4;&#xC758; &#xAE38;&#xC774;&#xAC00; &#xCD5C;&#xC18C; 3&#xAE00;&#xC790; &#xC774;&#xC0C1;&#xC778; &#xACBD;&#xC6B0;&#xC5D0;&#xB9CC; &#xCC98;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xB0B4;&#xC7A5;&#xB41C; <code>len</code> &#xD568;&#xC218;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xAE38;&#xC774;&#xB97C; &#xAD6C;&#xD55C; &#xB2E4;&#xC74C;, &#xBB38;&#xC790;&#xC5F4;&#xC758; &#xAE38;&#xC774;&#xAC00; 3&#xAE00;&#xC790; &#xBBF8;&#xB9CC;&#xC774;&#xBA74; <code>continue</code> &#xBB38;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xBC18;&#xBCF5;&#xBB38; &#xBE14;&#xB85D;&#xC758; &#xB098;&#xBA38;&#xC9C0; &#xBB38;&#xC7A5;&#xC744; &#xAC74;&#xB108;&#xB701;&#xB2C8;&#xB2E4;. &#xBB38;&#xC790;&#xC5F4;&#xC758; &#xAE38;&#xC774;&#xAC00; 3&#xAE00;&#xC790; &#xC774;&#xC0C1;&#xC774;&#xBA74; &#xBC18;&#xBCF5;&#xBB38;&#xC758; &#xB098;&#xBA38;&#xC9C0; &#xBB38;&#xC7A5;&#xC744; &#xC2E4;&#xD589;&#xD574; &#xD558;&#xACE0; &#xC2F6;&#xC740; &#xC77C;&#xC744; &#xCC98;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xCC38;&#xACE0;&#xB85C; <code>continue</code> &#xBB38;&#xC740; <code>for</code> &#xBB38;&#xC5D0;&#xC11C;&#xB3C4; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xC815;&#xB9AC;">&#xC815;&#xB9AC;</h2>
<p>&#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xC138; &#xAC00;&#xC9C0; &#xC81C;&#xC5B4;&#xBB38;&#xC778; <code>if</code>, <code>while</code>, <code>for</code>&#xB97C; &#xBE44;&#xB86F;&#xD574; &#xC774;&#xC640; &#xC5F0;&#xAD00;&#xB41C; <code>break</code>&#xC640; <code>continue</code> &#xBB38;&#xC758; &#xC0AC;&#xC6A9;&#xBC95;&#xC744; &#xC0B4;&#xD3B4;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xAC83;&#xB4E4;&#xC740; &#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xC11C; &#xAC00;&#xC7A5; &#xD754;&#xD788; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC694;&#xC18C;&#xC774;&#xBBC0;&#xB85C; &#xAF2D; &#xC775;&#xD600;&#xB450;&#xC2DC;&#xAE38; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C; &#xC7A5;&#xC5D0;&#xC11C;&#xB294; &#xD568;&#xC218;&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xB9CC;&#xB4E4;&#xACE0; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xC9C0; &#xC54C;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="op_exp.html" class="navigation navigation-prev " aria-label="Previous page: 연산자와 표현식">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="functions.html" class="navigation navigation-next " aria-label="Next page: 함수">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"제어 흐름","level":"1.9","depth":1,"next":{"title":"함수","level":"1.10","depth":1,"path":"functions.md","ref":"functions.md","articles":[]},"previous":{"title":"연산자와 표현식","level":"1.8","depth":1,"path":"op_exp.md","ref":"op_exp.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{"authorUrl":"https://www.swaroopch.com/about/","buyBookUrl":"https://www.swaroopch.com/buybook/","contactUrl":"https://www.swaroopch.com/contact/","downloadUrl":"https://github.com/swaroopch/byte-of-python/releases/latest","officialUrl":"https://python.swaroopch.com/","pythonVersion":"3.6.0","sourceUrl":"https://github.com/swaroopch/byte-of-python","vimBookUrl":"https://vim.swaroopch.com/"},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"control_flow.md","mtime":"2020-06-11T14:27:13.793Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-06-15T14:49:25.764Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

