
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>첫 걸음 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="basics.html" />
    
    
    <link rel="prev" href="installation.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="dedication.html">
            
                <a href="dedication.html">
            
                    
                    헌사
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    들어가며
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="about_python.html">
            
                <a href="about_python.html">
            
                    
                    파이썬 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="installation.html">
            
                <a href="installation.html">
            
                    
                    설치
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="first_steps.html">
            
                <a href="first_steps.html">
            
                    
                    첫 걸음
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="basics.html">
            
                <a href="basics.html">
            
                    
                    기초
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="op_exp.html">
            
                <a href="op_exp.html">
            
                    
                    연산자와 표현식
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="control_flow.html">
            
                <a href="control_flow.html">
            
                    
                    제어 흐름
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="functions.html">
            
                <a href="functions.html">
            
                    
                    함수
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="modules.html">
            
                <a href="modules.html">
            
                    
                    모듈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="data_structures.html">
            
                <a href="data_structures.html">
            
                    
                    자료구조
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="problem_solving.html">
            
                <a href="problem_solving.html">
            
                    
                    문제 해결
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="oop.html">
            
                <a href="oop.html">
            
                    
                    객체지향 프로그래밍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="io.html">
            
                <a href="io.html">
            
                    
                    입출력
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="exceptions.html">
            
                <a href="exceptions.html">
            
                    
                    예외
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="stdlib.html">
            
                <a href="stdlib.html">
            
                    
                    표준 라이브러리
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="more.html">
            
                <a href="more.html">
            
                    
                    기타 주제
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="what_next.html">
            
                <a href="what_next.html">
            
                    
                    더 나아가기
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >첫 걸음</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#xCCAB;-&#xAC78;&#xC74C;">&#xCCAB; &#xAC78;&#xC74C;</h1>
<p>&#xC774;&#xC81C; &#xD30C;&#xC774;&#xC36C;&#xC73C;&#xB85C; &#xC804;&#xD1B5;&#xC801;&#xC778; &apos;Hello World&apos; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xBC95;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD558;&#xACE0; &#xC800;&#xC7A5;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xBC95;&#xC744; &#xBC30;&#xC6B8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD30C;&#xC774;&#xC36C;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xB450; &#xAC00;&#xC9C0; &#xBC29;&#xBC95;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC14;&#xB85C; &#xC778;&#xD130;&#xB799;&#xD2F0;&#xBE0C; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130; &#xD504;&#xB86C;&#xD504;&#xD2B8;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAC70;&#xB098; &#xC18C;&#xC2A4; &#xD30C;&#xC77C;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C;&#xB294; &#xB450; &#xAC00;&#xC9C0; &#xBC29;&#xBC95;&#xC744; &#xBAA8;&#xB450; &#xC0B4;&#xD3B4;&#xBD05;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;-&#xD504;&#xB86C;&#xD504;&#xD2B8;-&#xC0AC;&#xC6A9;&#xD558;&#xAE30;">&#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130; &#xD504;&#xB86C;&#xD504;&#xD2B8; &#xC0AC;&#xC6A9;&#xD558;&#xAE30;</h2>
<p>&#xC0AC;&#xC6A9; &#xC911;&#xC778; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;(&#xC55E;&#xC758; <a href="installation.html#installation">&#xC124;&#xCE58;</a> &#xC7A5;&#xC5D0;&#xC11C; &#xB2E4;&#xB8EC;)&#xC5D0;&#xC11C; &#xD130;&#xBBF8;&#xB110;&#xC744; &#xC5F4;&#xACE0; <code>python3</code>&#xC744; &#xC785;&#xB825;&#xD558;&#xACE0; <code>&#xC5D4;&#xD130;</code> &#xD0A4;&#xB97C; &#xB20C;&#xB7EC; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB86C;&#xD504;&#xD2B8;&#xB97C; &#xC5FD;&#xB2C8;&#xB2E4;.</p>
<p>&#xD30C;&#xC774;&#xC36C;&#xC774; &#xC2E4;&#xD589;&#xB418;&#xBA74; &#xBA85;&#xB839;&#xC744; &#xC785;&#xB825;&#xD560; &#xC218; &#xC788;&#xB294; <code>&gt;&gt;&gt;</code>&#xC774; &#xB098;&#xD0C0;&#xB0A9;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; <em>&#xD30C;&#xC774;&#xC36C; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130; &#xD504;&#xB86C;&#xD504;&#xD2B8;</em>&#xB77C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD30C;&#xC774;&#xC36C; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130; &#xD504;&#xB86C;&#xD504;&#xD2B8;&#xC5D0;&#xC11C; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xC785;&#xB825;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="lang-python">print(<span class="hljs-string">&quot;Hello World&quot;</span>)
</code></pre>
<p>&#xC774;&#xC5B4;&#xC11C; <code>&#xC5D4;&#xD130;</code> &#xD0A4;&#xB97C; &#xB204;&#xB974;&#xBA74; <code>Hello World</code>&#xAC00; &#xD654;&#xBA74;&#xC5D0; &#xCD9C;&#xB825;&#xB420; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C;&#xC740; macOS&#xC5D0;&#xC11C; &#xBCFC; &#xC218; &#xC788;&#xB294; &#xB0B4;&#xC6A9;&#xC785;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC5D0; &#xB300;&#xD55C; &#xC790;&#xC138;&#xD55C; &#xB0B4;&#xC6A9;&#xC740; &#xC0AC;&#xC6A9; &#xC911;&#xC778; &#xCEF4;&#xD4E8;&#xD130;&#xB9C8;&#xB2E4; &#xB2E4;&#xB97C; &#xC218; &#xC788;&#xC9C0;&#xB9CC; &#xD504;&#xB86C;&#xD504;&#xD2B8; &#xBD80;&#xBD84;(<code>&gt;&gt;&gt;</code> &#xB2E4;&#xC74C;&#xC5D0; &#xB098;&#xC624;&#xB294;)&#xC740; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xC640; &#xC0C1;&#xAD00;&#xC5C6;&#xC774; &#xB3D9;&#xC77C;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<!-- The output should match pythonVersion variable in book.json -->
<pre><code class="lang-python">$ python3
Python <span class="hljs-number">3.6</span><span class="hljs-number">.0</span> (default, Jan <span class="hljs-number">12</span> <span class="hljs-number">2017</span>, <span class="hljs-number">11</span>:<span class="hljs-number">26</span>:<span class="hljs-number">36</span>)
[GCC <span class="hljs-number">4.2</span><span class="hljs-number">.1</span> Compatible Apple LLVM <span class="hljs-number">8.0</span><span class="hljs-number">.0</span> (clang<span class="hljs-number">-800.0</span><span class="hljs-number">.38</span>)] on darwin
Type <span class="hljs-string">&quot;help&quot;</span>, <span class="hljs-string">&quot;copyright&quot;</span>, <span class="hljs-string">&quot;credits&quot;</span> <span class="hljs-keyword">or</span> <span class="hljs-string">&quot;license&quot;</span> <span class="hljs-keyword">for</span> more information.
<span class="hljs-meta">&gt;&gt;&gt; </span>print(<span class="hljs-string">&quot;Hello World&quot;</span>)
Hello World
</code></pre>
<p>&#xD30C;&#xC774;&#xC36C;&#xC774; &#xCD9C;&#xB825; &#xACB0;&#xACFC;&#xB97C; &#xACE7;&#xBC14;&#xB85C; &#xBCF4;&#xC5EC;&#xC900;&#xB2E4;&#xB294; &#xB370; &#xC8FC;&#xBAA9;&#xD558;&#xC138;&#xC694;! &#xC55E;&#xC11C; &#xC785;&#xB825;&#xD55C; &#xB0B4;&#xC6A9;&#xC740; &#xD55C; &#xC904;&#xC9DC;&#xB9AC; &#xD30C;&#xC774;&#xC36C; <em>&#xBB38;&#xC7A5;(statement)</em>&#xC785;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C;&#xB294; <code>print</code>&#xB97C; &#xC774;&#xC6A9;&#xD574; <code>print</code>&#xC5D0; &#xC804;&#xB2EC;&#xD55C; &#xAC12;&#xC744; &#xCD9C;&#xB825;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989;, <code>Hello World</code>&#xB77C;&#xB294; &#xD14D;&#xC2A4;&#xD2B8;&#xB97C; &#xB123;&#xC5C8;&#xACE0;, &#xADF8;&#xAC83;&#xC774; &#xACE7;&#xBC14;&#xB85C; &#xD654;&#xBA74;&#xC5D0; &#xCD9C;&#xB825;&#xB410;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="&#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;-&#xD504;&#xB86C;&#xD504;&#xD2B8;&#xB97C;-&#xC885;&#xB8CC;&#xD558;&#xB294;-&#xBC29;&#xBC95;">&#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130; &#xD504;&#xB86C;&#xD504;&#xD2B8;&#xB97C; &#xC885;&#xB8CC;&#xD558;&#xB294; &#xBC29;&#xBC95;</h3>
<p>GNU/&#xB9AC;&#xB205;&#xC2A4;&#xB098; macOS &#xC178;&#xC744; &#xC0AC;&#xC6A9; &#xC911;&#xC774;&#xB77C;&#xBA74; <code>Ctrl + D</code>&#xB97C; &#xB204;&#xB974;&#xAC70;&#xB098; <code>exit()</code>(&#xCC38;&#xACE0;&#xB85C; &#xC5EC;&#xAE30;&#xC11C; &#xC785;&#xB825;&#xD55C; &#xAC83;&#xC740; &#xC18C;&#xAD04;&#xD638;(<code>()</code>)&#xC785;&#xB2C8;&#xB2E4;)&#xB97C; &#xC785;&#xB825;&#xD55C; &#xD6C4; <code>&#xC5D4;&#xD130;</code> &#xD0A4;&#xB97C; &#xB20C;&#xB7EC; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130; &#xD504;&#xB86C;&#xD504;&#xD2B8;&#xC5D0;&#xC11C; &#xBE60;&#xC838;&#xB098;&#xC62C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC708;&#xB3C4;&#xC6B0; &#xBA85;&#xB839; &#xD504;&#xB86C;&#xD504;&#xD2B8;&#xB97C; &#xC0AC;&#xC6A9; &#xC911;&#xC774;&#xB77C;&#xBA74; <code>Ctrl + Z</code>&#xB97C; &#xB204;&#xB978; &#xB2E4;&#xC74C; <code>&#xC5D4;&#xD130;</code> &#xD0A4;&#xB97C; &#xB204;&#xB974;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xD3B8;&#xC9D1;&#xAE30;-&#xC120;&#xD0DD;&#xD558;&#xAE30;">&#xD3B8;&#xC9D1;&#xAE30; &#xC120;&#xD0DD;&#xD558;&#xAE30;</h2>
<p>&#xBB54;&#xAC00;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xACE0; &#xC2F6;&#xC744; &#xB54C;&#xB9C8;&#xB2E4; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130; &#xD504;&#xB86C;&#xD504;&#xD2B8;&#xC5D0;&#xB2E4; &#xCF54;&#xB4DC;&#xB97C; &#xC785;&#xB825;&#xD560; &#xC218;&#xB294; &#xC5C6;&#xC744; &#xD14C;&#xB2C8; &#xCF54;&#xB4DC;&#xB97C; &#xD30C;&#xC77C;&#xC5D0; &#xC800;&#xC7A5;&#xD558;&#xACE0; &#xBA87; &#xBC88;&#xC774;&#xACE0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD30C;&#xC774;&#xC36C; &#xC18C;&#xC2A4; &#xD30C;&#xC77C;&#xC744; &#xB9CC;&#xB4E4;&#xB824;&#xBA74; &#xD30C;&#xC774;&#xC36C; &#xCF54;&#xB4DC;&#xB97C; &#xC785;&#xB825;&#xD558;&#xACE0; &#xC800;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xB294; &#xD3B8;&#xC9D1;&#xAE30; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xAC00; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xAD1C;&#xCC2E;&#xC740; &#xD3B8;&#xC9D1;&#xAE30;&#xB97C; &#xC4F0;&#xBA74; &#xC18C;&#xC2A4; &#xD30C;&#xC77C;&#xC744; &#xC791;&#xC131;&#xD558;&#xAE30;&#xAC00; &#xC218;&#xC6D4;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC5B4;&#xB5A4; &#xD3B8;&#xC9D1;&#xAE30;&#xB97C; &#xC120;&#xD0DD;&#xD558;&#xB290;&#xB0D0;&#xAC00; &#xAD49;&#xC7A5;&#xD788; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xC790;&#xB3D9;&#xCC28;&#xB97C; &#xAD6C;&#xC785;&#xD558;&#xB294; &#xAC83;&#xB9C8;&#xB0E5; &#xD3B8;&#xC9D1;&#xAE30;&#xB97C; &#xC120;&#xD0DD;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC88B;&#xC740; &#xD3B8;&#xC9D1;&#xAE30;&#xB294; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD558;&#xB294; &#xB370; &#xB3C4;&#xC6C0;&#xC744; &#xC90C;&#xC73C;&#xB85C;&#xC368; &#xC5EC;&#xB7EC;&#xBD84;&#xC758; &#xC5EC;&#xC815;&#xC744; &#xD3B8;&#xC548;&#xD558;&#xAC8C; &#xD558;&#xACE0; &#xBAA9;&#xC801;&#xC9C0;&#xB85C; &#xAC00;&#xB294;(&#xBAA9;&#xD45C;&#xB97C; &#xB2EC;&#xC131;&#xD558;&#xB294;) &#xAE38;&#xC744; &#xD6E8;&#xC52C; &#xBE60;&#xB974;&#xACE0; &#xC548;&#xC804;&#xD558;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5B4; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xD3B8;&#xC9D1;&#xAE30;&#xB97C; &#xACE0;&#xB97C; &#xB54C;&#xC758; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xC694;&#xAC74; &#xC911; &#xD558;&#xB098;&#xB294; <em>&#xBB38;&#xBC95; &#xAC15;&#xC870;(syntax highlighting)</em>&#xC785;&#xB2C8;&#xB2E4;. &#xBB38;&#xBC95; &#xAC15;&#xC870;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xD30C;&#xC545;&#xD558;&#xACE0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC2E4;&#xD589; &#xBC29;&#xC2DD;&#xC744; &#xC2DC;&#xAC01;&#xD654;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xBAA8;&#xB4E0; &#xBD80;&#xBD84;&#xC5D0; &#xC0C9;&#xC0C1;&#xC744; &#xC785;&#xD799;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5B4;&#xB514;&#xC11C;&#xBD80;&#xD130; &#xC2DC;&#xC791;&#xD574;&#xC57C; &#xD560;&#xC9C0; &#xBAA8;&#xB974;&#xACA0;&#xB2E4;&#xBA74; &#xC708;&#xB3C4;&#xC6B0;, macOS, GNU/&#xB9AC;&#xB205;&#xC2A4;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; <a href="https://www.jetbrains.com/pycharm-edu/" target="_blank">PyCharm &#xAD50;&#xC721; &#xC5D0;&#xB514;&#xC158;</a> &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB97C; &#xCD94;&#xCC9C;&#xD569;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C; &#xC808;&#xC5D0;&#xC11C; &#xC790;&#xC138;&#xD55C; &#xC0AC;&#xD56D;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC708;&#xB3C4;&#xC6B0;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xB2E4;&#xBA74; <em>&#xBA54;&#xBAA8;&#xC7A5;&#xC740; &#xC4F0;&#xC9C0; &#xB9C8;&#xC138;&#xC694;</em>. &#xBA54;&#xBAA8;&#xC7A5;&#xC740; &#xBB38;&#xBC95; &#xAC15;&#xC870;&#xB97C; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xC744;&#xBFD0;&#xB354;&#xB7EC; &#xB098;&#xC911;&#xC5D0; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC9C0;&#xB9CC; &#xB354; &#xC911;&#xC694;&#xD55C; &#xBB38;&#xC81C;&#xB294; &#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xC11C; &#xB9E4;&#xC6B0; &#xC911;&#xC694;&#xD55C; &#xD14D;&#xC2A4;&#xD2B8; &#xB4E4;&#xC5EC;&#xC4F0;&#xAE30;&#xB3C4; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xC88B;&#xC740; &#xD3B8;&#xC9D1;&#xAE30;&#xB294; &#xB4E4;&#xC5EC;&#xC4F0;&#xAE30;&#xB97C; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC219;&#xB828;&#xB41C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xB77C;&#xBA74; &#xC774;&#xBBF8; <a href="http://www.vim.org" target="_blank">Vim</a>&#xC774;&#xB098; <a href="http://www.gnu.org/software/emacs/" target="_blank">Emacs</a>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xACC4;&#xC2E4; &#xAC81;&#xB2C8;&#xB2E4;. &#xB450;&#xB9D0;&#xD560; &#xD544;&#xC694;&#xB3C4; &#xC5C6;&#xC774; &#xB450; &#xD3B8;&#xC9D1;&#xAE30;&#xB294; &#xAC00;&#xC7A5; &#xAC15;&#xB825;&#xD55C; &#xD3B8;&#xC9D1;&#xAE30;&#xB77C;&#xC11C; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD558;&#xB294; &#xB370; &#xD65C;&#xC6A9;&#xD558;&#xC2E4; &#xC218; &#xC788;&#xC744; &#xAC81;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; &#xAC1C;&#xC778;&#xC801;&#xC73C;&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xB9CC;&#xB4E4; &#xB54C; &#xB450; &#xD3B8;&#xC9D1;&#xAE30;&#xB97C; &#xBAA8;&#xB450; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xBA70;, &#xC2EC;&#xC9C0;&#xC5B4; <a href="https://vim.swaroopch.com/" target="_blank">Vim&#xC5D0; &#xAD00;&#xD55C; &#xCC45;</a>&#xC744; &#xC4F0;&#xAE30;&#xB3C4; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC2DC;&#xAC04;&#xC744; &#xB4E4;&#xC5EC; Vim&#xC774;&#xB098; Emacs&#xB97C; &#xBC30;&#xC6B8; &#xC758;&#xD5A5;&#xC774; &#xC788;&#xB2E4;&#xBA74; &#xC7A5;&#xAE30;&#xC801;&#xC73C;&#xB85C; &#xD06C;&#xAC8C; &#xB3C4;&#xC6C0;&#xC774; &#xB420; &#xD14C;&#xB2C8; &#xB450; &#xD3B8;&#xC9D1;&#xAE30;&#xB97C; &#xBAA8;&#xB450; &#xBC30;&#xC6B0;&#xB294; &#xAC83;&#xC744; &#xC801;&#xADF9; &#xAD8C;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC55E;&#xC5D0;&#xC11C;&#xB3C4; &#xC5B8;&#xAE09;&#xD588;&#xB4EF;&#xC774; &#xCD08;&#xBCF4;&#xC790;&#xBD84;&#xB4E4;&#xC740; &#xC9C0;&#xAE08; &#xB2F9;&#xC7A5;&#xC740; &#xD3B8;&#xC9D1;&#xAE30;&#xBCF4;&#xB2E4;&#xB294; PyCharm&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xACE0; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xBC30;&#xC6B0;&#xB294; &#xB370; &#xC9D1;&#xC911;&#xD558;&#xC2E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xAC70;&#xB4ED; &#xBC18;&#xBCF5;&#xD558;&#xC9C0;&#xB9CC; &#xC801;&#xC808;&#xD55C; &#xD3B8;&#xC9D1;&#xAE30;&#xB97C; &#xACE0;&#xB978;&#xB2E4;&#xBA74; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD558;&#xAE30;&#xAC00; &#xB354;&#xC6B1; &#xC990;&#xAC81;&#xACE0; &#xC218;&#xC6D4;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<h2 id="pycharm">PyCharm </h2>
<p><a href="https://www.jetbrains.com/pycharm-edu/" target="_blank">PyCharm &#xAD50;&#xC721; &#xC5D0;&#xB514;&#xC158;</a>&#xC740; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD558;&#xB294; &#xB370; &#xC4F8; &#xC218; &#xC788;&#xB294; &#xBB34;&#xB8CC; &#xD3B8;&#xC9D1;&#xAE30;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>PyCharm&#xC744; &#xC5F4;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xCC3D;&#xC774; &#xB098;&#xD0C0;&#xB098;&#xACE0;, &#xC774;&#xACF3;&#xC5D0;&#xC11C; <code>Create New Project</code>&#xB97C; &#xD074;&#xB9AD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="img/pycharm_open.png" alt="When you open PyCharm"></p>
<p><code>Pure Python</code>&#xC744; &#xC120;&#xD0DD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="img/pycharm_create_new_project.png" alt="PyCharm New Project"></p>
<p>&#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC704;&#xCE58;(Location)&#xC5D0;&#xC11C; <code>untitled</code>&#xB97C; <code>helloworld</code>&#xB85C; &#xBC14;&#xAFC9;&#xB2C8;&#xB2E4;.</p>
<p><img src="img/pycharm_create_new_project_pure_python.png" alt="PyCharm project details"></p>
<p><code>Create</code> &#xBC84;&#xD2BC;&#xC744; &#xD074;&#xB9AD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC67C;&#xCABD;&#xC758; &#xC0AC;&#xC774;&#xB4DC;&#xBC14;&#xC5D0;&#xC11C; <code>helloworld</code>&#xB97C; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xB9C8;&#xC6B0;&#xC2A4; &#xC624;&#xB978;&#xCABD; &#xBC84;&#xD2BC;&#xC744; &#xD074;&#xB9AD;&#xD55C; &#xD6C4; <code>New</code> &#x2192; <code>Python File</code>&#xC744; &#xCC28;&#xB840;&#xB85C; &#xC120;&#xD0DD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="img/pycharm_new_python_file.png" alt="PyCharm -&gt; New -&gt; Python File"></p>
<p>&#xC774;&#xB984;&#xC744; &#xC785;&#xB825;&#xD558;&#xB77C;&#xACE0; &#xB098;&#xC624;&#xBA74; <code>hello</code>&#xB97C; &#xC785;&#xB825;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="img/pycharm_new_file_input.png" alt="PyCharm New File dialog box"></p>
<p>&#xADF8;&#xB7FC; &#xD30C;&#xC77C;&#xC774; &#xD558;&#xB098; &#xC5F4;&#xB9BD;&#xB2C8;&#xB2E4;.</p>
<p><img src="img/pycharm_hello_open.png" alt="PyCharm hello.py file"></p>
<p>&#xAE30;&#xC874; &#xB0B4;&#xC6A9;&#xC740; &#xBAA8;&#xB450; &#xC9C0;&#xC6B0;&#xACE0; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xC785;&#xB825;&#xD569;&#xB2C8;&#xB2E4;.</p>
<!-- TODO: Update screenshots for Python 3 -->
<pre><code class="lang-python">print(<span class="hljs-string">&quot;hello world&quot;</span>)
</code></pre>
<p>&#xBC29;&#xAE08; &#xD14D;&#xC2A4;&#xD2B8;&#xB97C; &#xC785;&#xB825;&#xD55C; &#xACF3;&#xC5D0;&#xC11C;(&#xD14D;&#xC2A4;&#xD2B8;&#xB97C; &#xC120;&#xD0DD;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xC0C1;&#xD0DC;&#xB85C;) &#xB9C8;&#xC6B0;&#xC2A4; &#xC624;&#xB978;&#xCABD; &#xBC84;&#xD2BC;&#xC744; &#xD074;&#xB9AD;&#xD558;&#xACE0; <code>Run &apos;hello&apos;</code>&#xB97C; &#xD074;&#xB9AD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><img src="img/pycharm_run.png" alt="PyCharm Run &apos;hello&apos;"></p>
<p>&#xADF8;&#xB7FC; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xCD9C;&#xB825; &#xACB0;&#xACFC;(&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xCD9C;&#xB825;&#xD558;&#xB294;)&#xAC00; &#xB098;&#xD0C0;&#xB0A9;&#xB2C8;&#xB2E4;.</p>
<p><img src="img/pycharm_output.png" alt="PyCharm output"></p>
<p>&#xCC98;&#xC74C; &#xCE58;&#xACE0;&#xB294; &#xAC70;&#xCCD0;&#xC57C; &#xD560; &#xB2E8;&#xACC4;&#xAC00; &#xC880; &#xC788;&#xC5C8;&#xC9C0;&#xB9CC; &#xC774;&#xD6C4;&#xB85C; &#xD30C;&#xC77C;&#xC744; &#xC0C8;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC57C; &#xD560; &#xB54C;&#xB9C8;&#xB2E4; &#xC67C;&#xCABD; &#xC0AC;&#xC774;&#xB4DC;&#xBC14;&#xC5D0;&#xC11C; <code>helloworld</code>&#xC5D0; &#xB9C8;&#xC6B0;&#xC2A4; &#xC624;&#xB978;&#xCABD; &#xBC84;&#xD2BC;&#xC744; &#xD074;&#xB9AD;&#xD55C; &#xD6C4; <code>New</code> &#x2192; <code>Python File</code>&#xC744; &#xCC28;&#xB840;&#xB85C; &#xC120;&#xD0DD;&#xD588;&#xB358; &#xAC83;&#xC744; &#xAE30;&#xC5B5;&#xD558;&#xC2DC;&#xACE0; &#xC55E;&#xC5D0;&#xC11C; &#xBCF4;&#xC5EC;&#xB4DC;&#xB9B0; &#xAC83;&#xCC98;&#xB7FC; &#xD30C;&#xC774;&#xC36C; &#xCF54;&#xB4DC;&#xB97C; &#xC785;&#xB825;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xB2E8;&#xACC4;&#xB97C; &#xB611;&#xAC19;&#xC774; &#xBC1F;&#xC73C;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>PyCharm&#xC5D0; &#xAD00;&#xD55C; &#xB354; &#xC790;&#xC138;&#xD55C; &#xC815;&#xBCF4;&#xB294; <a href="https://www.jetbrains.com/pycharm-educational/quickstart/" target="_blank">PyCharm &#xBE60;&#xB974;&#xAC8C; &#xC2DC;&#xC791;&#xD558;&#xAE30;</a> &#xD398;&#xC774;&#xC9C0;&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="vim">Vim</h2>
<ol>
<li><a href="http://www.vim.org" target="_blank">Vim</a>&#xC744; &#xC124;&#xCE58;&#xD569;&#xB2C8;&#xB2E4;.<ul>
<li>macOS &#xC0AC;&#xC6A9;&#xC790;&#xB294; <a href="http://brew.sh/" target="_blank">HomeBrew</a>&#xB97C; &#xD1B5;&#xD574; <code>macvim</code> &#xD328;&#xD0A4;&#xC9C0;&#xB97C; &#xC124;&#xCE58;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xC708;&#xB3C4;&#xC6B0; &#xC0AC;&#xC6A9;&#xC790;&#xB294; <a href="http://www.vim.org/download.php" target="_blank">Vim &#xC6F9;&#xC0AC;&#xC774;&#xD2B8;</a>&#xC5D0;&#xC11C; &#xC124;&#xCE58; &#xD30C;&#xC77C;&#xC744; &#xB0B4;&#xB824;&#xBC1B;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>GNU/&#xB9AC;&#xB205;&#xC2A4; &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xC0AC;&#xC6A9; &#xC911;&#xC778; &#xBC30;&#xD3EC;&#xD310;&#xC758; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xC800;&#xC7A5;&#xC18C;&#xC5D0;&#xC11C; Vim&#xC744; &#xAD6C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xB370;&#xBE44;&#xC548;&#xACFC; &#xC6B0;&#xBD84;&#xD22C; &#xC0AC;&#xC6A9;&#xC790;&#xB294; <code>vim</code> &#xD328;&#xD0A4;&#xC9C0;&#xB97C; &#xC124;&#xCE58;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li>&#xC790;&#xB3D9;&#xC644;&#xC131;&#xC744; &#xC704;&#xD574; <a href="https://github.com/davidhalter/jedi-vim" target="_blank">jedi-vim</a> &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xC744; &#xC124;&#xCE58;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li><code>jeid-vim</code> &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xB294; <code>jedi</code> &#xD30C;&#xC774;&#xC36C; &#xD328;&#xD0A4;&#xC9C0;&#xB97C; &#xC124;&#xCE58;&#xD569;&#xB2C8;&#xB2E4;:  <code>pip install -U jedi</code></li>
</ol>
<h2 id="emacs">Emacs</h2>
<ol>
<li><a href="http://www.gnu.org/software/emacs/" target="_blank">Emacs 24+</a>&#xB97C; &#xC124;&#xCE58;&#xD569;&#xB2C8;&#xB2E4;.<ul>
<li>macOS &#xC0AC;&#xC6A9;&#xC790;&#xB294; <a href="http://emacsformacosx.com&#xC5D0;&#xC11C;" target="_blank">http://emacsformacosx.com&#xC5D0;&#xC11C;</a> Emacs&#xB97C; &#xAD6C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xC708;&#xB3C4;&#xC6B0; &#xC0AC;&#xC6A9;&#xC790;&#xB294; <a href="http://ftp.gnu.org/gnu/emacs/windows/&#xC5D0;&#xC11C;" target="_blank">http://ftp.gnu.org/gnu/emacs/windows/&#xC5D0;&#xC11C;</a> Emacs&#xB97C; &#xAD6C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>GNU/&#xB9AC;&#xB205;&#xC2A4; &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xC0AC;&#xC6A9; &#xC911;&#xC778; &#xBC30;&#xD3EC;&#xD310;&#xC758; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xC800;&#xC7A5;&#xC18C;&#xC5D0;&#xC11C; Emacs&#xB97C; &#xAD6C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xB370;&#xBE44;&#xC548;&#xACFC; &#xC6B0;&#xBD84;&#xD22C; &#xC0AC;&#xC6A9;&#xC790;&#xB294; <code>emacs24</code> &#xD328;&#xD0A4;&#xC9C0;&#xB97C; &#xC124;&#xCE58;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
<li><a href="https://github.com/jorgenschaefer/elpy/wiki" target="_blank">ELPY</a>&#xB97C; &#xC124;&#xCE58;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ol>
<h2 id="&#xC18C;&#xC2A4;-&#xD30C;&#xC77C;-&#xC0AC;&#xC6A9;&#xD558;&#xAE30;">&#xC18C;&#xC2A4; &#xD30C;&#xC77C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30;</h2>
<p>&#xC774;&#xC81C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC73C;&#xB85C; &#xB418;&#xB3CC;&#xC544;&#xAC11;&#xC2DC;&#xB2E4;. &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5C5;&#xACC4;&#xC5D0;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xB97C; &#xBC30;&#xC6B8; &#xB54C;&#xB9C8;&#xB2E4; &#xB9E8; &#xBA3C;&#xC800; &apos;Hello World&apos;&#xB77C;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;(&#xC2E4;&#xD589;&#xD588;&#xC744; &#xB54C; &#xB2E8;&#xC9C0; &apos;Hello World&apos;&#xB77C;&#xACE0; &#xCD9C;&#xB825;&#xD558;&#xAE30;&#xB9CC; &#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC785;&#xB2C8;&#xB2E4;)&#xC744; &#xC791;&#xC131;&#xD574;&#xC11C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xC804;&#xD1B5;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC774;&#xBA3C; &#xCF54;&#xC820;&#xC2A4;(Simon Cozens)<sup><a href="#fn_1" id="reffn_1">1</a></sup>&#xAC00; &#xC774;&#xC57C;&#xAE30;&#xD588;&#xB4EF;&#xC774; &#xC774;&#xAC83;&#xC740; &quot;&#xC5B8;&#xC5B4;&#xB97C; &#xB354; &#xC798; &#xBC30;&#xC6B8; &#xC218; &#xC788;&#xAC8C; &#xB3C4;&#xC640;&#xB2EC;&#xB77C;&#xACE0; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC2E0;&#xC5D0;&#xAC8C; &#xC62C;&#xB9AC;&#xB294; &#xC804;&#xD1B5;&#xC801;&#xC778; &#xC8FC;&#xBB38;&quot;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC55E;&#xC5D0;&#xC11C; &#xC120;&#xD0DD;&#xD55C; &#xD3B8;&#xC9D1;&#xAE30;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xACE0;, &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC785;&#xB825;&#xD55C; &#xD6C4; <code>hello.py</code>&#xB77C;&#xB294; &#xC774;&#xB984;&#xC73C;&#xB85C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>PyCharm&#xC744; &#xC0AC;&#xC6A9; &#xC911;&#xC774;&#xB77C;&#xBA74; &#xC774;&#xBBF8; &#xC55E;&#xC5D0;&#xC11C; <a href="#pycharm">&#xC18C;&#xC2A4; &#xD30C;&#xC77C;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xBC95;&#xC744; &#xC0B4;&#xD3B4;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;</a>.</p>
<p>&#xB2E4;&#xB978; &#xD3B8;&#xC9D1;&#xAE30;&#xB97C; &#xC0AC;&#xC6A9; &#xC911;&#xC774;&#xB77C;&#xBA74; <code>hello.py</code>&#xB77C;&#xB294; &#xD30C;&#xC77C;&#xC744; &#xC0C8;&#xB85C; &#xB9CC;&#xB4E4;&#xACE0; &#xB2E4;&#xC74C; &#xB0B4;&#xC6A9;&#xC744; &#xC785;&#xB825;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="lang-python">print(<span class="hljs-string">&quot;hello world&quot;</span>)
</code></pre>
<p>&#xADF8;&#xB7F0;&#xB370; &#xD30C;&#xC77C;&#xC744; &#xC5B4;&#xB514;&#xC5D0; &#xC800;&#xC7A5;&#xD574;&#xC57C; &#xD560;&#xAE4C;&#xC694;? &#xC704;&#xCE58;&#xB97C; &#xC54C;&#xACE0; &#xC788;&#xB294; &#xC544;&#xBB34; &#xD3F4;&#xB354;&#xC5D0; &#xC800;&#xC7A5;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xAC8C; &#xBB34;&#xC2A8; &#xB73B;&#xC778;&#xC9C0; &#xBAA8;&#xB974;&#xACA0;&#xB2E4;&#xBA74; &#xD3F4;&#xB354;&#xB97C; &#xD558;&#xB098; &#xC0C8;&#xB85C; &#xB9CC;&#xB4E4;&#xACE0; &#xADF8; &#xD3F4;&#xB354;&#xC5D0;&#xB2E4; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC800;&#xC7A5;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>macOS&#xC758; <code>/tmp/py</code></li>
<li>GNU/&#xB9AC;&#xB205;&#xC2A4;&#xC758; <code>/tmp/py</code></li>
<li>&#xC708;&#xB3C4;&#xC6B0;&#xC758; <code>C:\py</code></li>
</ul>
<p>&#xC0AC;&#xC6A9; &#xC911;&#xC778; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xC5D0; &#xB530;&#xB77C; &#xC704;&#xC758; &#xD3F4;&#xB354;&#xB97C; &#xB9CC;&#xB4E4;&#xB824;&#xBA74; &#xD130;&#xBBF8;&#xB110;&#xC5D0;&#xC11C; <code>mkdir</code> &#xBA85;&#xB839;&#xC744; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;(&#xC608;: <code>mkdir /tmp/py</code>).</p>
<p>&#xC911;&#xC694;: &#xD30C;&#xC77C; &#xD655;&#xC7A5;&#xC790;&#xB294; &#xBC18;&#xB4DC;&#xC2DC; <code>.py</code>&#xB85C; &#xC9C0;&#xC815;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;(&#xC608;: <code>foo.py</code>).</p>
<p>&#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB824;&#xBA74; &#xB2E4;&#xC74C; &#xC808;&#xCC28;&#xB97C; &#xB530;&#xB985;&#xB2C8;&#xB2E4;.</p>
<ol>
<li>&#xD130;&#xBBF8;&#xB110; &#xCC3D;&#xC744; &#xC5FD;&#xB2C8;&#xB2E4;(&#xC55E;&#xC758; <a href="installation.html#installation">&#xC124;&#xCE58;</a> &#xC7A5;&#xC5D0;&#xC11C; &#xC774;&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xD558;&#xB294;&#xC9C0; &#xC0B4;&#xD3B4;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;)</li>
<li><code>cd</code>(change directory) &#xBA85;&#xB839;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xD30C;&#xC77C;&#xC744; &#xC800;&#xC7A5;&#xD55C; &#xACF3;&#xC73C;&#xB85C; &#xC774;&#xB3D9;&#xD569;&#xB2C8;&#xB2E4;(&#xC608;: <code>cd /tmp/py</code>).</li>
<li><code>python hello.py</code> &#xBA85;&#xB839;&#xC744; &#xC785;&#xB825;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xCD9C;&#xB825; &#xACB0;&#xACFC;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ol>
<pre><code>$ python hello.py
hello world
</code></pre><p><img src="img/terminal_screenshot.png" alt="Screenshot of running program in terminal"></p>
<p>&#xC704;&#xC640; &#xAC19;&#xC740; &#xCD9C;&#xB825; &#xACB0;&#xACFC;&#xAC00; &#xB098;&#xC654;&#xB2E4;&#xBA74; &#xCD95;&#xD558;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;! &#xCCAB; &#xBC88;&#xC9F8; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xB370; &#xC131;&#xACF5;&#xD55C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xB4DC;&#xB514;&#xC5B4; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xBC30;&#xC6B8; &#xB54C; &#xAC00;&#xC7A5; &#xC5B4;&#xB824;&#xC6B4; &#xBD80;&#xBD84;, &#xC989; &#xCCAB; &#xBC88;&#xC9F8; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xB370; &#xC131;&#xACF5;&#xD55C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;!</p>
<p>&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC624;&#xB958;&#xAC00; &#xBC1C;&#xC0DD;&#xD588;&#xB2E4;&#xBA74; &#xC55E;&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD55C; &#xB300;&#xB85C; <em>&#xC815;&#xD655;&#xD558;&#xAC8C;</em> &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC785;&#xB825;&#xD55C; &#xD6C4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xB2E4;&#xC2DC; &#xC2E4;&#xD589;&#xD574; &#xBCF4;&#xC138;&#xC694;. &#xD30C;&#xC774;&#xC36C;&#xC740; &#xB300;&#xC18C;&#xBB38;&#xC790;&#xB97C; &#xAC00;&#xB9B0;&#xB2E4;&#xB294; &#xB370; &#xC8FC;&#xC758;&#xD558;&#xC138;&#xC694;. &#xC989;, <code>print</code>&#xB294; <code>Print</code>&#xC640; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;. &#xC804;&#xC790;&#xC758; &#xC18C;&#xBB38;&#xC790; <code>p</code>&#xC640; &#xD6C4;&#xC790;&#xC758; &#xB300;&#xBB38;&#xC790; <code>P</code>&#xC5D0; &#xC8FC;&#xBAA9;&#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xAC01; &#xC904;&#xC758; &#xB9E8; &#xCCAB; &#xAE00;&#xC790; &#xC55E;&#xC5D0;&#xB294; &#xACF5;&#xBC31;&#xC774;&#xB098; &#xD0ED;&#xC774; &#xC788;&#xC5B4;&#xC11C;&#xB294; &#xC548; &#xB429;&#xB2C8;&#xB2E4;. <a href="basics.html#indentation">&#xC774;&#xAC83;&#xC774; &#xC65C; &#xC911;&#xC694;&#xD55C;&#xC9C0;</a>&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xB098;&#xC911;&#xC5D0; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><strong>&#xB3D9;&#xC791; &#xC6D0;&#xB9AC;</strong></p>
<p>&#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; <em>&#xBB38;&#xC7A5;(statement)</em>&#xC73C;&#xB85C; &#xAD6C;&#xC131;&#xB429;&#xB2C8;&#xB2E4;. &#xC55E;&#xC5D0;&#xC11C; &#xC791;&#xC131;&#xD55C; &#xCCAB; &#xBC88;&#xC9F8; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xB294; &#xB2E8; &#xD558;&#xB098;&#xC758; &#xBB38;&#xC7A5;&#xB9CC; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xBB38;&#xC7A5;&#xC5D0;&#xC11C; &quot;hello world&quot;&#xB77C;&#xB294; &#xD14D;&#xC2A4;&#xD2B8;&#xB97C; &#xB123;&#xC740; <code>print</code> <em>&#xBB38;&#xC7A5;</em>&#xC744; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xB3C4;&#xC6C0;&#xC774;-&#xD544;&#xC694;&#xD574;&#xC694;">&#xB3C4;&#xC6C0;&#xC774; &#xD544;&#xC694;&#xD574;&#xC694;</h2>
<p>&#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xC11C; &#xC5B4;&#xB5A4; &#xD568;&#xC218;&#xB098; &#xBB38;&#xC7A5;&#xC5D0; &#xAD00;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xACE7;&#xBC14;&#xB85C; &#xD655;&#xC778;&#xD558;&#xACE0; &#xC2F6;&#xB2E4;&#xBA74; &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xB0B4;&#xC7A5;&#xB41C; <code>help</code> &#xAE30;&#xB2A5;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xC774; &#xAE30;&#xB2A5;&#xC740; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130; &#xD504;&#xB86C;&#xD504;&#xD2B8;&#xB97C; &#xC774;&#xC6A9;&#xD560; &#xB54C; &#xD2B9;&#xD788; &#xC720;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, <code>help(&apos;len&apos;)</code>&#xC744; &#xC2E4;&#xD589;&#xD558;&#xBA74; &#xD56D;&#xBAA9;&#xC758; &#xAC1C;&#xC218;&#xB97C; &#xC138;&#xB294; &#xB370; &#xC4F0;&#xB294; <code>len</code> &#xD568;&#xC218;&#xC758; &#xB3C4;&#xC6C0;&#xB9D0;&#xC774; &#xD45C;&#xC2DC;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xD301;: &#xB3C4;&#xC6C0;&#xB9D0;&#xC5D0;&#xC11C; &#xBE60;&#xC838;&#xB098;&#xC624;&#xB824;&#xBA74; <code>q</code>&#xB97C; &#xC785;&#xB825;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC640; &#xBE44;&#xC2B7;&#xD558;&#xAC8C; &#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xC11C;&#xB294; &#xAC70;&#xC758; &#xBAA8;&#xB4E0; &#xAC83;&#xC5D0; &#xAD00;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xAC00;&#xC838;&#xC62C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <code>help()</code>&#xB97C; &#xC774;&#xC6A9;&#xD574; <code>help</code> &#xC790;&#xCCB4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBC95;&#xC744; &#xD655;&#xC778;&#xD574; &#xBCF4;&#xC138;&#xC694;!</p>
<p><code>return</code> &#xAC19;&#xC740; &#xC5F0;&#xC0B0;&#xC790;&#xC5D0; &#xB300;&#xD55C; &#xB3C4;&#xC6C0;&#xB9D0;&#xC774; &#xD544;&#xC694;&#xB2E4;&#xBA74; &#xD30C;&#xC774;&#xC36C;&#xC774; &#xD63C;&#xB3D9;&#xD558;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; <code>help(&apos;return&apos;)</code>&#xCC98;&#xB7FC; &#xB530;&#xC634;&#xD45C;&#xB97C; &#xB123;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xC815;&#xB9AC;">&#xC815;&#xB9AC;</h2>
<p>&#xC774;&#xC81C; &#xC5B4;&#xB835;&#xC9C0; &#xC54A;&#xAC8C; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD558;&#xACE0; &#xC800;&#xC7A5;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC744; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7FC; &#xD30C;&#xC774;&#xC36C; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xB410;&#xC73C;&#xB2C8; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xBA87; &#xAC00;&#xC9C0; &#xAC1C;&#xB150;&#xB4E4;&#xC744; &#xB354; &#xBC30;&#xC6CC;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<hr>
<blockquote id="fn_1">
<sup>1</sup>. &apos;Beginning Perl&apos;&#xC774;&#xB77C;&#xB294; &#xB180;&#xB77C;&#xC6B4; &#xCC45;&#xC758; &#xC800;&#xC790;<a href="#reffn_1" title="Jump back to footnote [1] in the text."> &#x21A9;</a>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="installation.html" class="navigation navigation-prev " aria-label="Previous page: 설치">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="basics.html" class="navigation navigation-next " aria-label="Next page: 기초">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"첫 걸음","level":"1.6","depth":1,"next":{"title":"기초","level":"1.7","depth":1,"path":"basics.md","ref":"basics.md","articles":[]},"previous":{"title":"설치","level":"1.5","depth":1,"path":"installation.md","ref":"installation.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{"authorUrl":"https://www.swaroopch.com/about/","buyBookUrl":"https://www.swaroopch.com/buybook/","contactUrl":"https://www.swaroopch.com/contact/","downloadUrl":"https://github.com/swaroopch/byte-of-python/releases/latest","officialUrl":"https://python.swaroopch.com/","pythonVersion":"3.6.0","sourceUrl":"https://github.com/swaroopch/byte-of-python","vimBookUrl":"https://vim.swaroopch.com/"},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"first_steps.md","mtime":"2020-06-11T14:34:30.095Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-06-15T13:40:57.676Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

