
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>부록: FLOSS · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="about.html" />
    
    
    <link rel="prev" href="what_next.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="dedication.html">
            
                <a href="dedication.html">
            
                    
                    헌사
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    들어가며
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="about_python.html">
            
                <a href="about_python.html">
            
                    
                    파이썬 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="installation.html">
            
                <a href="installation.html">
            
                    
                    설치
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="first_steps.html">
            
                <a href="first_steps.html">
            
                    
                    첫 걸음
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="basics.html">
            
                <a href="basics.html">
            
                    
                    기초
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="op_exp.html">
            
                <a href="op_exp.html">
            
                    
                    연산자와 표현식
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="control_flow.html">
            
                <a href="control_flow.html">
            
                    
                    제어 흐름
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="functions.html">
            
                <a href="functions.html">
            
                    
                    함수
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="modules.html">
            
                <a href="modules.html">
            
                    
                    모듈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="data_structures.html">
            
                <a href="data_structures.html">
            
                    
                    자료구조
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="problem_solving.html">
            
                <a href="problem_solving.html">
            
                    
                    문제 해결
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="oop.html">
            
                <a href="oop.html">
            
                    
                    객체지향 프로그래밍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="io.html">
            
                <a href="io.html">
            
                    
                    입출력
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="exceptions.html">
            
                <a href="exceptions.html">
            
                    
                    예외
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="stdlib.html">
            
                <a href="stdlib.html">
            
                    
                    표준 라이브러리
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="more.html">
            
                <a href="more.html">
            
                    
                    기타 주제
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="what_next.html">
            
                <a href="what_next.html">
            
                    
                    더 나아가기
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.20" data-path="floss.html">
            
                <a href="floss.html">
            
                    
                    부록: FLOSS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="about.html">
            
                <a href="about.html">
            
                    
                    부록: 이 책에 관해
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="revision_history.html">
            
                <a href="revision_history.html">
            
                    
                    부록: 개정 이력
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="translations.html">
            
                <a href="translations.html">
            
                    
                    부록: 번역본
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="translation_howto.html">
            
                <a href="translation_howto.html">
            
                    
                    부록: 번역 방법
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="feedback.html">
            
                <a href="feedback.html">
            
                    
                    피드백
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >부록: FLOSS</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
                                <section class="normal markdown-section">
                                
                                <h1 id="floss">&#xBD80;&#xB85D;: FLOSS </h1>
<blockquote>
<p>&#xCC38;&#xACE0;: &#xC774; &#xB0B4;&#xC6A9;&#xC740; 2003&#xB144;&#xC5D0; &#xC4F0;&#xC5EC;&#xC84C;&#xAE30;&#xC5D0; &#xC77C;&#xBD80; &#xB0B4;&#xC6A9;&#xC740; &#xC774;&#xC0C1;&#xD558;&#xAC8C; &#xBCF4;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4; :-)</p>
</blockquote>
<p>&quot;Free/Libre and Open Source Software&quot;, &#xC904;&#xC5EC;&#xC11C; <a href="http://en.wikipedia.org/wiki/FLOSS" target="_blank">FLOSS</a>&#xB294; &#xACF5;&#xB3D9;&#xCCB4;&#xB77C;&#xB294; &#xAC1C;&#xB150;&#xC744; &#xD1A0;&#xB300;&#xB85C; &#xD558;&#xBA70;, &#xACF5;&#xB3D9;&#xCCB4; &#xC790;&#xCCB4;&#xB294; &#xACF5;&#xC720;, &#xD2B9;&#xD788; &#xC9C0;&#xC2DD;&#xC758; &#xACF5;&#xC720;&#xB77C;&#xB294; &#xAC1C;&#xB150;&#xC744; &#xADFC;&#xAC04;&#xC744; &#xB450;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. FLOSS&#xB294; &#xC0AC;&#xC6A9;, &#xC218;&#xC815;, &#xC7AC;&#xBC30;&#xD3EC;&#xAC00; &#xC790;&#xC720;&#xB86D;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xCC45;&#xC744; &#xC774;&#xBBF8; &#xC77D;&#xC73C;&#xC168;&#xB2E4;&#xBA74; &#xADF8;&#xB3D9;&#xC548; &#xACC4;&#xC18D; <em>&#xD30C;&#xC774;&#xC36C;</em>&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xC624;&#xC168;&#xC744; &#xD14C;&#xACE0;, &#xD30C;&#xC774;&#xC36C;&#xC740; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC774; FLOSS&#xC5D0; &#xC774;&#xBBF8; &#xCE5C;&#xC219;&#xD558;&#xC2E4; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C;&#xC740; &#xACF5;&#xB3D9;&#xCCB4; &#xC8FC;&#xB3C4;&#xC758; &#xACF5;&#xC720;&#xC640; &#xC81C;&#xC791;&#xC744; &#xD1B5;&#xD574; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C8; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC774; &#xBB34;&#xC2A8; &#xB73B;&#xC778;&#xC9C0; &#xC54C;&#xB824;&#xC8FC;&#xAE30; &#xC704;&#xD55C; FLOSS&#xC758; &#xC608;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><a href="http://www.kernel.org" target="_blank">&#xB9AC;&#xB205;&#xC2A4;(Linux)</a>: GNU/&#xB9AC;&#xB205;&#xC2A4; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; FLOSS OS &#xCEE4;&#xB110;&#xC785;&#xB2C8;&#xB2E4;. &#xB9AC;&#xB205;&#xC2A4;, &#xC989; &#xCEE4;&#xB110;&#xC740; &#xB9AC;&#xB204;&#xC2A4; &#xD1A0;&#xBC1C;&#xC988;&#xAC00; &#xD559;&#xC0DD;&#xC77C; &#xB54C; &#xC2DC;&#xC791;&#xB410;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC548;&#xB4DC;&#xB85C;&#xC774;&#xB4DC;&#xB294; &#xB9AC;&#xB205;&#xC2A4;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD569;&#xB2C8;&#xB2E4;. &#xC624;&#xB298;&#xB0A0; &#xBCFC; &#xC218; &#xC788;&#xB294; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xC6F9;&#xC0AC;&#xC774;&#xD2B8;&#xB294; &#xB300;&#xBD80;&#xBD84; &#xB9AC;&#xB205;&#xC2A4;&#xB97C; &#xD1B5;&#xD574; &#xC6B4;&#xC601;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><a href="http://www.ubuntu.com" target="_blank">&#xC6B0;&#xBD84;&#xD22C;(Ubuntu)</a>: &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xC8FC;&#xB3C4;&#xD615; &#xB9AC;&#xB205;&#xC2A4; &#xBC30;&#xD3EC;&#xD310;&#xC73C;&#xB85C;&#xC11C;, &#xCE90;&#xB178;&#xB2C8;&#xCEEC;(Canonical)&#xC774; &#xD6C4;&#xC6D0;&#xD558;&#xACE0; &#xC624;&#xB298;&#xB0A0; &#xAC00;&#xC7A5; &#xC778;&#xAE30; &#xC788;&#xB294; GNU/&#xB9AC;&#xB205;&#xC2A4; &#xBC30;&#xD3EC;&#xD310;&#xC785;&#xB2C8;&#xB2E4;. &#xC6B0;&#xBD84;&#xD22C;&#xC5D0;&#xC11C;&#xB294; &#xAD49;&#xC7A5;&#xD788; &#xB9CE;&#xC740; FLOSS&#xB97C; &#xC124;&#xCE58;&#xD560; &#xC218; &#xC788;&#xACE0;, &#xC774; &#xBAA8;&#xB4E0; &#xAC83;&#xB4E4;&#xC740; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC27D;&#xACE0; &#xC124;&#xCE58;&#xD558;&#xAE30; &#xC27D;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB34;&#xC5C7;&#xBCF4;&#xB2E4;&#xB3C4; &#xCEF4;&#xD4E8;&#xD130;&#xB97C; &#xC7AC;&#xBD80;&#xD305;&#xD558;&#xACE0; &#xB098;&#xC11C; CD&#xB97C; &#xD1B5;&#xD574; GNU/&#xB9AC;&#xB205;&#xC2A4;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC0C8;&#xB85C;&#xC6B4; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xB97C; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0; &#xC124;&#xCE58;&#xD558;&#xAE30; &#xC804;&#xC5D0; &#xC644;&#xC804;&#xD788; &#xC2DC;&#xD5D8;&#xD574; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC6B0;&#xBD84;&#xD22C; &#xC804;&#xCCB4;&#xAC00; &#xC790;&#xC720; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB294; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xC6B0;&#xBD84;&#xD22C;&#xC5D0;&#xB294; &#xB3C5;&#xC810; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB098; &#xD38C;&#xC6E8;&#xC5B4;, &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC77C;&#xBD80; &#xD3EC;&#xD568;&#xB3FC; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><a href="http://www.libreoffice.org/" target="_blank">&#xB9AC;&#xBE0C;&#xB808;&#xC624;&#xD53C;&#xC2A4;(LibreOffice)</a>: &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xC8FC;&#xB3C4;&#xB85C; &#xAC1C;&#xBC1C;&#xB41C; &#xD6CC;&#xB96D;&#xD55C; &#xC0AC;&#xBB34;&#xC6A9; &#xC81C;&#xD488;&#xAD70;&#xC73C;&#xB85C;&#xC11C; &#xC6CC;&#xB4DC;&#xD504;&#xB85C;&#xC138;&#xC11C;, &#xD504;&#xB808;&#xC820;&#xD14C;&#xC774;&#xC158; &#xB3C4;&#xAD6C;, &#xC2A4;&#xD504;&#xB808;&#xB4DC;&#xC2DC;&#xD2B8;, &#xB4DC;&#xB85C;&#xC789; &#xB3C4;&#xAD6C; &#xB4F1;&#xC774; &#xD3EC;&#xD568;&#xB3FC; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8; &#xC6CC;&#xB4DC;&#xB098; &#xD30C;&#xC6CC;&#xD3EC;&#xC778;&#xD2B8; &#xD30C;&#xC77C;&#xC744; &#xC190;&#xC27D;&#xAC8C; &#xC5F4;&#xACE0; &#xD3B8;&#xC9D1;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC70;&#xC758; &#xBAA8;&#xB4E0; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xBA70; &#xC644;&#xC804;&#xD55C; &#xBB34;&#xB8CC; &#xBC0F; &#xC790;&#xC720; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><a href="http://www.mozilla.org/products/firefox" target="_blank">&#xBAA8;&#xC9C8;&#xB77C; &#xD30C;&#xC774;&#xC5B4;&#xD3ED;&#xC2A4;(Mozilla Firefox)</a>: &#xCD5C;&#xACE0;&#xC758; &#xC6F9; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC785;&#xB2C8;&#xB2E4;. &#xBB34;&#xCC99;&#xC774;&#xB098; &#xBE60;&#xB974;&#xACE0; &#xC2E4;&#xC6A9;&#xC801;&#xC774;&#xACE0; &#xC778;&#xC0C1;&#xC801;&#xC778; &#xAE30;&#xB2A5;&#xB4E4;&#xB85C; &#xD638;&#xD3C9;&#xBC1B;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD655;&#xC7A5;&#xAE30;&#xB2A5;&#xC774;&#xB77C;&#xB294; &#xAC1C;&#xB150;&#xC744; &#xD1B5;&#xD574; &#xC628;&#xAC16; &#xC885;&#xB958;&#xC758; &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xB3C4; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><a href="http://www.mono-project.com" target="_blank">&#xBAA8;&#xB178;(Mono)</a>: &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8; &#xB2F7;&#xB137;(.NET) &#xD50C;&#xB7AB;&#xD3FC;&#xC758; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xAD6C;&#xD604;&#xCCB4;&#xC785;&#xB2C8;&#xB2E4;. GNU/&#xB9AC;&#xB205;&#xC2A4;, Windows, FreeBSD, macOS&#xB97C; &#xBE44;&#xB86F;&#xD55C; &#xB2E4;&#xB978; &#xC5EC;&#xB7EC; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0;&#xC11C; &#xB2F7;&#xB137; &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC81C;&#xC791;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p><a href="http://httpd.apache.org" target="_blank">&#xC544;&#xD30C;&#xCE58; &#xC6F9; &#xC11C;&#xBC84;(Apache web server)</a>: &#xC778;&#xAE30; &#xC788;&#xB294; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xC6F9; &#xC11C;&#xBC84;&#xC785;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC2E4; &#xC544;&#xD30C;&#xCE58; &#xC6F9; &#xC11C;&#xBC84;&#xB294; &#xC9C0;&#xAD6C;&#xC0C1;&#xC5D0;&#xC11C; &#xAC00;&#xC7A5; &#xB110;&#xB9AC; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC6F9; &#xC11C;&#xBC84;&#xC785;&#xB2C8;&#xB2E4;! &#xC804;&#xCCB4; &#xC6F9; &#xC0AC;&#xC774;&#xD2B8;&#xC758; 50% &#xC774;&#xC0C1;&#xC774; &#xC544;&#xD30C;&#xCE58; &#xC6F9; &#xC11C;&#xBC84;&#xB97C; &#xD1B5;&#xD574; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xAC83;&#xC740; &#xC0AC;&#xC2E4;&#xC778;&#xB370;, &#xC544;&#xD30C;&#xCE58;&#xB294; &#xB2E4;&#xB978; &#xBAA8;&#xB4E0; &#xACBD;&#xC7C1;&#xC790;(&#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC18C;&#xD504;&#xD2B8; IIS&#xB97C; &#xD3EC;&#xD568;&#xD55C;)&#xB4E4;&#xC774; &#xC6B4;&#xC601;&#xD558;&#xB294; &#xC6F9;&#xC0AC;&#xC774;&#xD2B8; &#xC218;&#xB97C; &#xBAA8;&#xB450; &#xD569;&#xCE5C; &#xAC83;&#xBCF4;&#xB2E4; &#xB9CE;&#xC740; &#xC6F9; &#xC0AC;&#xC774;&#xD2B8;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><a href="http://www.videolan.org/vlc/" target="_blank">VLC &#xD50C;&#xB808;&#xC774;&#xC5B4;(VLC Player)</a>: DivX&#xC5D0;&#xC11C; MP3, Ogg, VCD, DVD &#xB4F1;&#xC5D0; &#xC774;&#xB974;&#xAE30;&#xAE4C;&#xC9C0; &#xBAA8;&#xB4E0; &#xAC83;&#xB4E4;&#xC744; &#xC7AC;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xB294; &#xB3D9;&#xC601;&#xC0C1; &#xD50C;&#xB808;&#xC774;&#xC5B4;&#xC785;&#xB2C8;&#xB2E4;... &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xAC00; &#xC7AC;&#xBC0C;&#xC9C0; &#xC54A;&#xB2E4;&#xACE0; &#xB204;&#xAC00; &#xAC10;&#xD788; &#xC774;&#xC57C;&#xAE30;&#xD560; &#xC218; &#xC788;&#xC744;&#xAE4C;&#xC694;? ;-)</p>
<p>&#xC774; &#xBAA9;&#xB85D;&#xC740; &#xBE59;&#xC0B0;&#xC758; &#xC77C;&#xAC01;&#xC5D0; &#xBD88;&#xACFC;&#xD569;&#xB2C8;&#xB2E4;. &#xD384;(Perl) &#xC5B8;&#xC5B4;, PHP &#xC5B8;&#xC5B4;, &#xC6F9;&#xC0AC;&#xC774;&#xD2B8;&#xB97C; &#xC704;&#xD55C; &#xB4DC;&#xB8E8;&#xD314;(Drupal) &#xCF58;&#xD150;&#xCE20; &#xAD00;&#xB9AC; &#xC2DC;&#xC2A4;&#xD15C;, PostgreSQL &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4; &#xC11C;&#xBC84;, TORCS &#xB808;&#xC774;&#xC2F1; &#xAC8C;&#xC784;, KDevelop IDE, Xine &#xB3D9;&#xC601;&#xC0C1; &#xD50C;&#xB808;&#xC774;&#xC5B4;, VIM &#xC5D0;&#xB514;&#xD130;, Quanta+ &#xC5D0;&#xB514;&#xD130;, Banshee &#xC624;&#xB514;&#xC624; &#xD50C;&#xB808;&#xC774;&#xC5B4;, GIMP &#xC774;&#xBBF8;&#xC9C0; &#xD3B8;&#xC9D1;&#xAE30;... &#xB4F1;&#xB4F1;  &#xD6E8;&#xC52C; &#xB354; &#xB9CE;&#xC740; FLOSS&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xBAA9;&#xB85D;&#xC740; &#xACC4;&#xC18D;&#xD574;&#xC11C; &#xB298;&#xC5B4;&#xB0A0; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>FLOSS &#xC138;&#xACC4;&#xC758; &#xCD5C;&#xC2E0; &#xC720;&#xD589;&#xC5B4;&#xAC00; &#xAD81;&#xAE08;&#xD558;&#xB2E4;&#xBA74; &#xC544;&#xB798; &#xC6F9;&#xC0AC;&#xC774;&#xD2B8;&#xB97C; &#xD655;&#xC778;&#xD574; &#xBCF4;&#xC138;&#xC694;:</p>
<ul>
<li><a href="http://www.omgubuntu.co.uk/" target="_blank">OMG! Ubuntu!</a></li>
<li><a href="http://www.webupd8.org/" target="_blank">Web Upd8</a></li>
<li><a href="http://www.distrowatch.com" target="_blank">DistroWatch</a></li>
<li><a href="http://planet.debian.org/" target="_blank">Planet Debian</a></li>
</ul>
<p>FLOSS&#xC5D0; &#xAD00;&#xD55C; &#xB354; &#xC790;&#xC138;&#xD55C; &#xC815;&#xBCF4;&#xAC00; &#xAD81;&#xAE08;&#xD558;&#xB2E4;&#xBA74; &#xC544;&#xB798; &#xC6F9; &#xC0AC;&#xC774;&#xD2B8;&#xB97C; &#xBC29;&#xBB38;&#xD574; &#xBCF4;&#xC138;&#xC694;.</p>
<ul>
<li><a href="http://github.com/explore" target="_blank">GitHub Explore</a></li>
<li><a href="http://www.codetriage.com/" target="_blank">Code Triage</a></li>
<li><a href="http://www.sourceforge.net" target="_blank">SourceForge</a></li>
<li><a href="http://www.freshmeat.net" target="_blank">FreshMeat</a></li>
</ul>
<p>&#xADF8;&#xB7FC; &#xC774;&#xD1A0;&#xB85D; &#xAC70;&#xB300;&#xD558;&#xACE0; &#xC790;&#xC720;&#xB86D;&#xACE0; &#xC5F4;&#xB824; &#xC788;&#xB294; FLOSS&#xC758; &#xC138;&#xACC4;&#xB97C; &#xD0D0;&#xD5D8;&#xD574; &#xBCF4;&#xC138;&#xC694;!</p>

                                
                                </section>
                            
                        </div>
                    </div>
                
            </div>

            
                
                <a href="what_next.html" class="navigation navigation-prev " aria-label="Previous page: 더 나아가기">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="about.html" class="navigation navigation-next " aria-label="Next page: 부록: 이 책에 관해">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"부록: FLOSS","level":"1.20","depth":1,"next":{"title":"부록: 이 책에 관해","level":"1.21","depth":1,"path":"about.md","ref":"about.md","articles":[]},"previous":{"title":"더 나아가기","level":"1.19","depth":1,"path":"what_next.md","ref":"what_next.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{"authorUrl":"https://www.swaroopch.com/about/","buyBookUrl":"https://www.swaroopch.com/buybook/","contactUrl":"https://www.swaroopch.com/contact/","downloadUrl":"https://github.com/swaroopch/byte-of-python/releases/latest","officialUrl":"https://python.swaroopch.com/","pythonVersion":"3.6.0","sourceUrl":"https://github.com/swaroopch/byte-of-python","vimBookUrl":"https://vim.swaroopch.com/"},"plugins":[],"pluginsConfig":{"highlight":{},"search":{"maxIndexSize":1000000},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"floss.md","mtime":"2020-06-29T12:44:51.198Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-06-29T13:51:01.069Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/buttons.js"></script>
        
    

    </body>
</html>

