
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>소개 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="dedication.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="dedication.html">
            
                <a href="dedication.html">
            
                    
                    헌사
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    들어가며
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="about_python.html">
            
                <a href="about_python.html">
            
                    
                    파이썬 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="installation.html">
            
                <a href="installation.html">
            
                    
                    설치
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="first_steps.html">
            
                <a href="first_steps.html">
            
                    
                    첫 걸음
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="basics.html">
            
                <a href="basics.html">
            
                    
                    기초
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="op_exp.html">
            
                <a href="op_exp.html">
            
                    
                    연산자와 표현식
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="control_flow.html">
            
                <a href="control_flow.html">
            
                    
                    제어 흐름
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="functions.html">
            
                <a href="functions.html">
            
                    
                    함수
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="modules.html">
            
                <a href="modules.html">
            
                    
                    모듈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="data_structures.html">
            
                <a href="data_structures.html">
            
                    
                    자료구조
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="problem_solving.html">
            
                <a href="problem_solving.html">
            
                    
                    문제 해결
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="oop.html">
            
                <a href="oop.html">
            
                    
                    객체지향 프로그래밍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="io.html">
            
                <a href="io.html">
            
                    
                    입출력
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="exceptions.html">
            
                <a href="exceptions.html">
            
                    
                    예외
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="stdlib.html">
            
                <a href="stdlib.html">
            
                    
                    표준 라이브러리
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="more.html">
            
                <a href="more.html">
            
                    
                    기타 주제
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="what_next.html">
            
                <a href="what_next.html">
            
                    
                    더 나아가기
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="floss.html">
            
                <a href="floss.html">
            
                    
                    부록: FLOSS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="about.html">
            
                <a href="about.html">
            
                    
                    부록: 이 책에 관해
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="revision_history.html">
            
                <a href="revision_history.html">
            
                    
                    부록: 개정 이력
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="translations.html">
            
                <a href="translations.html">
            
                    
                    부록: 번역본
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="translation_howto.html">
            
                <a href="translation_howto.html">
            
                    
                    부록: 번역 방법
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="feedback.html">
            
                <a href="feedback.html">
            
                    
                    피드백
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >소개</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
                                <section class="normal markdown-section">
                                
                                <h1 id="a-byte-of-python">A Byte of Python</h1>
<p>&quot;A Byte of Python&quot;&#xC740; &#xD30C;&#xC774;&#xC36C; &#xC5B8;&#xC5B4;&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC5D0; &#xAD00;&#xD55C; &#xBB34;&#xB8CC; &#xCC45;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; &#xCD08;&#xBCF4;&#xC790;&#xB97C; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xD30C;&#xC774;&#xC36C; &#xC5B8;&#xC5B4;&#xC5D0; &#xB300;&#xD55C; &#xC790;&#xC2B5;&#xC11C; &#xB610;&#xB294; &#xC548;&#xB0B4;&#xC11C; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;. &#xCEF4;&#xD4E8;&#xD130;&#xC5D0; &#xAD00;&#xD55C; &#xC9C0;&#xC2DD;&#xC73C;&#xB85C; &#xD14D;&#xC2A4;&#xD2B8; &#xD30C;&#xC77C;&#xC744; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xBC29;&#xBC95; &#xC815;&#xB3C4;&#xB9CC; &#xC544;&#xB294; &#xBD84;&#xC774;&#xB77C;&#xBA74; &#xC774; &#xCC45;&#xC774; &#xBC14;&#xB85C; &#xC5EC;&#xB7EC;&#xBD84;&#xC744; &#xC704;&#xD55C; &#xCC45;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h2 id="a-byte-of-python-&#xD55C;&#xAD6D;&#xC5B4;&#xD310;">A Byte of Python &#xD55C;&#xAD6D;&#xC5B4;&#xD310;</h2>
<p>&#xC774; &#xCC45;&#xC740; <a href="https://swaroopch.com/" target="_blank">Swaroop Chitlur</a>&#xC758; <a href="https://python.swaroopch.com/" target="_blank">A Byte of Python</a>&#xC744; &#xD55C;&#xAD6D;&#xC5B4;&#xB85C; &#xBC88;&#xC5ED;&#xD55C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC758; &#xACF5;&#xC2DD; &#xD648;&#xD398;&#xC774;&#xC9C0;&#xB294; <a href="https://python.swaroopch.com/" target="_blank">https://python.swaroopch.com/</a>&#xC774;&#xBA70;, &#xC774;&#xACF3;&#xC5D0;&#xC11C; &#xC6D0;&#xBCF8; &#xD14D;&#xC2A4;&#xD2B8;&#xB97C; &#xD655;&#xC778;&#xD558;&#xC2E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xD30C;&#xC774;&#xC36C;-3">&#xD30C;&#xC774;&#xC36C; 3</h2>
<p>&#xC774; &#xCC45;&#xC5D0;&#xC11C;&#xB294; &#xD30C;&#xC774;&#xC36C; 3 &#xBC84;&#xC804;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB3C4;&#xB85D; &#xC54C;&#xB824;&#xC904; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xC774; &#xCC45;&#xC744; &#xD1B5;&#xD574; &#xC870;&#xAE08; &#xB354; &#xC624;&#xB798;&#xB410;&#xACE0; &#xB354; &#xB110;&#xB9AC; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD30C;&#xC774;&#xC36C; 2 &#xBC84;&#xC804;&#xC5D0; &#xC801;&#xC751;&#xD558;&#xB294; &#xB370;&#xB3C4; &#xB3C4;&#xC6C0;&#xC744; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="who-reads-bop">&#xB3C5;&#xC790; &#xC11C;&#xD3C9; </h2>
<p>&#xB2E4;&#xC74C;&#xC740; &#xC774; &#xCC45;&#xC744; &#xC77D;&#xC73C;&#xC2E0; &#xBD84;&#xB4E4;&#xC758; &#xC11C;&#xD3C9;&#xC785;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>&#xC774; &#xCC45;&#xC740; &#xAC70;&#xC758; 10&#xB144; &#xC804;&#xC5D0; &#xC800;&#xB97C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xC785;&#xBB38;&#xD558;&#xAC8C; &#xD574;&#xC900; &#xCC45;&#xC785;&#xB2C8;&#xB2E4;. @swaroopch &#xB2D8;, &#xACE0;&#xB9D9;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2F9;&#xC2E0;&#xC774; &#xC81C; &#xC778;&#xC0DD;&#xC744; &#xBC14;&#xAFE8;&#xC2B5;&#xB2C8;&#xB2E4;.
-- <a href="https://twitter.com/TheDumbTechGuy/status/1157245235052929024" target="_blank">Stefan Froelich</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC774; &#xCC45;&#xC774; &#xC800;&#xC5D0;&#xAC8C; &#xC900; &#xD070; &#xB3C4;&#xC6C0;&#xC5D0; &#xAC10;&#xC0AC;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC774; &#xBA54;&#xC77C;&#xC744; &#xC4F0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC774; &#xCC45;&#xC740; &#xC81C;&#xAC00; &#xAD49;&#xC7A5;&#xD788; &#xC990;&#xAC81;&#xAC8C; &#xC77D;&#xC740; &#xC544;&#xC8FC; &#xD6CC;&#xB96D;&#xD55C; &#xCC45;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD55C;&#xBC88;&#xB3C4; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xD574;&#xBCF8; &#xC801; &#xC5C6;&#xB294; 15&#xC0B4;&#xC9DC;&#xB9AC;&#xC5D0;&#xAC8C;&#xB294; &#xC778;&#xD130;&#xB137;&#xC744; &#xD1B5;&#xD574; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xBC30;&#xC6B0;&#xAE30;&#xAC00; &#xC5B4;&#xB824;&#xC6E0;&#xACE0; &#xC800;&#xB294; &#xC544;&#xBB34;&#xAC83;&#xB3C4; &#xC774;&#xD574;&#xD560; &#xC218; &#xC5C6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7F0;&#xB370; &#xC774; &#xCC45;&#xC740; &#xD6E8;&#xC52C; &#xB354; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC27D;&#xAC8C; &#xB290;&#xAEF4;&#xC84C;&#xACE0; &#xADF8; &#xB355;&#xBD84;&#xC5D0; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774;&#xB77C;&#xB294; &#xC2E0;&#xC138;&#xACC4;&#xC5D0; &#xC27D;&#xAC8C; &#xBC1C;&#xC744; &#xB0B4;&#xB514;&#xB51C; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xACE0;&#xB9D9;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xC81C; &#xC800;&#xB294; &#xACE0;&#xC218;&#xC900; &#xC5B8;&#xC5B4;&#xB85C; &#xC190;&#xC27D;&#xAC8C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774; &#xC5B4;&#xB835;&#xACE0; &#xC9C0;&#xB8E8;&#xD55C; &#xC77C;&#xC77C; &#xAC70;&#xB77C; &#xC0DD;&#xAC01;&#xD588;&#xC9C0;&#xB9CC; &#xC774; &#xCC45; &#xB355;&#xBD84;&#xC5D0; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774;&#xB77C;&#xB294; &#xAC83;&#xC774; &#xC5BC;&#xB9C8;&#xB098; &#xC7AC;&#xBC0C;&#xACE0; &#xD765;&#xBBF8;&#xB85C;&#xC6B0;&#xBA74;&#xC11C;&#xB3C4; &#xAC04;&#xB2E8;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC0AC;&#xC2E4;&#xC744; &#xAE68;&#xB2EC;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC800; &#xAC19;&#xC740; &#xCD08;&#xBCF4;&#xC790;&#xB97C; &#xB3D5;&#xAE30; &#xC704;&#xD55C; &#xCC45;&#xC744; &#xC4F0;&#xB290;&#xB77C; &#xACE0;&#xC0DD;&#xD558;&#xC2E0; &#xB370; &#xB300;&#xD574; &#xB2E4;&#xC2DC;&#xAE08; &#xAC10;&#xC0AC;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;.
-- <a href="mailto:protahiyat@gmail.com" target="_blank">Prottyashita Tahiyat</a>, 2019&#xB144; 9&#xC6D4; 17&#xC77C;</p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC774; &#xCC45;&#xC740; &#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xBCF8; &#xCC45; &#xC911;&#xC5D0;&#xC11C; &#xAC00;&#xC7A5; &#xD6CC;&#xB96D;&#xD55C; &#xCD08;&#xC2EC;&#xC790;&#xC6A9; &#xC790;&#xC2B5;&#xC11C;&#xC785;&#xB2C8;&#xB2E4;! &#xB178;&#xACE0;&#xC5D0; &#xAC10;&#xC0AC;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;!
-- <a href="mailto:wmich50@theramp.net" target="_blank">Walt Michalik</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC81C;&#xAC00; &#xBC1C;&#xACAC;&#xD55C; &#xCD5C;&#xACE0;&#xC758; &#xCC45; &quot;A Byte of Python&quot;&#xC740; &#xCD08;&#xBCF4;&#xC790;&#xC5D0;&#xAC8C; &#xC544;&#xC8FC; &#xC88B;&#xC740; &#xCC45;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; &#xC798; &#xC4F0;&#xC5EC;&#xC838; &#xC788;&#xACE0;, &#xCC45;&#xC5D0;&#xC11C; &#xB2E4;&#xB8E8;&#xB294; &#xAC1C;&#xB150;&#xB4E4;&#xC740; &#xB530;&#xB85C; &#xC124;&#xBA85;&#xD560; &#xD544;&#xC694; &#xC5C6;&#xB294; &#xC608;&#xC81C;&#xC640; &#xD568;&#xAED8; &#xC798; &#xC124;&#xBA85;&#xB3FC; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.
-- <a href="mailto:joshrob@poczta.onet.pl" target="_blank">Joshua Robin</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC544;&#xC8FC; &#xD6CC;&#xB96D;&#xD558;&#xACE0; &#xCE5C;&#xC808;&#xD55C; &#xCD08;&#xC2EC;&#xC790;&#xC6A9; #&#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC785;&#xBB38;&#xC11C;
-- <a href="https://twitter.com/ShanRajasekaran/status/268910645842423809" target="_blank">Shan Rajasekaran</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xD398;&#xC774;&#xC9C0;&#xB97C; &#xB118;&#xAE38; &#xB54C;&#xB9C8;&#xB2E4; &#xD30C;&#xC774;&#xC36C;&#xACFC; &#xC0AC;&#xB791;&#xC5D0; &#xBE60;&#xC9C0;&#xAC8C; &#xB428;
-- <a href="https://twitter.com/HerbertFeutl/status/11901471389913088" target="_blank">Herbert Feutl</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC644;&#xBCBD;&#xD55C; &#xD30C;&#xC774;&#xC36C; &#xCD08;&#xBCF4;&#xC790; &#xAC00;&#xC774;&#xB4DC;&#xB85C;&#xC11C; &#xD30C;&#xC774;&#xC36C;&#xC774;&#xB77C;&#xB294; &#xB9C8;&#xBC95;&#xC758; &#xC138;&#xACC4;&#xB97C; &#xC5F4;&#xC5B4;&#xC904; &#xC5F4;&#xC1E0;&#xAC00; &#xB420; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.
-- <a href="https://twitter.com/Dili_mathilakam/status/220033783066411008" target="_blank">Dilip</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC77C;&#xD574;&#xC57C; &#xD558;&#xB294;&#xB370; &quot;A Byte of Python&quot;&#xB97C; &#xBD10;&#xBC84;&#xB838;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD6CC;&#xB96D;&#xD55C; &#xC608;&#xC81C;&#xAC00; &#xB2F4;&#xAE34; &#xBA4B;&#xC9C4; &#xC548;&#xB0B4;&#xC11C;&#xC785;&#xB2C8;&#xB2E4;.
-- <a href="https://twitter.com/BiologistJohn/statuses/194726001803132928" target="_blank">Biologist John</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xCD5C;&#xADFC;&#xC5D0; &quot;A Byte of Python&quot;&#xC744; &#xC77D;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAD49;&#xC7A5;&#xD55C; &#xCC45;&#xC785;&#xB2C8;&#xB2E4;. &#xAC8C;&#xB2E4;&#xAC00; &#xBB34;&#xB8CC;&#xC785;&#xB2C8;&#xB2E4;. &#xD6CC;&#xB96D;&#xD55C; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xAC00; &#xB418;&#xACE0;&#xC790; &#xD558;&#xB294; &#xBD84;&#xB4E4;&#xAED8; &#xC801;&#xADF9; &#xCD94;&#xCC9C;&#xD569;&#xB2C8;&#xB2E4;.
-- <a href="https://twitter.com/mangeshnanoti/status/225680668867321857" target="_blank">Mangesh</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>Swaroop &#xB2D8;&#xC774; &#xC4F4; A Byte of Python. (&#xC9C0;&#xAE08; &#xC77D;&#xACE0; &#xC788;&#xB294; &#xCC45;). &#xC544;&#xB9C8; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xAE30;&#xC5D0; &#xAC00;&#xC7A5; &#xC88B;&#xC740; &#xCC45;&#xC774; &#xC544;&#xB2D0;&#xAE4C; &#xC2F6;&#xACE0;, &#xBAA8;&#xB4E0; &#xCD08;&#xBCF4;&#xC790;, &#xC2EC;&#xC9C0;&#xC5B4; &#xC219;&#xB828;&#xB41C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xC5D0;&#xAC8C;&#xB3C4; &#xC138;&#xC0C1;&#xC5D0;&#xC11C; &#xAC00;&#xC7A5; &#xC88B;&#xC740; &#xCC45;&#xC77C; &#xB4EF;&#xD569;&#xB2C8;&#xB2E4;.
-- <a href="http://apas.gr/2010/04/27/learning-python/" target="_blank">Apostolos</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>@swaroopch &#xB2D8;&#xC774; &#xC4F4; &#xCD5C;&#xACE0;&#xC758; &#xCC45; #ByteOfPython&#xC744; &#xC990;&#xAC81;&#xAC8C; &#xC77D;&#xB294; &#xC911;
-- <a href="https://twitter.com/YuvrajPoudyal/status/448050415356346368" target="_blank">Yuvraj Sharma</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>@swaroopch &#xB2D8;&#xC774; &#xC4F4; &quot;A Byte of Python&quot;&#xC740; &#xC5EC;&#xC804;&#xD788; &quot;&#xD30C;&#xC774;&#xC36C; &#xCD08;&#xBCF4;&#xC790;&#xB97C; &#xC704;&#xD55C; &#xCD5C;&#xACE0;&#xC758; &#xC548;&#xB0B4;&#xC11C;&quot;&#xC785;&#xB2C8;&#xB2E4;.
-- <a href="https://twitter.com/nickaigi/status/1136963950711648256" target="_blank">Nickson Kaigi</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&quot;A Byte of Python&quot;&#xC744; &#xC368;&#xC8FC;&#xC154;&#xC11C; &#xB9E4;&#xC6B0; &#xAC10;&#xC0AC;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; &#xCF54;&#xB529;&#xC744; &#xC2DC;&#xC791;&#xD55C; &#xC9C0; &#xC774;&#xD2C0;&#xBC16;&#xC5D0; &#xC548; &#xB410;&#xB294;&#xB370; &#xBC8C;&#xC368; &#xAC04;&#xB2E8;&#xD55C; &#xAC8C;&#xC784;&#xC744; &#xB9CC;&#xB4E4;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2F9;&#xC2E0;&#xC774; &#xC4F4; &#xC774; &#xCC45;&#xC740; &#xC815;&#xB9D0;&#xB85C; &#xD6CC;&#xB96D;&#xD558;&#xACE0;, &#xC774; &#xCC45;&#xC774; &#xC5BC;&#xB9C8;&#xB098; &#xAC00;&#xCE58; &#xC788;&#xB294; &#xCC45;&#xC778;&#xC9C0; &#xC54C;&#xB824;&#xB4DC;&#xB9AC;&#xACE0; &#xC2F6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.
-- Franklin</p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC800;&#xB294; Dayanandasagar College of Engineering(7&#xD559;&#xAE30;, CSE)&#xB97C; &#xB2E4;&#xB2C8;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6B0;&#xC120; &quot;A Byte Of Python&quot;&#xC774; &#xC800; &#xAC19;&#xC740; &#xD30C;&#xC774;&#xC36C; &#xCD08;&#xBCF4;&#xC790;&#xC5D0;&#xAC8C; &#xB108;&#xBB34;&#xB098;&#xB3C4; &#xC88B;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xB9D0;&#xC500;&#xB4DC;&#xB9AC;&#xACE0; &#xC2F6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC5D0;&#xC11C; &#xB2E4;&#xB8EC; &#xAC1C;&#xB150;&#xB4E4;&#xC740; &#xAC04;&#xB2E8;&#xD55C; &#xC608;&#xC81C;&#xC640; &#xD568;&#xAED8; &#xC798; &#xC124;&#xBA85;&#xB3FC; &#xC788;&#xC5B4;&#xC11C; &#xB355;&#xBD84;&#xC5D0; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xC27D;&#xAC8C; &#xBC30;&#xC6B8; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC815;&#xB9D0; &#xACE0;&#xB9D9;&#xC2B5;&#xB2C8;&#xB2E4;.
-- Madhura</p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC800;&#xB294; 18&#xC0B4;&#xC774;&#xACE0; University in Ireland&#xC5D0; &#xC7AC;&#xD559; &#xC911;&#xC778; IT &#xD559;&#xACFC;&#xC0DD;&#xC785;&#xB2C8;&#xB2E4;. &quot;A Byte of Python&quot;&#xC744; &#xC368;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD558;&#xACE0;, &#xC774; &#xCC45;&#xC744; &#xC77D;&#xAE30; &#xC804;&#xC5D0; &#xC774;&#xBBF8; &#xC800;&#xB294; 3&#xAC00;&#xC9C0; &#xC5B8;&#xC5B4;(C, &#xC790;&#xBC14;, &#xC790;&#xBC14;&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;)&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xACE0; &#xC788;&#xC5C8;&#xC9C0;&#xB9CC; &#xD30C;&#xC774;&#xC36C;&#xC774;&#xC57C;&#xB9D0;&#xB85C; &#xC81C;&#xAC00; &#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xBC30;&#xC6B4; &#xAC00;&#xC7A5; &#xC26C;&#xC6B4; &#xC5B8;&#xC5B4;&#xC600;&#xB294;&#xB370;, &#xADF8;&#xB807;&#xAC8C; &#xB41C; &#xC8FC;&#xB41C; &#xC774;&#xC720;&#xB294; &#xC774; &#xCC45;&#xC774; &#xD658;&#xC0C1;&#xC801;&#xC774;&#xACE0; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xBC30;&#xC6B0;&#xB294; &#xAC83;&#xC744; &#xC544;&#xC8FC; &#xAC04;&#xB2E8;&#xD558;&#xACE0; &#xD765;&#xBBF8;&#xB86D;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5B4; &#xC92C;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; &#xAD49;&#xC7A5;&#xD788; &#xC798; &#xC4F0;&#xC5EC;&#xC84C;&#xACE0;, &#xC81C;&#xAC00; &#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xC77D;&#xC740; &#xCC45; &#xC911;&#xC5D0;&#xC11C; &#xAC00;&#xC7A5; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC26C;&#xC6B4; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xCC45;&#xC785;&#xB2C8;&#xB2E4;. &#xD6CC;&#xB96D;&#xD55C; &#xCC45;&#xC744; &#xC4F0;&#xC2E0; &#xAC83;&#xC744; &#xCD95;&#xD558;&#xB4DC;&#xB9AC;&#xACE0; &#xC55E;&#xC73C;&#xB85C;&#xB3C4; &#xACC4;&#xC18D; &#xBA4B;&#xC9C4; &#xCC45;&#xC744; &#xC368;&#xC8FC;&#xC2DC;&#xAE38; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;.
-- Matt</p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;, &#xC800;&#xB294; &#xB3C4;&#xBBF8;&#xB2C8;&#xCE74; &#xACF5;&#xD654;&#xAD6D;&#xC5D0; &#xC0B4;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC81C; &#xC774;&#xB984;&#xC740; &#xD30C;&#xBCA8;(Pavel)&#xC774;&#xACE0;, &#xCD5C;&#xADFC;&#xC5D0; <em>A Byte of Python</em>&#xC744; &#xC77D;&#xC5C8;&#xB294;&#xB370; &#xC544;&#xC8FC; &#xBA4B;&#xC9C4; &#xCC45;&#xC774;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD569;&#xB2C8;&#xB2E4;!! :). &#xC800;&#xB294; &#xC774; &#xCC45;&#xC758; &#xBAA8;&#xB4E0; &#xC608;&#xC81C;&#xB85C;&#xBD80;&#xD130; &#xB9CE;&#xC740; &#xAC83;&#xC744; &#xBC30;&#xC6E0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; &#xC800; &#xAC19;&#xC740; &#xCD08;&#xC2EC;&#xC790;&#xC5D0;&#xAC8C; &#xD070; &#xB3C4;&#xC6C0;&#xC774; &#xB429;&#xB2C8;&#xB2E4;...
-- <a href="mailto:pavel.simo@gmail.com" target="_blank">Pavel Simo</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC800;&#xB294; &#xC9C0;&#xAE08; &#xC911;&#xAD6D;&#xC5D0; &#xC0B4;&#xACE0; &#xC788;&#xB294; &#xD559;&#xC0DD;&#xC774;&#xBA70;, &quot;A Byte of Python&quot;&#xC744; &#xC77D;&#xC5C8;&#xB294;&#xB370;, &#xC815;&#xB9D0; &#xBA4B;&#xC9C4; &#xCC45;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; &#xC544;&#xC8FC; &#xAC04;&#xB2E8;&#xD558;&#xC9C0;&#xB9CC; &#xBAA8;&#xB4E0; &#xCD08;&#xBCF4;&#xC790;&#xC5D0;&#xAC8C; &#xB3C4;&#xC6C0;&#xC774; &#xB429;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; &#xC790;&#xBC14;&#xC640; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xCEF4;&#xD4E8;&#xD305;&#xC5D0; &#xAD00;&#xC2EC;&#xC774; &#xC788;&#xACE0; &#xC11C;&#xBC84;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD574;&#xC57C; &#xD574;&#xC11C; &#xD30C;&#xC774;&#xC36C;&#xC774; &#xAD1C;&#xCC2E;&#xC740; &#xC120;&#xD0DD;&#xC9C0;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD588;&#xB294;&#xB370;, &#xC774; &#xCC45;&#xC744; &#xC77D;&#xACE0; &#xB098;&#xC11C;&#xB294; &#xD30C;&#xC774;&#xC36C;&#xC774; &#xADF8;&#xB0E5; &#xAD1C;&#xCC2E;&#xC740; &#xC120;&#xD0DD;&#xC9C0;&#xB97C; &#xB118;&#xC5B4;&#xC11C;&#xC11C; &#xBC18;&#xB4DC;&#xC2DC; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xC368;&#xC57C;&#xACA0;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC81C; &#xC601;&#xC5B4;&#xAC00; &#xADF8;&#xB9AC; &#xAD1C;&#xCC2E;&#xC9C0;&#xB294; &#xC54A;&#xC9C0;&#xB9CC; &#xADF8;&#xC800; &#xC774;&#xBA54;&#xC77C;&#xC744; &#xD1B5;&#xD574; &#xAC10;&#xC0AC; &#xC778;&#xC0AC;&#xB97C; &#xB4DC;&#xB9AC;&#xACE0; &#xC2F6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;! &#xB2F9;&#xC2E0;&#xACFC; &#xB2F9;&#xC2E0; &#xAC00;&#xC871; &#xBAA8;&#xB450;&#xC5D0;&#xAC8C; &#xD589;&#xC6B4;&#xC744; &#xBE55;&#xB2C8;&#xB2E4;.
-- Roy Lau</p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xADFC;&#xB798;&#xC5D0; &quot;A Byte of Python&quot;&#xC744; &#xC77D;&#xACE0; &#xB098;&#xC11C; &#xAC10;&#xC0AC; &#xC778;&#xC0AC;&#xB97C; &#xB4DC;&#xB824;&#xC57C;&#xACA0;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC758; &#xB9C8;&#xC9C0;&#xB9C9; &#xD398;&#xC774;&#xC9C0;&#xB97C; &#xB118;&#xAE30;&#xACE0; &#xC774;&#xC81C; &#xC7AC;&#xBBF8;&#xC5C6;&#xACE0; &#xB530;&#xBD84;&#xD55C; &#xC624;&#xB77C;&#xC77C;&#xB9AC; &#xB4F1;&#xB4F1;&#xC758; &#xD30C;&#xC774;&#xC36C; &#xB9E4;&#xB274;&#xC5BC;&#xC744; &#xBCF4;&#xC790;&#xB2C8; &#xAD49;&#xC7A5;&#xD788; &#xC2AC;&#xD515;&#xB2C8;&#xB2E4;. &#xC544;&#xBB34;&#xD2BC; &#xC774; &#xCC45;&#xC744; &#xC368;&#xC8FC;&#xC154;&#xC11C; &#xC815;&#xB9D0;&#xB85C; &#xAC10;&#xC0AC;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;.
<a href="mailto:sy137@gmail.com" target="_blank">Samuel Young</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>Swaroop &#xB2D8;&#xAED8;. &#xC800;&#xB294; &#xAC00;&#xB974;&#xCE58;&#xB294; &#xB370; &#xB3C4;&#xBB34;&#xC9C0; &#xAD00;&#xC2EC;&#xC774; &#xC5C6;&#xB294; &#xAC15;&#xC0AC;&#xAC00; &#xAC00;&#xB974;&#xCE58;&#xB294; &#xC218;&#xC5C5;&#xC744; &#xD558;&#xB098; &#xB4E3;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xC218;&#xC5C5;&#xC5D0;&#xC11C;&#xB294; &#xC624;&#xB77C;&#xC77C;&#xB9AC; &#xCD9C;&#xD310;&#xC0AC;&#xC5D0;&#xC11C; &#xD3B4;&#xB0B8; &quot;Learning Python&quot; 2&#xD310;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC9C0;&#xC2DD;&#xC774; &#xC5C6;&#xB294; &#xCD08;&#xBCF4;&#xC790;&#xB97C; &#xC704;&#xD55C; &#xCC45;&#xB3C4; &#xC544;&#xB2C8;&#xACE0; &#xB2E4;&#xB978; &#xBD84;&#xC57C;&#xC5D0; &#xC885;&#xC0AC;&#xD588;&#xC5B4;&#xC57C; &#xD560; &#xAC15;&#xC0AC;&#xB97C; &#xC704;&#xD55C; &#xCC45;&#xB3C4; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xCC45;&#xC744; &#xC368;&#xC8FC;&#xC154;&#xC11C; &#xB9E4;&#xC6B0; &#xAC10;&#xC0AC;&#xD558;&#xACE0;, &#xC774; &#xCC45;&#xC774; &#xC5C6;&#xC5C8;&#xB2E4;&#xBA74; &#xD30C;&#xC774;&#xC36C;&#xACFC; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC758; &#xAC10;&#xC744; &#xC7A1;&#xC9C0; &#xBABB;&#xD588;&#xC744; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC2DC; &#xD55C;&#xBC88; &#xC815;&#xB9D0;&#xB85C; &#xAC10;&#xC0AC;&#xD558;&#xACE0;, &#xB2F9;&#xC2E0;&#xC5D0;&#xAC8C;&#xB294; &#xCD08;&#xBCF4;&#xC790;&#xAC00; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xB294; &#xC218;&#xC900;&#xC73C;&#xB85C; &#xC27D;&#xAC8C; &#xC124;&#xBA85;&#xD560; &#xC218; &#xC788;&#xB294; &#xB2A5;&#xB825;&#xC774; &#xC788;&#xACE0;, &#xC774;&#xAC74; &#xC544;&#xBB34;&#xB098; &#xD560; &#xC218; &#xC788;&#xB294; &#xC77C;&#xC774; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;.
-- <a href="mailto:jduarte1@cfl.rr.com" target="_blank">Joseph Duarte</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC774; &#xCC45; &#xC815;&#xB9D0; &#xB9C8;&#xC74C;&#xC5D0; &#xB4ED;&#xB2C8;&#xB2E4;! &#xC774; &#xCC45;&#xC740; &#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xBCF8; &#xAC83; &#xC911; &#xAC00;&#xC7A5; &#xD6CC;&#xB96D;&#xD55C; &#xD30C;&#xC774;&#xC36C; &#xC790;&#xC2B5;&#xC11C;&#xC774;&#xC790; &#xC544;&#xC8FC; &#xC720;&#xC6A9;&#xD55C; &#xCC38;&#xACE0;&#xC11C;&#xC785;&#xB2C8;&#xB2E4;. &#xC544;&#xC8FC;&#xC544;&#xC8FC; &#xB6F0;&#xC5B4;&#xB09C; &#xC9C4;&#xC9DC; &#xAC78;&#xC791;&#xC785;&#xB2C8;&#xB2E4;! &#xC55E;&#xC73C;&#xB85C;&#xB3C4; &#xACC4;&#xC18D; &#xC88B;&#xC740; &#xCC45;&#xC744; &#xC368;&#xC8FC;&#xC138;&#xC694;!
-- Chris-Andr&#xE9; Sommerseth</p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC6B0;&#xC120; &#xD6CC;&#xB96D;&#xD55C; &#xCC45;&#xC744; &#xC368; &#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD558;&#xB2E4;&#xACE0; &#xB9D0;&#xC500;&#xB4DC;&#xB9AC;&#xACE0; &#xC2F6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; &#xC774; &#xCC45;&#xC774; &#xD30C;&#xC774;&#xC36C; &#xCD08;&#xBCF4;&#xC790;&#xB97C; &#xC704;&#xD55C; &#xC790;&#xC2B5;&#xC11C;&#xB97C; &#xCC3E;&#xB294; &#xBD84;&#xB4E4;&#xAED8; &#xC88B;&#xC740; &#xCC45;&#xC774;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD569;&#xB2C8;&#xB2E4;. &#xC81C;&#xAC00; &#xC774; &#xCC45;&#xC5D0; &#xAD00;&#xD574; &#xB4E4;&#xC5C8;&#xB358; &#xAC8C; &#xC544;&#xB9C8; 2~3&#xB144; &#xC804; &#xCBE4;&#xC77C; &#xAC81;&#xB2C8;&#xB2E4;. &#xB2F9;&#xC2DC; &#xC800;&#xB294; &#xC544;&#xC9C1; &#xC601;&#xC5B4;&#xB85C; &#xB41C; &#xCC45;&#xC744; &#xC77D;&#xC744; &#xC218; &#xC5C6;&#xC5B4;&#xC11C; &#xC911;&#xAD6D;&#xC5B4; &#xBC88;&#xC5ED;&#xD310;&#xC744; &#xC77D;&#xACE0; &#xB098;&#xC11C; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC758; &#xBB38;&#xC744; &#xC5F4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADFC;&#xB798;&#xC5D0; &#xC774; &#xCC45;&#xC744; &#xB2E4;&#xC2DC; &#xC77D;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB3C;&#xB860; &#xC774;&#xBC88;&#xC5D0;&#xB294; &#xC601;&#xC5B4;&#xD310;&#xC744; &#xC77D;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; &#xC0AC;&#xC804;&#xC744; &#xCC3E;&#xC9C0; &#xC54A;&#xACE0;&#xB3C4; &#xCC45; &#xD55C; &#xAD8C;&#xC744; &#xC804;&#xBD80; &#xC77D;&#xC744; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC8C; &#xBBFF;&#xAE30;&#xC9C0; &#xC54A;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2F9;&#xC5F0;&#xD788; &#xC774; &#xBAA8;&#xB4E0; &#xAC83;&#xC740; &#xC774;&#xD1A0;&#xB85D; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC26C;&#xC6B4; &#xCC45;&#xC744; &#xB9CC;&#xB4E4;&#xAE30; &#xC704;&#xD574; &#xB178;&#xB825;&#xD55C; &#xB2F9;&#xC2E0; &#xB355;&#xBD84;&#xC785;&#xB2C8;&#xB2E4;.
-- <a href="https://github.com/swaroopch/byte_of_python/pull/13" target="_blank">myd7349</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&quot;Byte of Python&quot;&#xC744; &#xC368;&#xC8FC;&#xC2E0; &#xB370; &#xB300;&#xD574; &#xAC10;&#xC0AC;&#xB4DC;&#xB9AC;&#xACE0;&#xC790; &#xBA54;&#xC77C;&#xC744; &#xC501;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC744; &#xC6B0;&#xC5F0;&#xD788; &#xBC1C;&#xACAC;&#xD558;&#xAE30; &#xC804;&#xC5D0; &#xC800;&#xB294; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xBC30;&#xC6B0;&#xB824;&#xACE0; &#xBA87; &#xAC1C;&#xC6D4;&#xC9F8; &#xC560;&#xC4F0;&#xACE0; &#xC788;&#xC5C8;&#xACE0;, pyGame&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xB370; &#xC870;&#xAE08;&#xC774;&#xB098;&#xB9C8; &#xC131;&#xACFC;&#xB97C; &#xAC70;&#xB450;&#xAE30;&#xB3C4; &#xD588;&#xC9C0;&#xB9CC; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC644;&#xC131;&#xD558;&#xC9C4; &#xBABB;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC30;&#xC6CC;&#xC57C; &#xD560; &#xB0B4;&#xC6A9;&#xC744; &#xB2E8;&#xC21C;&#xD558;&#xAC8C; &#xC815;&#xB9AC;&#xD574; &#xC8FC;&#xC2E0; &#xB355;&#xBD84;&#xC5D0; &#xD30C;&#xC774;&#xC36C;&#xC774; &#xB2EC;&#xC131; &#xAC00;&#xB2A5;&#xD55C; &#xBAA9;&#xD45C;&#xB85C; &#xBCF4;&#xC5EC;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9C8;&#xCE68;&#xB0B4; &#xC774; &#xCC45;&#xC744; &#xD1B5;&#xD574; &#xAE30;&#xCD08;&#xC801;&#xC778; &#xB0B4;&#xC6A9;&#xC744; &#xC775;&#xD614;&#xB2E4;&#xACE0; &#xB290;&#xAEF4;&#xC84C;&#xACE0; &#xC9C4;&#xC9DC; &#xBAA9;&#xD45C;&#xC778; &#xAC8C;&#xC784; &#xBC1C;&#xB85C; &#xACC4;&#xC18D; &#xB098;&#xC544;&#xAC08; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. ... &#xB2E4;&#xC2DC; &#xD55C;&#xBC88; &#xAE30;&#xCD08;&#xC801;&#xC778; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xB300;&#xD55C; &#xCCB4;&#xACC4;&#xC801;&#xC774;&#xACE0; &#xC720;&#xC6A9;&#xD55C; &#xC548;&#xB0B4;&#xC11C;&#xB97C; &#xC778;&#xD130;&#xB137;&#xC5D0; &#xACF5;&#xAC1C;&#xD574; &#xC8FC;&#xC154;&#xC11C; &#xC815;&#xB9D0; &#xAC10;&#xC0AC;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;. &#xB2E4;&#xB978; &#xB450; &#xAD8C;&#xC758; &#xCC45;&#xC5D0;&#xC11C;&#xB294; &#xC2E4;&#xD328;&#xD588;&#xC9C0;&#xB9CC; &#xC774; &#xCC45;&#xC744; &#xD1B5;&#xD574; OOP&#xB97C; &#xC81C;&#xB300;&#xB85C; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.
-- <a href="mailto:m_gallivan12@hotmail.com" target="_blank">Matt Gallivan</a></p>
</blockquote>
<!-- -->
<blockquote>
<p><em>A Byte of Python</em>&#xC744; &#xC368;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45; &#xB355;&#xBD84;&#xC5D0; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xBC30;&#xC6B0;&#xB294; &#xAC00;&#xC7A5; &#xC88B;&#xC740; &#xBC29;&#xBC95;&#xC744; &#xC54C;&#xAC8C; &#xB410;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; 15&#xC0B4;&#xC774;&#xACE0; &#xC774;&#xC9D1;&#xD2B8;&#xC5D0; &#xC0B4;&#xACE0; &#xC788;&#xC73C;&#xBA70;, &#xC774;&#xB984;&#xC740; &#xC544;&#xBA54;&#xB4DC;(Ahmed)&#xC785;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC740; &#xC800;&#xC758; &#xB450; &#xBC88;&#xC9F8; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xC600;&#xACE0;, &#xD559;&#xAD50;&#xC5D0;&#xC11C; &#xBE44;&#xC8FC;&#xC5BC; &#xBCA0;&#xC774;&#xC9C1; 6&#xC744; &#xBC30;&#xC6E0;&#xB294;&#xB370; &#xC7AC;&#xBC0C;&#xC9C4; &#xC54A;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xBC30;&#xC6B0;&#xB294; &#xAC74; &#xC815;&#xB9D0;&#xB85C; &#xC990;&#xAC70;&#xC6E0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; &#xC8FC;&#xC18C;&#xB85D; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xB9CC;&#xB4DC;&#xB294; &#xB370; &#xC131;&#xACF5;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB3C4; &#xB354; &#xB9CC;&#xB4E4;&#xC5B4; &#xBCF4;&#xACE0; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB3C4; &#xC77D;&#xC5B4;&#xBCF4;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;(&#xCC38;&#xACE0;&#xD560; &#xB9CC;&#xD55C; &#xC790;&#xB8CC;&#xB97C; &#xC54C;&#xB824;&#xC8FC;&#xC2DC;&#xBA74; &#xC88B;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;). &#xADF8;&#xB9AC;&#xACE0; &#xC790;&#xBC14;&#xB3C4; &#xBC30;&#xC6CC;&#xBCF4;&#xB824;&#xACE0; &#xD558;&#xB294;&#xB370;, &#xC774; &#xCC45;&#xB9CC;&#xD07C; &#xAD1C;&#xCC2E;&#xC740; &#xC790;&#xC2B5;&#xC11C;&#xB97C; &#xC5B4;&#xB514;&#xC5D0;&#xC11C; &#xBCFC; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xC54C;&#xB824;&#xC8FC;&#xC2E0;&#xB2E4;&#xBA74; &#xD070; &#xB3C4;&#xC6C0;&#xC774; &#xB420; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xACE0;&#xB9D9;&#xC2B5;&#xB2C8;&#xB2E4;.
-- <a href="mailto:sedo_91@hotmail.com" target="_blank">Ahmed Mohammed</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xD30C;&#xC774;&#xC36C;&#xC744; &#xBC30;&#xC6B0;&#xACE0; &#xC2F6;&#xC740; &#xCD08;&#xBCF4;&#xC790;&#xB97C; &#xC704;&#xD55C; &#xB354;&#xC5C6;&#xC774; &#xC88B;&#xC740; &#xC790;&#xB8CC;&#xB294; Swaroop C H &#xB2D8;&#xC774; &#xC4F4; 110&#xCABD;&#xC9DC;&#xB9AC; PDF &#xC790;&#xC2B5;&#xC11C;&#xC778; &quot;A Byte of Python&quot;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; &#xC798; &#xC4F0;&#xC5EC;&#xC84C;&#xACE0;, &#xC774;&#xD574;&#xD558;&#xAE30; &#xC26C;&#xC6B0;&#xBA70;, &#xC544;&#xB9C8;&#xB3C4; &#xCD5C;&#xACE0;&#xC758; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC785;&#xBB38;&#xC11C;&#xC77C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.
-- <a href="http://www.linux.com/feature/126522" target="_blank">Drew Ames</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC5B4;&#xC81C; Nokia N800&#x3139; &quot;Byte of Python&quot;&#xC744; &#xB300;&#xBD80;&#xBD84; &#xC77D;&#xC5B4;&#xBD24;&#xB294;&#xB370; &#xC774; &#xCC45;&#xC740; &#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xC77D;&#xC5B4;&#xBCF8; &#xCC45; &#xC911;&#xC5D0;&#xC11C; &#xAC00;&#xC7A5; &#xC27D;&#xACE0; &#xAC04;&#xACB0;&#xD55C; &#xD30C;&#xC774;&#xC36C; &#xC785;&#xBB38;&#xC11C;&#xC785;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C; &#xD559;&#xC2B5;&#xC758; &#xCD9C;&#xBC1C;&#xC810;&#xC73C;&#xB85C; &#xC774; &#xCC45;&#xC744; &#xC801;&#xADF9; &#xCD94;&#xCC9C;&#xD569;&#xB2C8;&#xB2E4;.
-- <a href="http://paxmodept.com/telesto/blogitem.htm?id=627" target="_blank">Jason Delport</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>@swaroopch &#xB2D8;&#xC774; &#xC4F4; &quot;Byte of Vim&quot;&#xACFC; &quot;Byte of Python&quot;&#xC740; &#xC81C;&#xAC8C; &#xC788;&#xC5B4;&#xC11C; &#xD14C;&#xD06C;&#xB2C8;&#xCEEC; &#xB77C;&#xC774;&#xD305; &#xBD84;&#xC57C;&#xC758; &#xB2E8;&#xC5F0;&#xCF54; &#xCD5C;&#xACE0;&#xC758; &#xCC45;&#xC785;&#xB2C8;&#xB2E4;. &#xD6CC;&#xB96D;&#xD55C; &#xCC45; #FeelGoodFactor
-- <a href="http://twitter.com/suren/status/12840485454" target="_blank">Surendran</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&quot;Byte of Python&quot;&#xC740; &#xB2E8;&#xC5F0;&#xCF54; &#xCD5C;&#xACE0;&#xC758; &#xCC45;&#xC785;&#xB2C8;&#xB2E4;(&quot;&#xD30C;&#xC774;&#xC36C; &#xAE30;&#xCD08;&#xB97C; &#xBC30;&#xC6B0;&#xB294; &#xB370; &#xC88B;&#xACE0; &#xBE44;&#xC6A9;&#xC774; &#xB9CE;&#xC774; &#xB4E4;&#xC9C0; &#xC54A;&#xB294; &#xC790;&#xB8CC;&#xB97C; &#xD558;&#xB098; &#xCD94;&#xCC9C;&#xD574; &#xC8FC;&#xC2E4; &#xC218; &#xC788;&#xB098;&#xC694;?&quot;&#xB77C;&#xB294; &#xC9C8;&#xBB38;&#xC5D0; &#xB2F5;&#xD558;&#xBA70;)
-- <a href="http://www.facebook.com/pythonlang/posts/406873916788" target="_blank">Justin LoveTrue</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&quot;Byte of Python&quot;&#xC774; &#xD070; &#xB3C4;&#xC6C0;&#xC774; &#xB410;&#xC2B5;&#xB2C8;&#xB2E4;. ..&#xC815;&#xB9D0; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4; :)
<a href="https://twitter.com/a_chinmay/status/258822633741762560" target="_blank">Chinmay</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC800;&#xB294; &#xB298; &#xCD08;&#xAE09; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xC640; &#xC911;&#xAE09; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38; &#xBAA8;&#xB450;&#xB97C; &#xC704;&#xD574; &#xC4F0;&#xC5EC;&#xC9C4; &quot;A Byte of Python&quot;&#xC758; &#xD32C;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.
-- <a href="http://stackoverflow.com/a/457785/4869" target="_blank">Patrick Harrington</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xBA70;&#xCE60; &#xC804;&#xBD80;&#xD130; &#xC774; &#xCC45;&#xC73C;&#xB85C; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xBC30;&#xC6B0;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;..&#xBA4B;&#xC9C4; &#xCC45;&#xC744; &#xC368;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; &#xC544;&#xC8FC; &#xC798; &#xC4F0;&#xC5EC;&#xC838; &#xC788;&#xACE0;, &#xB355;&#xBD84;&#xC5D0; &#xACE0;&#xC0DD;&#xC744; &#xB35C;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;..&#xADF8;&#xB798;&#xC11C; &#xD32C;&#xC774; &#xD55C; &#xBA85; &#xB354; &#xB298;&#xC5C8;&#xB2E4;&#xBA74;..&#xADF8;&#xAC8C; &#xBC14;&#xB85C; &#xC811;&#xB2C8;&#xB2E4; :) &#xC815;&#xB9D0; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.
-- <a href="https://twitter.com/Pagal_e_azam/statuses/242865885256232960" target="_blank">Gadadhari Bheem</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xD30C;&#xC774;&#xC36C; &#xBC30;&#xC6B0;&#xAE30; &#xC804;&#xC5D0; &#xC774;&#xBBF8; &#xC800;&#xB294; &#xC5B4;&#xC148;&#xBE14;&#xB9AC;, C, C++, C#, &#xC790;&#xBC14;&#xC758; &#xAE30;&#xCD08;&#xC801;&#xC778; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xAE30;&#xC220;&#xC744; &#xC2B5;&#xB4DD;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC744; &#xBC30;&#xC6B0;&#xACE0; &#xC2F6;&#xC5C8;&#xB358; &#xAC00;&#xC7A5; &#xD070; &#xC774;&#xC720;&#xB294; &#xD30C;&#xC774;&#xC36C;&#xC774; &#xC778;&#xAE30; &#xC788;&#xACE0;(&#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xB300;&#xD574; &#xC774;&#xC57C;&#xAE30;&#xD558;&#xB2C8;&#xAE4C;&#xC694;) &#xAC15;&#xB825;&#xD558;&#xB2E4;&#xB294;(&#xD604;&#xC2E4;&#xC801;&#xC778; &#xC774;&#xC720;) &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; Swaroop &#xB2D8;&#xC774; &#xC4F0;&#xC2E0; &#xCC45;&#xC774;&#xACE0; &#xCC98;&#xC74C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xBD84;&#xB4E4;&#xACFC; &#xC2E0;&#xC785; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38; &#xBAA8;&#xB450;&#xC5D0;&#xAC8C; &#xC88B;&#xC740; &#xC548;&#xB0B4;&#xC11C;&#xC785;&#xB2C8;&#xB2E4;. &#xC5F4;&#xD758; &#xB3D9;&#xC548; &#xD55C;&#xB098;&#xC808;&#xC529;&#xB9CC; &#xC774; &#xCC45;&#xC744; &#xC77D;&#xC5B4;&#xBCF4;&#xC138;&#xC694;. &#xD070; &#xB3C4;&#xC6C0;&#xC774; &#xB420; &#xAC81;&#xB2C8;&#xB2E4;!
-- <a href="mailto:fangbiyi@gmail.com" target="_blank">Fang Biyi (PhD Candidate ECE, Michigan State University)</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC774; &#xCC45;&#xC744; &#xC368;&#xC8FC;&#xC154;&#xC11C; &#xC815;&#xB9D0;&#xB85C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;!! &#xC774; &#xCC45; &#xB355;&#xBD84;&#xC5D0; &#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xAC19;&#xC740; &#xD30C;&#xC774;&#xC36C;&#xC758; &#xD2B9;&#xC815; &#xCE21;&#xBA74;&#xC5D0; &#xAD00;&#xD574; &#xD488;&#xC5C8;&#xB358; &#xC5EC;&#xB7EC; &#xC758;&#xBB38;&#xB4E4;&#xC774; &#xD574;&#xC18C;&#xB410;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC81C;&#xAC00; OO &#xC804;&#xBB38;&#xAC00;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xC9C0;&#xB294; &#xC54A;&#xC9C0;&#xB9CC; &#xCC98;&#xC74C; &#xC2DC;&#xC791;&#xD560; &#xB54C;&#xB294; &#xC774; &#xCC45;&#xC774; &#xB3C4;&#xC6C0;&#xC774; &#xB410;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xC81C; &#xC2DC;&#xC2A4;&#xD15C; &#xAD00;&#xB9AC;&#xC790;&#xC778; &#xC800;&#xC5D0;&#xAC8C; &#xD544;&#xC694;&#xD55C; &#xC2E4;&#xC81C; &#xC5C5;&#xBB34;&#xB97C; &#xC218;&#xD589;&#xD558;&#xB294; &#xBA87; &#xAC00;&#xC9C0; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB4E4;&#xC740; &#xBAA8;&#xB450; &#xC808;&#xCC28;&#xC9C0;&#xD5A5;&#xC801;&#xC774;&#xACE0; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xC0AC;&#xB78C;&#xB4E4;&#xC758; &#xAE30;&#xC900;&#xC5D0; &#xB530;&#xB974;&#xBA74; &#xADDC;&#xBAA8;&#xAC00; &#xC791;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC2DC; &#xD55C;&#xBC88; &#xC774; &#xCC45;&#xC744; &#xC368;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC778;&#xD130;&#xB137;&#xC5D0; &#xACF5;&#xAC1C;&#xD574; &#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.
-- Bob</p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC81C;&#xAC00; &#xC2E4;&#xC81C;&#xB85C; &#xC77D;&#xC5B4;&#xBCF8; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xAD00;&#xD55C; &#xCCAB; &#xCC45;&#xC744; &#xC368;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xB4DC;&#xB9AC;&#xACE0; &#xC2F6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xC81C; &#xD30C;&#xC774;&#xC36C;&#xC740; &#xC800;&#xC758; &#xCCAB; &#xC5B8;&#xC5B4;&#xC774;&#xACE0;, &#xC800;&#xB294; &#xBAA8;&#xB4E0; &#xAC00;&#xB2A5;&#xC131;&#xB4E4;&#xC744; &#xC0C1;&#xC0C1;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB410;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xC81C;&#xAC00; &#xC774;&#xC804;&#xC5D0;&#xB294; &#xC0C1;&#xC0C1;&#xD560; &#xC218;&#xC870;&#xCC28; &#xC5C6;&#xC5C8;&#xB358; &#xAC83;&#xB4E4;&#xC744; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC904; &#xB3C4;&#xAD6C;&#xB97C; &#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.
-- &quot;The Walrus&quot;</p>
</blockquote>
<!-- -->
<blockquote>
<p><em>A Byte Of Python</em>(2 &#xBC84;&#xC804;&#xACFC; 3 &#xBC84;&#xC804;)&#xC744; &#xC368;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; &#xC81C;&#xAC00; &#xD30C;&#xC774;&#xC36C;&#xACFC; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xBC30;&#xC6B0;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xADC0;&#xC911;&#xD55C; &#xC5ED;&#xD560;&#xC744; &#xD574;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; &#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xB450;&#xC5B4; &#xB2EC; &#xC815;&#xB3C4; &#xB3C5;&#xD559;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC138;&#xACC4;&#xC758; &#xCD08;&#xBCF4;&#xC790;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB3D9;&#xC548; &#xC720;&#xD29C;&#xBE0C; &#xB3D9;&#xC601;&#xC0C1;&#xACFC; &#xB2E4;&#xB978; &#xC778;&#xD130;&#xB137; &#xC0C1;&#xC5D0; &#xBB34;&#xB8CC;&#xB85C; &#xBC30;&#xD3EC;&#xB41C; &#xCC45;&#xB4E4;&#xC744; &#xD1B5;&#xD574; &#xACF5;&#xBD80;&#xD574;&#xC624;&#xB2E4;&#xAC00; &#xC5B4;&#xC800;&#xAED8; &#xC774; &#xCC45;&#xC744; &#xC77D;&#xC5B4;&#xBCF4;&#xAE30;&#xB85C; &#xB9C8;&#xC74C;&#xBA39;&#xC5C8;&#xACE0;, &#xCC98;&#xC74C; &#xBA87; &#xD398;&#xC774;&#xC9C0;&#xB9CC; &#xC77D;&#xC5C8;&#xB294;&#xB370;&#xB3C4; &#xB2E4;&#xB978; &#xC5B4;&#xB5A4; &#xCC45;&#xC774;&#xB098; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC;&#xBCF4;&#xB2E4; &#xB9CE;&#xC740; &#xAC83;&#xC744; &#xBC30;&#xC6B8; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB3D9;&#xC548; &#xD5F7;&#xAC08;&#xB838;&#xB358; &#xBA87;&#xBA87; &#xBD80;&#xBD84;&#xB4E4;&#xC774; &#xC815;&#xB9D0; &#xD6CC;&#xB96D;&#xD55C; &#xC608;&#xC81C;&#xC640; &#xC124;&#xBA85;&#xC73C;&#xB85C; &#xAE54;&#xB054;&#xD558;&#xAC8C; &#xC815;&#xB9AC;&#xB410;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5B4;&#xC11C; &#xBE68;&#xB9AC; &#xC774; &#xCC45;&#xC744; &#xB9C8;&#xC800; &#xC77D;&#xC5B4;&#xC11C; &#xBC30;&#xC6B0;&#xACE0; &#xC2F6;&#xC2B5;&#xB2C8;&#xB2E4;!! &#xC774; &#xCC45;&#xC744; &#xC368;&#xC8FC;&#xC2E0; &#xAC83;&#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; CCL(&#xBB34;&#xB8CC;)&#xB85C; &#xC81C;&#xACF5;&#xD574; &#xC8FC;&#xC154;&#xC11C; &#xC815;&#xB9D0; &#xACE0;&#xB9D9;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800; &#xAC19;&#xC740; &#xC0AC;&#xB78C;&#xB4E4;&#xC744; &#xB3D5;&#xACE0; &#xAC00;&#xB974;&#xCE58;&#xB294; &#xB2F9;&#xC2E0; &#xAC19;&#xC740; &#xC774;&#xD0C0;&#xC801;&#xC778; &#xBD84;&#xB4E4;&#xC774; &#xC788;&#xB2E4;&#xB294; &#xC0AC;&#xC2E4;&#xC5D0; &#xD558;&#xB290;&#xB2D8;&#xAED8; &#xAC10;&#xC0AC;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;.
-- Chris</p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC800;&#xB294; &#xC9C0;&#xB09C; 2011&#xB144;&#xC5D0; &#xB2F5;&#xC7A5;&#xC744; &#xC368;&#xC11C; &#xBCF4;&#xB0B4;&#xB4DC;&#xB838;&#xB294;&#xB370; &#xB2F9;&#xC2DC; &#xC800;&#xB294; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xB9C9; &#xC2DC;&#xC791;&#xD558;&#xACE0; &#xC788;&#xC5C8;&#xACE0; &quot;A Byte of Python&quot;&#xC744; &#xC368;&#xC8FC;&#xC2E0; &#xB370; &#xB300;&#xD574; &#xAC10;&#xC0AC;&#xB4DC;&#xB9AC;&#xACE0; &#xC2F6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC774; &#xC5C6;&#xC5C8;&#xB2E4;&#xBA74; &#xB3C4;&#xC911;&#xC5D0; &#xC2E4;&#xD328;&#xD558;&#xACE0; &#xB9D0;&#xC558;&#xC744; &#xAC81;&#xB2C8;&#xB2E4;. &#xADF8; &#xD6C4;&#xB85C; &#xC800;&#xB294; &#xD68C;&#xC0AC;&#xC5D0;&#xC11C; &#xD30C;&#xC774;&#xC36C;&#xC73C;&#xB85C; &#xC5EC;&#xB7EC; &#xD568;&#xC218;&#xB97C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800; &#xC2A4;&#xC2A4;&#xB85C;&#xB97C; &#xACE0;&#xAE09; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xB77C;&#xACE0; &#xC790;&#xBD80;&#xD560; &#xC218;&#xB294; &#xC5C6;&#xACA0;&#xC9C0;&#xB9CC; &#xC81C;&#xAC00; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xC0AC;&#xC6A9;&#xD574;&#xC628; &#xC774;&#xD6C4;&#xB85C; &#xC800;&#xD55C;&#xD14C; &#xB3C4;&#xC6C0;&#xC744; &#xCCAD;&#xD558;&#xB294; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &quot;Byte&quot;&#xB77C;&#xB294; &#xCC45;&#xC744; &#xC77D;&#xB294; &#xB3D9;&#xC548; &#xC81C;&#xAC00; C&#xB098; C++&#xB97C; &#xACF5;&#xBD80;&#xD558;&#xB294; &#xAC83;&#xC744; &#xC911;&#xB2E8;&#xD588;&#xB358; &#xC774;&#xC720;&#xB97C; &#xC54C;&#xAC8C; &#xB410;&#xB294;&#xB370; &#xADF8; &#xC774;&#xC720;&#xB294; &#xC774; &#xCC45;&#xC774; &#xC99D;&#xAC15; &#xD560;&#xB2F9;(augmented assignment)&#xC774; &#xD3EC;&#xD568;&#xB41C; &#xC608;&#xC81C;&#xB85C; &#xC2DC;&#xC791;&#xD588;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xBB3C;&#xB860; &#xC774; &#xC5F0;&#xC0B0;&#xC790;&#xC5D0; &#xB300;&#xD55C; &#xC124;&#xBA85;&#xC740; &#xC5C6;&#xC5C8;&#xACE0;, &#xC5F0;&#xC0B0;&#xC790;&#xAC00; &#xB4F1;&#xC7A5;&#xD55C; &#xD398;&#xC774;&#xC9C0;&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xB41C; &#xB0B4;&#xC6A9;&#xC744; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB178;&#xB825;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xAC83;&#xC774; &#xC544;&#xB9C8;&#xB3C4; &#xC81C;&#xAC00; &#xACB0;&#xAD6D;&#xC5D4; &#xD3EC;&#xAE30;&#xD588;&#xB358; &#xAC00;&#xC7A5; &#xC2E4;&#xB9DD;&#xC2A4;&#xB7EC;&#xC6B4; &#xC2E4;&#xC2B5;&#xC774;&#xC5C8;&#xC744; &#xAC81;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xB2E4;&#xACE0; &#xD574;&#xC11C; C&#xB098; C++&#xB97C; &#xBC30;&#xC6B0;&#xB294; &#xAC83;&#xC774; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xAC70;&#xB098; &#xC81C;&#xAC00; &#xBA4D;&#xCCAD;&#xD558;&#xB2E4;&#xB294; &#xC758;&#xBBF8;&#xB294; &#xC544;&#xB2C8;&#xBA70;, &#xB2E8;&#xC9C0; &#xC81C;&#xAC00; &#xBD24;&#xB358; &#xBB38;&#xC11C;&#xC5D0;&#xC11C; &#xBA85;&#xB839;&#xC5B4;&#xC758; &#xC911;&#xC694; &#xBD80;&#xBD84;&#xC744; &#xCC28;&#xC9C0;&#xD558;&#xB294; &#xAE30;&#xD638;&#xB098; &#xB2E8;&#xC5B4;&#xB97C; &#xC815;&#xC758;&#xD558;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC758;&#xBBF8;&#xD560; &#xBFD0;&#xC785;&#xB2C8;&#xB2E4;. &#xCEF4;&#xD4E8;&#xD130;&#xAC00; &#xD604;&#xC7AC; &#xC0AC;&#xC6A9; &#xC911;&#xC778; &#xC5B8;&#xC5B4;&#xC758; &#xBB38;&#xBC95;&#xC744; &#xBC97;&#xC5B4;&#xB09C; &#xB2E8;&#xC5B4;&#xB098; &#xAE30;&#xD638;&#xB97C; &#xC774;&#xD574;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xAC83;&#xACFC; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; &#xC5B4;&#xB5A4; &#xBD84;&#xC57C;&#xB97C; &#xCC98;&#xC74C; &#xC811;&#xD558;&#xB294; &#xD559;&#xC0DD;&#xB4E4;&#xC740; &#xC544;&#xBB34;&#xB7F0; &#xC815;&#xC758;&#xAC00; &#xC5C6;&#xB294; &#xB2E8;&#xC5B4;&#xB098; &#xAE30;&#xD638;&#xB97C; &#xB9CC;&#xB098;&#xAC8C; &#xB41C;&#xB2E4;&#xBA74; &#xADF8;&#xB7EC;&#xD55C; &#xC8FC;&#xC81C;&#xB97C; &#xC774;&#xD574;&#xD558;&#xC9C0; &#xBABB;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC5B4;&#xB290; &#xACBD;&#xC6B0;&#xB4E0; &quot;&#xBE14;&#xB8E8; &#xC2A4;&#xD06C;&#xB9B0;&quot;&#xC744; &#xB9CC;&#xB098;&#xAC8C; &#xB418;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xD574;&#xACB0;&#xCC45;&#xC740; &#xAC04;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8; &#xB2E8;&#xC5B4;&#xB098; &#xAE30;&#xD638;&#xB97C; &#xBC1C;&#xACAC;&#xD558;&#xACE0; &#xC801;&#xC808;&#xD55C; &#xC815;&#xC758;&#xB098; &#xAE30;&#xD638;&#xB97C; &#xD655;&#xC778;&#xD558;&#xACE0; &#xB098;&#xBA74; &#xCEF4;&#xD4E8;&#xD130;&#xB098; &#xD559;&#xC0DD;&#xC774; &#xACC4;&#xC18D; &#xC9C4;&#xD589;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; &#xC798; &#xAD6C;&#xC131;&#xB3FC; &#xC788;&#xC5B4;&#xC11C; &#xC774;&#xD574;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xBD80;&#xBD84;&#xC774; &#xAC70;&#xC758; &#xC5C6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xAC10;&#xC0AC;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;. &#xACC4;&#xC18D;&#xD574;&#xC11C; &#xC6A9;&#xC5B4;&#xC758; &#xC804;&#xCCB4; &#xC815;&#xC758;&#xB97C; &#xACC4;&#xC18D; &#xCC45;&#xC5D0; &#xD3EC;&#xD568;&#xD574; &#xC8FC;&#xC2DC;&#xAE38; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xD3EC;&#xD568;&#xB41C; &#xBB38;&#xC11C;&#xB3C4; &#xD55C;&#xBC88; &#xC54C;&#xACE0;&#xB09C; &#xD6C4;&#xC5D0;&#xB294; &#xAD1C;&#xCC2E;&#xC9C0;&#xB9CC;(&#xC81C;&#xAC00; &#xBCF4;&#xAE30;&#xC5D4; &#xC608;&#xC81C;&#xC5D0; &#xAC15;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;) &#xB300;&#xBD80;&#xBD84;&#xC758; &#xACBD;&#xC6B0; &#xBB38;&#xC11C;&#xC758; &#xB0B4;&#xC6A9;&#xC744; &#xC774;&#xD574;&#xD558;&#xAE30; &#xADF8;&#xB7EC;&#xD55C; &#xC0AC;&#xC2E4;&#xC744; &#xC54C;&#xC544;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC740; &#xC81C; &#xC0DD;&#xAC01;&#xC5D0; &#xADF8;&#xB2E4;&#xC9C0; &#xBC14;&#xB78C;&#xC9C1;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC678;&#xBD80;&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xB418;&#xB294; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC;&#xC740; &#xD30C;&#xC774;&#xC36C; &#xACF5;&#xC2DD; &#xBB38;&#xC11C;&#xB97C; &#xD574;&#xC124;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC788;&#xC74C;&#xC744; &#xB098;&#xD0C0;&#xB0B4;&#xBA70;, &#xADF8;&#xB7EC;&#xD55C; &#xC678;&#xBD80; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC;&#xC758; &#xC131;&#xACF5;&#xC740; &#xC6A9;&#xC5B4;&#xB97C; &#xC124;&#xBA85;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB41C; &#xB2E8;&#xC5B4;&#xC5D0; &#xD06C;&#xAC8C; &#xC758;&#xC874;&#xD569;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; &#xC774; &#xCC45;&#xC744; &#xB2E4;&#xB978; &#xB9CE;&#xC740; &#xC774;&#xB4E4;&#xC5D0;&#xAC8C; &#xCD94;&#xCC9C;&#xD574; &#xC654;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xC911; &#xC5B4;&#xB5A4; &#xBD84;&#xC740; &#xD638;&#xC8FC;&#xC5D0;, &#xC5B4;&#xB5A4; &#xBD84;&#xC740; &#xCE90;&#xB9AC;&#xBE44;&#xC548;&#xC5D0;, &#xB610; &#xC5B4;&#xB5A4; &#xBD84;&#xB4E4;&#xC740; &#xBBF8;&#xAD6D;&#xC5D0; &#xC0B4;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; &#xB2E4;&#xB978; &#xCC45;&#xB4E4;&#xC774; &#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB294; &#xD2C8;&#xC0C8;&#xB97C; &#xCC44;&#xC6C1;&#xB2C8;&#xB2E4;. &#xC55E;&#xC73C;&#xB85C;&#xB3C4; &#xAC74;&#xAC15;&#xD558;&#xC2DC;&#xACE0; &#xACC4;&#xC18D;&#xD574;&#xC11C; &#xAC74;&#xC2B9;&#xD558;&#xC2DC;&#xAE38; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;.
-- Nick</p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;, &#xC800;&#xB294; ankush(19)&#xC785;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xB370; &#xCEE4;&#xB2E4;&#xB780; &#xB09C;&#xAD00;&#xC5D0; &#xBD09;&#xCC29;&#xD588;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5EC;&#xB7EC; &#xAD8C;&#xC758; &#xCC45;&#xC744; &#xC77D;&#xC5B4;&#xBD24;&#xC9C0;&#xB9CC; &#xBAA8;&#xB450; &#xB450;&#xAECD;&#xAE30;&#xB9CC; &#xD558;&#xACE0; &#xBAA9;&#xD45C;&#xC9C0;&#xD5A5;&#xC801;&#xC774;&#xC9C0; &#xC54A;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB2E4; &#xC774; &#xCC45;&#xC744; &#xBC1C;&#xACAC;&#xD558;&#xACE0; &#xACE7;&#xBC14;&#xB85C; &#xD30C;&#xC774;&#xC36C;&#xACFC; &#xC0AC;&#xB791;&#xC5D0; &#xBE60;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xCC98;&#xB7FC; &quot;&#xB108;&#xBB34;&#xB098;&#xB3C4; &#xBA4B;&#xC9C4; &#xCC45;&quot;&#xC744; &#xC368;&#xC8FC;&#xC154;&#xC11C; &#xC815;&#xB9D0; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.
-- Ankush</p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xAD00;&#xD55C; &#xD6CC;&#xB96D;&#xD55C; &#xC548;&#xB0B4;&#xC11C;&#xB97C; &#xC368;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; &#xBD84;&#xC790; &#xC0DD;&#xBB3C;&#xD559;&#xC790;(&#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xC870;&#xAE08; &#xD560; &#xC904; &#xC544;&#xB294;)&#xB77C;&#xC11C; &#xC5C5;&#xBB34;&#xC0C1; DNA &#xC5FC;&#xAE30;&#xC11C;&#xC5F4;&#xB85C; &#xC774;&#xB904;&#xC9C4; &#xD070; &#xADDC;&#xBAA8;&#xC758; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC744; &#xB2E4;&#xB8E8;&#xACE0; &#xD604;&#xBBF8;&#xACBD; &#xC774;&#xBBF8;&#xC9C0;&#xB97C; &#xBD84;&#xC11D;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. 6&#xB144;&#xC5EC;&#xC5D0; &#xAC78;&#xCE5C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xACE0; &#xBC1C;&#xD45C;&#xD558;&#xB294; &#xB370; &#xD575;&#xC2EC;&#xC740; &#xC544;&#xB2D0;&#xC9C0;&#xB77C;&#xB3C4; &#xC774; &#xB450; &#xAC00;&#xC9C0; &#xC5C5;&#xBB34;&#xC5D0; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774; &#xB3C4;&#xC6C0;&#xC774; &#xB410;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xAC19;&#xC740; &#xC548;&#xB0B4;&#xC11C;&#xB97C; &#xBB34;&#xB8CC;&#xB85C; &#xBCFC; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC74; &#xC545;&#xC758; &#xC138;&#xB825;&#xC774; &#xC544;&#xC9C1;&#xAE4C;&#xC9C0;&#xB294; &#xC138;&#xACC4;&#xB97C; &#xC9C0;&#xBC30;&#xD558;&#xACE0; &#xC788;&#xC9C0; &#xC54A;&#xB2E4;&#xB294; &#xBA85;&#xBC31;&#xD55C; &#xC99D;&#xAC70;&#xC785;&#xB2C8;&#xB2E4;! :)
-- Luca</p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xCC98;&#xC74C;&#xC73C;&#xB85C; &#xBC30;&#xC6B0;&#xB294; &#xC5B8;&#xC5B4;&#xB85C; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xC120;&#xD0DD;&#xD55C;&#xB2E4;&#xBA74; &quot;A Byte of Python&quot;&#xC744; &#xC77D;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xC801;&#xC808;&#xD788; &#xC18C;&#xAC1C;&#xD558;&#xACE0; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xCD08;&#xBCF4;&#xC790;&#xC5D0;&#xAC8C; &#xC801;&#xB2F9;&#xD55C; &#xC18D;&#xB3C4;&#xB85C; &#xC9C4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;. &#xADF8; &#xC774;&#xD6C4;&#xB85C; &#xAC00;&#xC7A5; &#xC911;&#xC694;&#xD55C; &#xC810;&#xC740; &#xC9C1;&#xC811; &#xC790;&#xADF8;&#xB9C8;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xC81C;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xBCF4;&#xB294; &#xC5F0;&#xC2B5;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.
-- <a href="http://www.overclock.net/t/1177951/want-to-learn-programming-where-do-i-start#post_15837176" target="_blank">&quot;{Unregistered}&quot;</a></p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xD06C;&#xAC8C; &#xC18C;&#xB9AC; &#xB192;&#xC5EC; &quot;A Byte of Python&quot;&#xACFC; &quot;A Byte of Vim&quot;&#xC744; &#xCD9C;&#xD310;&#xD574; &#xC8FC;&#xC154;&#xC11C; <em>&#xC815;&#xB9D0; &#xAC10;&#xC0AC;&#xB4DC;&#xB9B0;&#xB2E4;&#xACE0;</em> &#xB9D0;&#xC500;&#xB4DC;&#xB9AC;&#xACE0; &#xC2F6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xB450; &#xCC45;&#xC740; 4~5&#xB144; &#xC804;&#xC5D0; &#xC81C;&#xAC00; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xBC30;&#xC6B0;&#xAE30; &#xC2DC;&#xC791;&#xD560; &#xB54C; &#xD070; &#xB3C4;&#xC6C0;&#xC774; &#xB410;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC9C0;&#xAE08; &#xC800;&#xB294; &#xC624;&#xB7AB;&#xB3D9;&#xC548; &#xAFC8;&#xAFD4;&#xC654;&#xB358; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xBA70;, &#xADF8;&#xC800; <em>&#xAC10;&#xC0AC;&#xD558;&#xB2E4;&#xACE0;</em> &#xB9D0;&#xC500;&#xB4DC;&#xB9AC;&#xACE0; &#xC2F6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC55E;&#xC73C;&#xB85C; &#xACC4;&#xC18D; &#xD574;&#xC8FC;&#xC138;&#xC694;. &#xB2F9;&#xC2E0;&#xC740; &#xB3D9;&#xAE30;&#xBD80;&#xC5EC;&#xC758; &#xC6D0;&#xCC9C;&#xC785;&#xB2C8;&#xB2E4;. &#xBAA8;&#xB4E0; &#xC77C;&#xC774; &#xC798; &#xB418;&#xC2DC;&#xAE38; &#xBC14;&#xB77C;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.
-- Jocimar</p>
</blockquote>
<!-- -->
<blockquote>
<p>3&#xC77C; &#xC804;&#xC5D0; &quot;A Byte of Python&quot;&#xC744; &#xBAA8;&#xB450; &#xC77D;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; &#xB300;&#xB2E8;&#xD788; &#xD765;&#xBBF8;&#xB86D;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD55C; &#xD398;&#xC774;&#xC9C0;&#xB3C4; &#xC9C0;&#xB8E8;&#xD560; &#xD2C8;&#xC774; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; Orca &#xC2A4;&#xD06C;&#xB9B0; &#xB9AC;&#xB354;&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xC774;&#xD574;&#xD558;&#xACE0; &#xC2F6;&#xC740;&#xB370;, &#xC774; &#xCC45; &#xB355;&#xBD84;&#xC5D0; &#xCF54;&#xB4DC;&#xB97C; &#xC774;&#xD574;&#xD560; &#xC900;&#xBE44;&#xAC00; &#xB41C; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.
-- Dattatray</p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;, &quot;A Byte of Python&quot;&#xC740; &#xD30C;&#xC774;&#xC36C; &#xCD08;&#xBCF4;&#xC790;&#xAC00; &#xC77D;&#xAE30;&#xC5D0; &#xC815;&#xB9D0;&#xB85C; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xB2E4;&#xC2DC; &#xD55C;&#xBC88; &#xB9D0;&#xC500;&#xB4DC;&#xB9AC;&#xC9C0;&#xB9CC; &#xC815;&#xB9D0; &#xC88B;&#xC740; &#xCC45;&#xC785;&#xB2C8;&#xB2E4;! &#xC800;&#xB294; &#xC911;&#xAD6D;&#xC5D0;&#xC11C; &#xC790;&#xBC14;&#xC640; C &#xAC1C;&#xBC1C;&#xC790;&#xB85C; 4&#xB144;&#xC9F8; &#xC77C;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCD5C;&#xADFC;&#xC5D0; &#xC800;&#xB294; pygtk&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xAD6C;&#xD604;&#xD558;&#xB294; zim-wiki &#xB178;&#xD2B8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC744; 6&#xC77C;&#xC9F8; &#xC77D;&#xB294; &#xC911;&#xC778;&#xB370; &#xC774;&#xC81C; &#xD30C;&#xC774;&#xC36C; &#xCF54;&#xB4DC; &#xC608;&#xC81C;&#xB97C; &#xC77D;&#xACE0; &#xC4F8; &#xC218; &#xC788;&#xAC8C; &#xB410;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC744; &#xD1B5;&#xD574; &#xAE30;&#xC5EC;&#xD574; &#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;. &#xBD80;&#xB514; &#xC5F4;&#xC815;&#xC744; &#xAC04;&#xC9C1;&#xD558;&#xC154;&#xC11C; &#xB354; &#xB098;&#xC740; &#xC138;&#xC0C1;&#xC744; &#xB9CC;&#xB4DC;&#xB294; &#xB370; &#xC368;&#xC8FC;&#xC2DC;&#xAE38; &#xBC14;&#xB77C;&#xBA70;, &#xC774;&#xACF3; &#xC911;&#xAD6D;&#xC5D0;&#xC11C; &#xC870;&#xAE08;&#xC774;&#xB098;&#xB9C8; &#xC751;&#xC6D0;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.
-- Lee</p>
</blockquote>
<!-- -->
<blockquote>
<p>&#xC800;&#xB294; &#xD0C0;&#xC774;&#xC644;&#xC5D0; &#xC0B4;&#xACE0; &#xC788;&#xB294; &#xC774;&#xC13C;(Isen)&#xC774;&#xBA70;, National Taiwan University&#xC758; &#xC804;&#xC790;&#xACF5;&#xD559;&#xBD80;&#xC5D0;&#xC11C; &#xBC15;&#xC0AC;&#xD559;&#xC704; &#xC878;&#xC5C5; &#xC608;&#xC815;&#xC790;&#xC778; &#xD559;&#xC0DD;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xCC98;&#xB7FC; &#xBA4B;&#xC9C4; &#xCC45;&#xC744; &#xC368;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC740; &#xD30C;&#xC774;&#xC36C; &#xCD08;&#xC2EC;&#xC790; &#xC785;&#xC7A5;&#xC5D0;&#xC11C; &#xC77D;&#xAE30; &#xC26C;&#xC6B8;&#xBFD0;&#xB354;&#xB7EC; &#xD3EC;&#xAD04;&#xC801;&#xC774;&#xACE0; &#xD544;&#xC694;&#xD55C; &#xBAA8;&#xB4E0; &#xB0B4;&#xC6A9;&#xC744; &#xB2E4;&#xB8E8;&#xACE0; &#xC788;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD569;&#xB2C8;&#xB2E4;. &#xC81C;&#xAC00; &#xC774; &#xCC45;&#xC744; &#xC77D;&#xC740; &#xC774;&#xC720;&#xB294; GNU Radio &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC744; &#xD1B5;&#xD574; &#xCD5C;&#xC18C;&#xD55C;&#xC758; &#xC2DC;&#xAC04;&#xC744; &#xB4E4;&#xC5EC; &#xD30C;&#xC774;&#xC36C;&#xC758; &#xC911;&#xC694;&#xD55C; &#xD575;&#xC2EC; &#xC0AC;&#xC0C1;&#xACFC; &#xAE30;&#xC220;&#xB4E4;&#xC744; &#xB300;&#xBD80;&#xBD84; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB3C5;&#xC790;&#xAC00; &#xAC10;&#xC0AC; &#xBA54;&#xC77C;&#xC744; &#xBCF4;&#xB0B4;&#xB294; &#xB370; &#xAC1C;&#xC758;&#xCE58; &#xC54A;&#xB294;&#xB2E4;&#xACE0; &#xC801;&#xC73C;&#xC2E0; &#xB0B4;&#xC6A9;&#xC744; &#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; &#xC774; &#xCC45;&#xC744; &#xC815;&#xB9D0; &#xC88B;&#xC544;&#xD558;&#xACE0; &#xCC45;&#xC744; &#xC368;&#xC8FC;&#xC154;&#xC11C; &#xAC10;&#xC0AC;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;. &#xACE0;&#xB9D9;&#xC2B5;&#xB2C8;&#xB2E4;.
-- <a href="mailto:chao926@gmail.com" target="_blank">Isen I-Chun Chao</a></p>
</blockquote>
<p>&#xC774; &#xCC45;&#xC740; NASA&#xC5D0;&#xC11C;&#xB3C4; &#xC77D;&#xD614;&#xC2B5;&#xB2C8;&#xB2E4;! NASA&#xC758; &#xB525; &#xC2A4;&#xD398;&#xC774;&#xC2A4; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;(Deep Space Network) &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC640; &#xD568;&#xAED8; <a href="https://web.archive.org/web/20130614003212/http://dsnra.jpl.nasa.gov/software/Python/byte-of-python/output/byteofpython_html/" target="_blank">Jet Propulsion Laboratory</a>&#xC5D0;&#xC11C; &#xC774; &#xCC45;&#xC774; &#xC0AC;&#xC6A9;&#xB410;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xAD50;&#xC721;-&#xACFC;&#xC815;">&#xAD50;&#xC721; &#xACFC;&#xC815;</h2>
<p>&#xC774; &#xCC45;&#xC740; &#xB2E4;&#xC591;&#xD55C; &#xAD50;&#xC721; &#xAE30;&#xAD00;&#xC5D0;&#xC11C; &#xAD50;&#xC7AC;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xACE0; &#xC788;&#xAC70;&#xB098; &#xC0AC;&#xC6A9;&#xB41C; &#xBC14; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<ul>
<li><a href="http://www.few.vu.nl/~nsilvis/PPL/2007/index.html" target="_blank">Vrije Universiteit, Amsterdam</a>&#xC758; &apos;Principles of Programming Languages&apos; &#xAC15;&#xC88C;</li>
<li><a href="http://www.cs.ucdavis.edu/courses/exp_course_desc/10.html" target="_blank">University of California, Davis</a>&#xC758; &apos;Basic Concepts of Computing&apos; &#xAC15;&#xC88C;</li>
<li><a href="http://www.people.fas.harvard.edu/~preshman/python_winter.html" target="_blank">Harvard University</a>&#xC758; &apos;Programming With Python&apos; &#xAC15;&#xC88C;</li>
<li><a href="http://www.comp.leeds.ac.uk/acom1900/" target="_blank">University of Leeds</a>&#xC758; &apos;Introduction to Programming&apos; &#xAC15;&#xC88C;</li>
<li><a href="http://www.cs.bu.edu/courses/cs108/materials.html" target="_blank">Boston University</a>&#xC758; &apos;Introduction to Application Programming&apos; &#xAC15;&#xC88C;</li>
<li><a href="http://gentry.metr.ou.edu/byteofpython/" target="_blank">University of Oklahoma</a>&#xC758; &apos;Information Technology Skills for Meteorology&apos; &#xAC15;&#xC88C; </li>
<li><a href="http://www.msu.edu/~ashton/classes/825/index.html" target="_blank">Michigan State University</a>&#xC758; &apos;Geoprocessing&apos; &#xAC15;&#xC88C;</li>
<li><a href="http://homepages.inf.ed.ac.uk/ewan/masws/" target="_blank">University of Edinburgh</a>&#xC758; &apos;Multi Agent Semantic Web Systems&apos; &#xAC15;&#xC88C;</li>
<li><a href="http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-00sc-introduction-to-computer-science-and-programming-spring-2011/references/" target="_blank">MIT OpenCourseWare</a>&#xC758; &apos;Introduction to Computer Science and Programming&apos; &#xAC15;&#xC88C;</li>
<li>&#xC2AC;&#xB85C;&#xBCA0;&#xB2C8;&#xC544;, University of Ljubljana, &#xC0AC;&#xD68C;&#xACFC;&#xD559;&#xBD80;&#xC758; &apos;Basic programming&apos; &#xAC15;&#xC88C; -- <a href="mailto:ales.ziberna@fdv.uni-lj.si" target="_blank">Ale&#x161; &#x17D;iberna</a>&#xB294; <em>&quot;&#xC800;&#xC640; &#xC804;&#xC784;&#xC790;&#xB294; &#xC774; &#xCC45;&#xC744; &#xC774; &#xAC15;&#xC88C;&#xC758; &#xC8FC;&#xAD50;&#xC7AC;&#xB85C; &#xC0AC;&#xC6A9;&#xD574; &#xC654;&#xC2B5;&#xB2C8;&#xB2E4;&quot;</em>&#xB77C;&#xACE0; &#xC774;&#xC57C;&#xAE30;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xD06C;&#xB85C;&#xC544;&#xD2F0;&#xC544;, University of Zadar, &#xC815;&#xBCF4;&#xACFC;&#xD559;&#xBD80;&#xC758; &apos;Introduction to programming&apos; &#xAC15;&#xC88C; -- Kre&#x161;imir Zauder&#xB294; <em>&quot;&#xC774; &#xAC15;&#xC88C;&#xC5D0;&#xC11C; A Byte of Python&#xC774; &#xD544;&#xC218;&#xC801;&#xC73C;&#xB85C; &#xC77D;&#xC5B4;&#xC57C; &#xD560; &#xCC38;&#xACE0;&#xC790;&#xB8CC;&#xB77C;&#xB294; &#xC810;&#xC744; &#xB9D0;&#xC500;&#xB4DC;&#xB9AC;&#xACE0; &#xC2F6;&#xC2B5;&#xB2C8;&#xB2E4;&quot;</em>&#xB77C;&#xACE0; &#xC774;&#xC57C;&#xAE30;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
<h2 id="&#xC800;&#xC791;&#xAD8C;">&#xC800;&#xC791;&#xAD8C;</h2>
<p>&#xC774; &#xCC45;&#xC740; &#xC800;&#xC791;&#xAD8C;&#xC740; <a href="http://creativecommons.org/licenses/by-sa/4.0/" target="_blank">Creative Commons Attribution-ShareAlike 4.0 International License</a>&#xB97C; &#xB530;&#xB985;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xAC83;&#xC740; &#xB2E4;&#xC74C;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;:</p>
<ul>
<li>&#xC790;&#xC720;&#xB86D;&#xAC8C; &#xC774; &#xCC45;&#xC744; &#xACF5;&#xC720;, &#xC989; &#xBCF5;&#xC81C;, &#xBC30;&#xD3EC;, &#xACF5;&#xC911; &#xC1A1;&#xC2E0;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </li>
<li>&#xC790;&#xC720;&#xB86D;&#xAC8C; &#xC774; &#xCC45;&#xC744; &#xB9AC;&#xBBF9;&#xC2A4;, &#xC989; &#xBCC0;&#xACBD;(&#xD2B9;&#xD788; &#xBC88;&#xC5ED;)&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xC790;&#xC720;&#xB86D;&#xAC8C; &#xC774; &#xCC45;&#xC744; &#xC601;&#xB9AC; &#xBAA9;&#xC801;&#xC73C;&#xB85C; &#xC774;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xCC38;&#xACE0; &#xC0AC;&#xD56D;:</p>
<ul>
<li>&#xC774; &#xCC45;&#xC758; &#xC804;&#xC790;&#xCC45; &#xB610;&#xB294; &#xC885;&#xC774;&#xCC45;&#xC744; &#xD310;&#xB9E4;&#xD560; &#xACBD;&#xC6B0; &#xC774; &#xCC45;&#xC758; &#xC6D0;&#xC791;&#xC790;&#xB85C;&#xBD80;&#xD130; &#xC81C;&#xACF5;&#xB418;&#xB294; &#xAC83;&#xC774; <em>&#xC544;&#xB2C8;&#xB77C;&#xB294;</em> &#xC0AC;&#xC2E4;&#xC744; &#xBA85;&#xD655;&#xD558;&#xACE0; &#xB208;&#xC5D0; &#xC798; &#xB744;&#xB3C4;&#xB85D; &#xC124;&#xBA85;&#xD558;&#xC9C0; &#xC54A;&#xC744; &#xACBD;&#xC6B0; &#xD310;&#xB9E4;&#xD574;&#xC11C;&#xB294; <em>&#xC548; &#xB429;&#xB2C8;&#xB2E4;</em>.</li>
<li>&#xC774; &#xCC45;&#xC758; &#xC18C;&#xAC1C;&#xB780;&#xC774;&#xB098; &#xBB38;&#xC11C;&#xC758; &#xCCAB; &#xD398;&#xC774;&#xC9C0;&#xC5D0; <a href="https://python.swaroopch.com/" target="_blank">https://python.swaroopch.com/</a>&#xB85C; &#xC5F0;&#xACB0;&#xB418;&#xB294; URL&#xC744; &#xAE30;&#xC7AC;&#xD558;&#xACE0; &#xC774;&#xACF3;&#xC5D0;&#xC11C; &#xC6D0;&#xBCF8; &#xD14D;&#xC2A4;&#xD2B8;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC0AC;&#xC2E4;&#xC744; &#xBA85;&#xD655;&#xD558;&#xAC8C; &#xB098;&#xD0C0;&#xB0C4;&#xC73C;&#xB85C;&#xC368; &#xC800;&#xC791;&#xC790;&#xB97C; <em>&#xBC18;&#xB4DC;&#xC2DC;</em> &#xD45C;&#xC2DC;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xC774; &#xCC45;&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xBAA8;&#xB4E0; &#xCF54;&#xB4DC;/&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB294; &#xBCC4;&#xB3C4;&#xB85C; &#xBA85;&#xC2DC;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xD55C; <a href="http://www.opensource.org/licenses/bsd-license.php" target="_blank">3-clause BSD License</a>&#xB97C; &#xB530;&#xB985;&#xB2C8;&#xB2E4;.</li>
</ul>
<h2 id="&#xC9C0;&#xAE08;-&#xBC14;&#xB85C;-&#xC77D;&#xAE30;">&#xC9C0;&#xAE08; &#xBC14;&#xB85C; &#xC77D;&#xAE30;</h2>
<p>&#xC774; &#xCC45;&#xC758; &#xC6D0;&#xBB38;&#xC744; <a href="https://python.swaroopch.com/" target="_blank">https://python.swaroopch.com/</a>&#xC5D0;&#xC11C; &#xC77D;&#xC73C;&#xC2E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD55C;&#xAD6D;&#xC5B4; &#xBC88;&#xC5ED;&#xD310;&#xC740; <a href="https://bop.wikibook.co.kr" target="_blank">https://bop.wikibook.co.kr</a>&#xC5D0;&#xC11C; &#xC77D;&#xC73C;&#xC2E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xB3C4;&#xC11C;-&#xAD6C;&#xC785;">&#xB3C4;&#xC11C; &#xAD6C;&#xC785;</h2>
<p>&#xC774; &#xCC45;&#xC744; &#xC624;&#xD504;&#xB77C;&#xC778;&#xC5D0;&#xC11C; &#xC77D;&#xAC70;&#xB098; &#xC774; &#xCC45;&#xC774; &#xC9C0;&#xC18D;&#xC801;&#xC73C;&#xB85C; &#xBC1C;&#xC804;&#xD558;&#xACE0; &#xAC1C;&#xC120;&#xB420; &#xC218; &#xC788;&#xB3C4;&#xB85D; <a href="https://www.swaroopch.com/buybook/" target="_blank">https://www.swaroopch.com/buybook/</a>&#xC5D0;&#xC11C; &#xC885;&#xC774;&#xCC45;&#xC744; &#xAD6C;&#xC785;&#xD558;&#xC2E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;">&#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;</h2>
<p><a href="https://github.com/swaroopch/byte-of-python/releases/latest" target="_blank">https://github.com/swaroopch/byte-of-python/releases/latest</a>&#xC744; &#xBC29;&#xBB38;&#xD574; &#xC774; &#xCC45;&#xC758; &#xC6D0;&#xBCF8; PDF &#xD30C;&#xC77C;&#xC774;&#xB098; EPUB &#xD30C;&#xC77C;(&#xBAA8;&#xBC14;&#xC77C;, &#xD0DC;&#xBE14;&#xB9BF;, &#xC804;&#xC790;&#xCC45; &#xB9AC;&#xB354;&#xAE30;&#xC5D0; &#xCD5C;&#xC801;&#xD654;&#xB41C;)&#xC744; &#xB0B4;&#xB824;&#xBC1B;&#xC73C;&#xC2E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><a href="https://github.com/swaroopch/byte-of-python" target="_blank">https://github.com/swaroopch/byte-of-python</a>&#xC744; &#xBC29;&#xBB38;&#xD574; &#xC774; &#xCC45;&#xC758; &#xC6D0;&#xBCF8; &#xCF58;&#xD150;&#xCE20;&#xB97C; &#xD655;&#xC778;&#xD558;&#xC2E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;(&#xC624;&#xB958; &#xC218;&#xC815;, &#xBCC0;&#xACBD;, &#xBC88;&#xC5ED; &#xB4F1;&#xC744; &#xC81C;&#xC548;&#xD558;&#xAE30; &#xC704;&#xD574;).</p>
<h2 id="&#xBC88;&#xC5ED;">&#xBC88;&#xC5ED;</h2>
<p>&#xC774; &#xCC45;&#xC744; &#xB2E4;&#xB978; &#xC5B8;&#xC5B4;&#xB85C; &#xC77D;&#xAC70;&#xB098; &#xBC88;&#xC5ED;&#xC5D0; &#xAE30;&#xC5ED;&#xD558;&#xB294; &#xB370; &#xAD00;&#xC2EC;&#xC774; &#xC788;&#xB2E4;&#xBA74; <a href="translations.html#translations">&#xBC88;&#xC5ED;</a>&#xC744; &#xCC38;&#xACE0;&#xD558;&#xC138;&#xC694;.</p>

                                
                                </section>
                            
                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="dedication.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 헌사">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"소개","level":"1.1","depth":1,"next":{"title":"헌사","level":"1.2","depth":1,"path":"dedication.md","ref":"dedication.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{"authorUrl":"https://www.swaroopch.com/about/","buyBookUrl":"https://www.swaroopch.com/buybook/","contactUrl":"https://www.swaroopch.com/contact/","downloadUrl":"https://github.com/swaroopch/byte-of-python/releases/latest","officialUrl":"https://python.swaroopch.com/","pythonVersion":"3.6.0","sourceUrl":"https://github.com/swaroopch/byte-of-python","vimBookUrl":"https://vim.swaroopch.com/"},"plugins":[],"pluginsConfig":{"highlight":{},"search":{"maxIndexSize":1000000},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"README.md","mtime":"2020-06-18T13:16:23.530Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-06-29T13:51:01.069Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/buttons.js"></script>
        
    

    </body>
</html>

