
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>모듈 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="data_structures.html" />
    
    
    <link rel="prev" href="functions.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="dedication.html">
            
                <a href="dedication.html">
            
                    
                    헌사
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    들어가며
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="about_python.html">
            
                <a href="about_python.html">
            
                    
                    파이썬 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="installation.html">
            
                <a href="installation.html">
            
                    
                    설치
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="first_steps.html">
            
                <a href="first_steps.html">
            
                    
                    첫 걸음
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="basics.html">
            
                <a href="basics.html">
            
                    
                    기초
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="op_exp.html">
            
                <a href="op_exp.html">
            
                    
                    연산자와 표현식
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="control_flow.html">
            
                <a href="control_flow.html">
            
                    
                    제어 흐름
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="functions.html">
            
                <a href="functions.html">
            
                    
                    함수
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.11" data-path="modules.html">
            
                <a href="modules.html">
            
                    
                    모듈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="data_structures.html">
            
                <a href="data_structures.html">
            
                    
                    자료구조
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="problem_solving.html">
            
                <a href="problem_solving.html">
            
                    
                    문제 해결
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="oop.html">
            
                <a href="oop.html">
            
                    
                    객체지향 프로그래밍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="io.html">
            
                <a href="io.html">
            
                    
                    입출력
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="exceptions.html">
            
                <a href="exceptions.html">
            
                    
                    예외
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="stdlib.html">
            
                <a href="stdlib.html">
            
                    
                    표준 라이브러리
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="more.html">
            
                <a href="more.html">
            
                    
                    기타 주제
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="what_next.html">
            
                <a href="what_next.html">
            
                    
                    더 나아가기
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="floss.html">
            
                <a href="floss.html">
            
                    
                    부록: FLOSS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="about.html">
            
                <a href="about.html">
            
                    
                    부록: 이 책에 관해
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="revision_history.html">
            
                <a href="revision_history.html">
            
                    
                    부록: 개정 이력
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="translations.html">
            
                <a href="translations.html">
            
                    
                    부록: 번역본
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="translation_howto.html">
            
                <a href="translation_howto.html">
            
                    
                    부록: 번역 방법
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="feedback.html">
            
                <a href="feedback.html">
            
                    
                    피드백
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >모듈</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#xBAA8;&#xB4C8;">&#xBAA8;&#xB4C8;</h1>
<p>&#xC55E;&#xC5D0;&#xC11C; &#xD568;&#xC218;&#xB97C; &#xC815;&#xC758;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xB0B4;&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC7AC;&#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xB2E4;&#xB978; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xC5EC;&#xB7EC; &#xD568;&#xC218;&#xB97C; &#xC7AC;&#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC2F6;&#xB2E4;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xD574;&#xC57C; &#xD560;&#xAE4C;&#xC694;? &#xB208;&#xCE58;&#xCC58;&#xC744;&#xC9C0;&#xB3C4; &#xBAA8;&#xB974;&#xACA0;&#xC9C0;&#xB9CC; &#xB2F5;&#xC740; &#xBAA8;&#xB4C8;(module)&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xBAA8;&#xB4C8;&#xC744; &#xB9CC;&#xB4DC;&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xBC29;&#xBC95;&#xC774; &#xC788;&#xC9C0;&#xB9CC; &#xAC00;&#xC7A5; &#xAC04;&#xB2E8;&#xD55C; &#xBC29;&#xBC95;&#xC740; &#xD568;&#xC218;&#xC640; &#xBCC0;&#xC218;&#xAC00; &#xD3EC;&#xD568;&#xB41C; &#xD655;&#xC7A5;&#xC790;&#xAC00; <code>.py</code>&#xC778; &#xD30C;&#xC77C;&#xC744; &#xB9CC;&#xB4DC;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xB610; &#xB2E4;&#xB978; &#xBC29;&#xBC95;&#xC740; &#xD30C;&#xC774;&#xC36C; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130; &#xC790;&#xCCB4;&#xB97C; &#xC791;&#xC131;&#xD55C; &#xB124;&#xC774;&#xD2F0;&#xBE0C; &#xC5B8;&#xC5B4;&#xB85C; &#xBAA8;&#xB4C8;&#xC744; &#xB9CC;&#xB4DC;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, <a href="http://docs.python.org/3/extending/" target="_blank">C &#xC5B8;&#xC5B4;</a>&#xB85C; &#xBAA8;&#xB4C8;&#xC744; &#xC791;&#xC131;&#xD558;&#xACE0; &#xC774;&#xB97C; &#xCEF4;&#xD30C;&#xC77C;&#xD558;&#xBA74; &#xD45C;&#xC900; &#xD30C;&#xC774;&#xC36C; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;&#xB97C; &#xC774;&#xC6A9;&#xD560; &#xB54C; &#xD30C;&#xC774;&#xC36C; &#xCF54;&#xB4DC;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBAA8;&#xB4C8;&#xC740; &#xB2E4;&#xB978; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xD574;&#xB2F9; &#xBAA8;&#xB4C8;&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD574; <em>&#xC784;&#xD3EC;&#xD2B8;(import)</em>&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xAC19;&#xC740; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xD30C;&#xC774;&#xC36C; &#xD45C;&#xC900; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB3C4; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xBA3C;&#xC800; &#xD45C;&#xC900; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC; &#xBAA8;&#xB4C8;&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xC9C0; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xC81C;(<code>module_using_sys.py</code>):</p>
<pre><code class="lang-python"><span class="hljs-keyword">import</span> sys

print(<span class="hljs-string">&apos;The command line arguments are:&apos;</span>)
<span class="hljs-keyword">for</span> i <span class="hljs-keyword">in</span> sys.argv:
    print(i)

print(<span class="hljs-string">&apos;\n\nThe PYTHONPATH is&apos;</span>, sys.path, <span class="hljs-string">&apos;\n&apos;</span>)
</code></pre>

<p>&#xCD9C;&#xB825; &#xACB0;&#xACFC;:</p>
<pre><code>$ python module_using_sys.py we are arguments    # each arg is separated by white space
The command line arguments are:
module_using_sys.py
we
are
arguments


The PYTHONPATH is [&apos;/tmp/py&apos;,
# many entries here, not shown here
&apos;/Library/Python/2.7/site-packages&apos;,
&apos;/usr/local/lib/python2.7/site-packages&apos;]
</code></pre>

<p><strong>&#xB3D9;&#xC791; &#xC6D0;&#xB9AC;</strong></p>
<p>&#xBA3C;&#xC800; <code>import</code> &#xBB38;&#xC744; &#xC774;&#xC6A9;&#xD574; <code>sys</code> &#xBAA8;&#xB4C8;&#xC744; <em>&#xC784;&#xD3EC;&#xD2B8;</em>&#xD569;&#xB2C8;&#xB2E4;. &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xC774; &#xBB38;&#xC7A5;&#xC740; &#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xAC8C; &#xC774; &#xBAA8;&#xB4C8;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC2F6;&#xB2E4;&#xB294; &#xB73B;&#xC73C;&#xB85C; &#xBC88;&#xC5ED;&#xB429;&#xB2C8;&#xB2E4;. <code>sys</code> &#xBAA8;&#xB4C8;&#xC5D0;&#xB294; &#xD30C;&#xC774;&#xC36C; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130; &#xBC0F; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;&#xAC00; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xD658;&#xACBD;, &#xC989; &#xC2DC;&#xC2A4;&#xD15C;(<strong>sys</strong>tem)&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xAE30;&#xB2A5;&#xC774; &#xB2F4;&#xACA8; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD30C;&#xC774;&#xC36C;&#xC774; <code>import sys</code> &#xBB38;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xBA74; <code>sys</code> &#xBAA8;&#xB4C8;&#xC744; &#xCC3E;&#xC2B5;&#xB2C8;&#xB2E4;. <code>sys</code> &#xBAA8;&#xB4C8;&#xC740; &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xB0B4;&#xC7A5;&#xB41C; &#xBAA8;&#xB4C8;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD30C;&#xC774;&#xC36C;&#xC740; &#xC774; &#xBAA8;&#xB4C8;&#xC744; &#xC5B4;&#xB514;&#xC5D0;&#xC11C; &#xCC3E;&#xC544;&#xC57C; &#xD560;&#xC9C0; &#xC54C;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9CC;&#xC57D; &#xCEF4;&#xD30C;&#xC77C;&#xB41C; &#xBAA8;&#xB4C8;&#xC774; &#xC544;&#xB2C8;&#xC5C8;&#xB2E4;&#xBA74;, &#xC989; &#xD30C;&#xC774;&#xC36C;&#xC73C;&#xB85C; &#xC791;&#xC131;&#xB41C; &#xBAA8;&#xB4C8;&#xC774;&#xB77C;&#xBA74; &#xD30C;&#xC774;&#xC36C; &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;&#xB294; <code>sys.path</code> &#xBCC0;&#xC218;&#xC5D0; &#xB098;&#xC5F4;&#xB41C; &#xB514;&#xB809;&#xD130;&#xB9AC;&#xC5D0;&#xC11C; &#xD574;&#xB2F9; &#xBAA8;&#xB4C8;&#xC744; &#xCC3E;&#xAE30; &#xC2DC;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. &#xBAA8;&#xB4C8;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xBA74; &#xD574;&#xB2F9; &#xBAA8;&#xB4C8;&#xC758; &#xBCF8;&#xBB38;&#xC5D0; &#xD3EC;&#xD568;&#xB41C; &#xBB38;&#xC7A5;&#xC774; &#xC2E4;&#xD589;&#xB418;&#xACE0; &#xBAA8;&#xB4C8;&#xC744; <em>&#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294;</em> &#xC0C1;&#xD0DC;&#xAC00; &#xB429;&#xB2C8;&#xB2E4;. &#xCC38;&#xACE0;&#xB85C; <em>&#xCC98;&#xC74C;</em> &#xBAA8;&#xB4C8;&#xC744; &#xC784;&#xD3EC;&#xD2B8;&#xD560; &#xB54C;&#xB9CC; &#xCD08;&#xAE30;&#xD654;(initialization)&#xAC00; &#xC774;&#xB904;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<p><code>sys</code> &#xBAA8;&#xB4C8;&#xC758; <code>argv</code> &#xBCC0;&#xC218;&#xC5D0; &#xC810; &#xD45C;&#xAE30;&#xBC95;(dot notation), &#xC989; <code>sys.argv</code>&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xC811;&#xADFC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xAC83;&#xC740; <code>argv</code>&#xB77C;&#xB294; &#xC774;&#xB984;&#xC774; <code>sys</code> &#xBAA8;&#xB4C8;&#xC758; &#xC77C;&#xBD80;&#xB77C;&#xB294; &#xC0AC;&#xC2E4;&#xC744; &#xBA85;&#xD655;&#xD558;&#xAC8C; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;. &#xC774; &#xBC29;&#xBC95;&#xC758; &#xB610; &#xB2E4;&#xB978; &#xC774;&#xC810;&#xC740; &#xC774; &#xC774;&#xB984;&#xC774; &#xC5EC;&#xB7EC;&#xBD84;&#xC774; &#xC791;&#xC131;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC548;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC5B4;&#xB5A0;&#xD55C; <code>argv</code> &#xBCC0;&#xC218;&#xC640;&#xB3C4; &#xCDA9;&#xB3CC;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xB294; &#xC810;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><code>sys.argv</code> &#xBCC0;&#xC218;&#xB294; &#xBB38;&#xC790;&#xC5F4;&#xC758; <em>&#xB9AC;&#xC2A4;&#xD2B8;</em>&#xC785;&#xB2C8;&#xB2E4;(&#xB9AC;&#xC2A4;&#xD2B8;&#xB294; <a href="data_structures.html#data-structures">&#xC774;&#xD6C4; &#xC7A5;</a>&#xC5D0;&#xC11C; &#xC790;&#xC138;&#xD788; &#xC124;&#xBA85;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;). &#xC880; &#xB354; &#xAD6C;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xB9D0;&#xD558;&#xC790;&#xBA74; <code>sys.argv</code>&#xC5D0;&#xB294; <em>&#xBA85;&#xB839;&#xC904; &#xC778;&#xC218;(command line argument)</em>, &#xC989; &#xBA85;&#xB839;&#xC904;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xC804;&#xB2EC;&#xD55C; &#xC778;&#xC218;&#xC758; &#xB9AC;&#xC2A4;&#xD2B8;&#xAC00; &#xB2F4;&#xACA8; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9CC;&#xC57D; IDE&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xACE0; &#xC788;&#xB2E4;&#xBA74; &#xBA54;&#xB274;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xBA85;&#xB839;&#xC904; &#xC778;&#xC218;&#xB97C; &#xC9C0;&#xC815;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xCC3E;&#xC544;&#xBCF4;&#xAE30; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5EC;&#xAE30;&#xC11C; <code>python module_using_sys.py we are arguments</code>&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xBA74; <code>python</code> &#xBA85;&#xB839;&#xC73C;&#xB85C; <code>module_using_sys.py</code> &#xBAA8;&#xB4C8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xAC8C; &#xB418;&#xACE0;, &#xADF8; &#xB4A4;&#xC5D0; &#xB530;&#xB77C;&#xC624;&#xB294; &#xAC83;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xC778;&#xC218;&#xAC00; &#xB429;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC740; &#xBA85;&#xB839;&#xC904; &#xC778;&#xC218;&#xB97C; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC548;&#xC5D0;&#xC11C; &#xC4F8; &#xC218; &#xC788;&#xAC8C; <code>sys.argv</code> &#xBCC0;&#xC218;&#xC5D0; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD55C; &#xAC00;&#xC9C0; &#xAE30;&#xC5B5;&#xD560; &#xC810;&#xC740; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xC758; &#xC774;&#xB984;&#xC740; &#xD56D;&#xC0C1; <code>sys.argv</code> &#xB9AC;&#xC2A4;&#xD2B8;&#xC758; &#xCCAB; &#xBC88;&#xC9F8; &#xC694;&#xC18C;&#xB77C;&#xB294; &#xC810;&#xC785;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC5EC;&#xAE30;&#xC11C;&#xB294; <code>&apos;module_using_sys.py&apos;</code>&#xAC00; <code>sys.argv[0]</code>&#xC774;&#xACE0;, <code>&apos;we&apos;</code>&#xAC00; <code>sys.argv[1]</code>, <code>&apos;are&apos;</code>&#xAC00; <code>sys.argv[2]</code>, <code>&apos;arguments&apos;</code>&#xAC00; <code>sys.argv[3]</code>&#xC785;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC740; &#xC22B;&#xC790;&#xB97C; 1&#xC774; &#xC544;&#xB2CC; 0&#xBD80;&#xD130; &#xC13C;&#xB2E4;&#xB294; &#xB370; &#xC8FC;&#xC758;&#xD558;&#xC138;&#xC694;.</p>
<p><code>sys.path</code>&#xC5D0;&#xB294; &#xBAA8;&#xB4C8;&#xC774; &#xC5B4;&#xB514;&#xC11C; &#xC784;&#xD3EC;&#xD2B8;&#xB410;&#xB294;&#xC9C0;&#xB97C; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xB514;&#xB809;&#xD130;&#xB9AC;&#xBA85;&#xC758; &#xBAA9;&#xB85D;&#xC774; &#xB2F4;&#xACA8; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <code>sys.path</code>&#xB97C; &#xBCF4;&#xBA74; <code>sys.path</code>&#xC758; &#xCCAB; &#xBC88;&#xC9F8; &#xBB38;&#xC790;&#xC5F4;&#xC740; &#xBE44;&#xC5B4; &#xC788;&#xB294;&#xB370;, &#xC774; &#xBE48; &#xBB38;&#xC790;&#xC5F4;&#xC740; &#xD604;&#xC7AC; &#xB514;&#xB809;&#xD130;&#xB9AC;&#xB3C4; <code>PYTHONPATH</code> &#xD658;&#xACBD;&#xBCC0;&#xC218;&#xC640; &#xB3D9;&#xC77C;&#xD55C; <code>sys.path</code>&#xC758; &#xC77C;&#xBD80;&#xB77C;&#xB294; &#xC810;&#xC744; &#xB098;&#xD0C0;&#xB0C5;&#xB2C8;&#xB2E4;. &#xC774;&#xAC83;&#xC740; &#xD604;&#xC7AC; &#xB514;&#xB809;&#xD130;&#xB9AC;&#xC5D0; &#xC704;&#xCE58;&#xD55C; &#xBAA8;&#xB4C8;&#xC740; &#xACE7;&#xBC14;&#xB85C; &#xC784;&#xD3EC;&#xD2B8;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC758;&#xBBF8;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xC9C0; &#xC54A;&#xB2E4;&#xBA74; <code>sys.path</code>&#xC5D0; &#xB098;&#xC5F4;&#xB41C; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xC911; &#xD558;&#xB098;&#xB85C; &#xBAA8;&#xB4C8;&#xC744; &#xC62E;&#xACA8;&#xC57C; &#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xD604;&#xC7AC; &#xB514;&#xB809;&#xD130;&#xB9AC;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC2E4;&#xD589;&#xB41C; &#xB514;&#xB809;&#xD130;&#xB9AC;&#xB77C;&#xB294; &#xAC83;&#xC5D0; &#xC8FC;&#xC758;&#xD569;&#xB2C8;&#xB2E4;. &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xD604;&#xC7AC; &#xB514;&#xB809;&#xD130;&#xB9AC;&#xB97C; &#xD655;&#xC778;&#xD558;&#xB824;&#xBA74; <code>import os; print(os.getcwd())</code>&#xB97C; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="pyc">&#xBC14;&#xC774;&#xD2B8; &#xCEF4;&#xD30C;&#xC77C;&#xB41C; .pyc &#xD30C;&#xC77C; </h2>
<p>&#xBAA8;&#xB4C8;&#xC744; &#xC784;&#xD3EC;&#xD2B8;&#xD558;&#xB294; &#xAC83;&#xC740; &#xBE44;&#xAD50;&#xC801; &#xBE44;&#xC6A9;&#xC774; &#xB4DC;&#xB294; &#xC77C;&#xC774;&#xBBC0;&#xB85C; &#xD30C;&#xC774;&#xC36C;&#xC740; &#xC774;&#xB97C; &#xB354; &#xBE60;&#xB974;&#xAC8C; &#xD558;&#xB294; &#xBA87; &#xAC00;&#xC9C0; &#xAE30;&#xBC95;&#xC744; &#xD65C;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xD55C; &#xAC00;&#xC9C0; &#xBC29;&#xBC95;&#xC740; &#xD655;&#xC7A5;&#xC790;&#xAC00; <code>.pyc</code>&#xC778; <em>&#xBC14;&#xC774;&#xD2B8; &#xCEF4;&#xD30C;&#xC77C;&#xB41C;(byte-compiled)</em> &#xD30C;&#xC77C;&#xC744; &#xB9CC;&#xB4DC;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xD30C;&#xC77C;&#xC740; &#xD30C;&#xC774;&#xC36C;&#xC774; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xBCC0;&#xD658;&#xD588;&#xC744; &#xB54C; &#xB098;&#xC624;&#xB294; &#xC911;&#xAC04; &#xD615;&#xD0DC;&#xC785;&#xB2C8;&#xB2E4;(<a href="about_python.html#interpreted">&#xB4E4;&#xC5B4;&#xAC00;&#xBA70;</a>&#xC5D0;&#xC11C; &#xD30C;&#xC774;&#xC36C;&#xC774; &#xC5B4;&#xB5BB;&#xAC8C; &#xB3D9;&#xC791;&#xD558;&#xB294;&#xC9C0; &#xC124;&#xBA85;&#xD588;&#xB358; &#xAC83;&#xC744; &#xAE30;&#xC5B5;&#xD558;&#xC2DC;&#xB098;&#xC694;?). <code>.pyc</code> &#xD30C;&#xC77C;&#xC740; &#xB2E4;&#xC74C;&#xBC88;&#xC5D0; &#xB2E4;&#xB978; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xBAA8;&#xB4C8;&#xC744; &#xC784;&#xD3EC;&#xD2B8;&#xD560; &#xB54C; &#xC720;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC65C;&#xB0D0;&#xD558;&#xBA74; &#xBAA8;&#xB4C8;&#xC744; &#xC784;&#xD3EC;&#xD2B8;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xD544;&#xC694;&#xD55C; &#xCC98;&#xB9AC; &#xC911; &#xC77C;&#xBD80;&#xB97C; &#xC774;&#xBBF8; &#xC218;&#xD589;&#xD55C; &#xC0C1;&#xD0DC;&#xB77C;&#xC11C; &#xD6E8;&#xC52C; &#xB354; &#xBE60;&#xB974;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xAC8C;&#xB2E4;&#xAC00; &#xBC14;&#xC774;&#xD2B8; &#xCEF4;&#xD30C;&#xC77C;&#xB41C; &#xD30C;&#xC77C;&#xC740; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0; &#xB3C5;&#xB9BD;&#xC801;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xCC38;&#xACE0;: <code>.pyc</code> &#xD30C;&#xC77C;&#xC740; &#xBCF4;&#xD1B5; <code>.py</code> &#xD30C;&#xC77C;&#xACFC; &#xB3D9;&#xC77C;&#xD55C; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xC548;&#xC5D0; &#xC0DD;&#xC131;&#xB429;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC774; &#xD574;&#xB2F9; &#xB514;&#xB809;&#xD130;&#xB9AC;&#xC5D0; &#xD30C;&#xC77C;&#xC744; &#xC4F8; &#xC218; &#xC788;&#xB294; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB2E4;&#xBA74; <code>.pyc</code> &#xD30C;&#xC77C;&#xC740; &#xC0DD;&#xC131;&#xB418;&#xC9C0; <em>&#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;</em>.</p>
<h2 id="from-import-statement">from..import &#xBB38; </h2>
<p>&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; <code>argv</code> &#xBCC0;&#xC218;&#xB97C; &#xACE7;&#xBC14;&#xB85C; &#xC784;&#xD3EC;&#xD2B8;&#xD558;&#xACE0; &#xC2F6;&#xB2E4;&#xBA74;(&#xB9E4;&#xBC88; <code>sys.</code>&#xB97C; &#xC785;&#xB825;&#xD558;&#xC9C0; &#xC54A;&#xAE30; &#xC704;&#xD574;) <code>from sys import argv</code> &#xBB38;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>&#xACBD;&#xACE0;: &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; <code>from..import</code> &#xBB38;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC740; <em>&#xC790;&#xC81C;&#xD558;&#xACE0;</em> &#xADF8; &#xB300;&#xC2E0; <code>import</code> &#xBB38;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC138;&#xC694;. &#xC774;&#xB807;&#xAC8C; &#xD558;&#xBA74; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC774;&#xB984; &#xCDA9;&#xB3CC;&#xC744; &#xD53C;&#xD558;&#xACE0; &#xAC00;&#xB3C5;&#xC131;&#xC744; &#xB192;&#xC77C; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p>&#xC608;&#xC81C;:</p>
<pre><code class="lang-python"><span class="hljs-keyword">from</span> math <span class="hljs-keyword">import</span> sqrt
print(<span class="hljs-string">&quot;Square root of 16 is&quot;</span>, sqrt(<span class="hljs-number">16</span>))
</code></pre>
<h2 id="module-name">&#xBAA8;&#xB4C8;&#xC758; <code>__name__</code> </h2>
<p>&#xBAA8;&#xB4E0; &#xBAA8;&#xB4C8;&#xC5D0;&#xB294; &#xC774;&#xB984;&#xC774; &#xC788;&#xACE0;, &#xBAA8;&#xB4C8; &#xC548;&#xC758; &#xBB38;&#xC7A5;&#xC5D0;&#xC11C;&#xB294; &#xBAA8;&#xB4C8;&#xC758; &#xC774;&#xB984;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xBAA8;&#xB4C8;&#xC774; &#xB3C5;&#xB9BD;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB294;&#xC9C0;, &#xC544;&#xB2C8;&#xBA74; &#xB2E4;&#xB978; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xC784;&#xD3EC;&#xD2B8;&#xB418;&#xB294;&#xC9C0;&#xB97C; &#xD310;&#xB2E8;&#xD560; &#xB54C; &#xC720;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC55E;&#xC5D0;&#xC11C; &#xC5B8;&#xAE09;&#xD55C; &#xBC14;&#xC640; &#xAC19;&#xC774; &#xBAA8;&#xB4C8;&#xC740; &#xCC98;&#xC74C; &#xC784;&#xD3EC;&#xD2B8;&#xB420; &#xB54C; &#xBAA8;&#xB4C8;&#xC5D0; &#xD3EC;&#xD568;&#xB41C; &#xCF54;&#xB4DC;&#xAC00; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;. &#xC774; &#xAC19;&#xC740; &#xD2B9;&#xC131;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xBAA8;&#xB4C8;&#xC774; &#xADF8; &#xC790;&#xCCB4;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xB290;&#xB0D0; &#xB610;&#xB294; &#xB2E4;&#xB978; &#xBAA8;&#xB4C8;&#xC5D0; &#xC784;&#xD3EC;&#xD2B8;&#xB418;&#xB290;&#xB0D0;&#xC5D0; &#xB530;&#xB77C; &#xC11C;&#xB85C; &#xB2E4;&#xB978; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xB3D9;&#xC791;&#xD558;&#xAC8C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; &#xBAA8;&#xB4C8;&#xC758; <code>__name__</code> &#xC18D;&#xC131;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xC81C;(<code>module_using_name.py</code>):</p>
<pre><code class="lang-python"><span class="hljs-keyword">if</span> __name__ == <span class="hljs-string">&apos;__main__&apos;</span>:
    print(<span class="hljs-string">&apos;This program is being run by itself&apos;</span>)
<span class="hljs-keyword">else</span>:
    print(<span class="hljs-string">&apos;I am being imported from another module&apos;</span>)
</code></pre>

<p>&#xCD9C;&#xB825; &#xACB0;&#xACFC;:</p>
<pre><code>$ python module_using_name.py
This program is being run by itself

$ python
&gt;&gt;&gt; import module_using_name
I am being imported from another module
&gt;&gt;&gt;
</code></pre>

<p><strong>&#xB3D9;&#xC791; &#xC6D0;&#xB9AC;</strong></p>
<p>&#xBAA8;&#xB4E0; &#xD30C;&#xC774;&#xC36C; &#xBAA8;&#xB4C8;&#xC5D0;&#xB294; <code>__name__</code>&#xC774; &#xC815;&#xC758;&#xB3FC; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xAC83;&#xC774; <code>&apos;__main__&apos;</code>&#xC774;&#xBA74; &#xBAA8;&#xB4C8;&#xC774; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0; &#xC758;&#xD574; &#xB3C5;&#xB9BD;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xAC83;&#xC744; &#xC758;&#xBBF8;&#xD558;&#xACE0; &#xC801;&#xC808;&#xD55C; &#xB3D9;&#xC791;&#xC744; &#xCDE8;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xBAA8;&#xB4C8;-&#xB9CC;&#xB4E4;&#xAE30;">&#xBAA8;&#xB4C8; &#xB9CC;&#xB4E4;&#xAE30;</h2>
<p>&#xBAA8;&#xB4C8;&#xC744; &#xB9CC;&#xB4DC;&#xB294; &#xAC83;&#xC740; &#xC5B4;&#xB835;&#xC9C0; &#xC54A;&#xACE0; &#xC9C0;&#xAE08;&#xAECF; &#xD574;&#xC628; &#xC77C;&#xC774;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;! &#xADF8; &#xC774;&#xC720;&#xB294; &#xBAA8;&#xB4E0; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC740; &#xBAA8;&#xB4C8;&#xC774;&#xAE30;&#xB3C4; &#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xC800; &#xD30C;&#xC77C;&#xC758; &#xD655;&#xC7A5;&#xC790;&#xB97C; <code>.py</code>&#xB85C; &#xC9C0;&#xC815;&#xD558;&#xAE30;&#xB9CC; &#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C; &#xC608;&#xC81C;&#xB97C; &#xBCF4;&#xBA74; &#xD655;&#xC2E4;&#xD788; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xC81C;(<code>mymodule.py</code>):</p>
<pre><code class="lang-python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">say_hi</span><span class="hljs-params">()</span>:</span>
    print(<span class="hljs-string">&apos;Hi, this is mymodule speaking.&apos;</span>)

__version__ = <span class="hljs-string">&apos;0.1&apos;</span>
</code></pre>

<p>&#xC704; &#xCF54;&#xB4DC;&#xB294; &#xAC04;&#xB2E8;&#xD55C; <em>&#xBAA8;&#xB4C8;</em> &#xC608;&#xC81C;&#xC785;&#xB2C8;&#xB2E4;. &#xBCF4;&#xB2E4;&#xC2DC;&#xD53C; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xBE44;&#xD574; &#xD2B9;&#xBCC4;&#xD55C; &#xBD80;&#xBD84;&#xC774; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C;&#xC73C;&#xB85C; &#xC774; &#xBAA8;&#xB4C8;&#xC744; &#xB2E4;&#xB978; &#xD30C;&#xC774;&#xC36C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xC9C0; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD55C; &#xAC00;&#xC9C0; &#xAE30;&#xC5B5;&#xD574;&#xC57C; &#xD560; &#xC810;&#xC740; &#xBAA8;&#xB4C8;&#xC740; &#xD574;&#xB2F9; &#xBAA8;&#xB4C8;&#xC744; &#xC784;&#xD3EC;&#xD2B8;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xACFC; &#xAC19;&#xC740; &#xB514;&#xB809;&#xD130;&#xB9AC;&#xC5D0; &#xB450;&#xAC70;&#xB098; <code>sys.path</code>&#xC5D0; &#xB098;&#xC5F4;&#xB41C; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xC911; &#xD558;&#xB098;&#xC5D0; &#xB46C;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xB610; &#xB2E4;&#xB978; &#xBAA8;&#xB4C8;(<code>mymodule_demo.py</code>):</p>
<pre><code class="lang-python"><span class="hljs-keyword">import</span> mymodule

mymodule.say_hi()
print(<span class="hljs-string">&apos;Version&apos;</span>, mymodule.__version__)
</code></pre>

<p>&#xCD9C;&#xB825; &#xACB0;&#xACFC;:</p>
<pre><code>$ python mymodule_demo.py
Hi, this is mymodule speaking.
Version 0.1
</code></pre>

<p><strong>&#xB3D9;&#xC791; &#xC6D0;&#xB9AC;</strong></p>
<p>&#xC5EC;&#xAE30;&#xC11C;&#xB3C4; &#xC810; &#xD45C;&#xAE30;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xBAA8;&#xB4C8;&#xC758; &#xC694;&#xC18C;&#xC5D0; &#xC811;&#xADFC;&#xD55C;&#xB2E4;&#xB294; &#xC810;&#xC5D0; &#xC720;&#xC758;&#xD569;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC740; &#xC55E;&#xC5D0;&#xC11C; &#xC0B4;&#xD3B4;&#xBCF8; &#xC810; &#xD45C;&#xAE30;&#xBC95;&#xC744; &#xC801;&#xC808;&#xD788; &#xC7AC;&#xD65C;&#xC6A9;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xBB34;&#xC5B8;&#xAC00;&#xB97C; &#xD558;&#xAE30; &#xC704;&#xD55C; &#xC0C8;&#xB85C;&#xC6B4; &#xBC29;&#xBC95;&#xC744; &#xACC4;&#xC18D; &#xBC30;&#xC6B8; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xB3C4;&#xB85D; &#xD2B9;&#xC720;&#xC758; &apos;&#xD30C;&#xC774;&#xC36C;&#xC2A4;&#xB7EC;&#xC6C0;&apos;&#xC744; &#xB290;&#xB07C;&#xAC8C; &#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C;&#xC740; <code>from..import</code> &#xAD6C;&#xBB38;&#xC744; &#xD65C;&#xC6A9;&#xD55C; &#xBC84;&#xC804;&#xC785;&#xB2C8;&#xB2E4;(<code>mymodule_demo2.py</code>).</p>
<pre><code class="lang-python"><span class="hljs-keyword">from</span> mymodule <span class="hljs-keyword">import</span> say_hi, __version__

say_hi()
print(<span class="hljs-string">&apos;Version&apos;</span>, __version__)
</code></pre>

<p><code>mymodule_demo2.py</code>&#xC758; &#xCD9C;&#xB825; &#xACB0;&#xACFC;&#xB294; <code>mymodule_demo.py</code>&#xC758; &#xCD9C;&#xB825; &#xACB0;&#xACFC;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><code>mymodule</code>&#xC744; &#xC784;&#xD3EC;&#xD2B8;&#xD558;&#xB294; &#xBAA8;&#xB4C8; &#xB0B4;&#xC5D0; <code>__version__</code>&#xB77C;&#xB294; &#xC774;&#xB984;&#xC774; &#xC774;&#xBBF8; &#xC120;&#xC5B8;&#xB3FC; &#xC788;&#xC5C8;&#xB2E4;&#xBA74; &#xCDA9;&#xB3CC;&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xAC83;&#xC774;&#xB77C;&#xB294; &#xB370; &#xC8FC;&#xC758;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xAC83;&#xC774; &#xAC00;&#xB2A5;&#xD55C; &#xC774;&#xC720;&#xB294; <code>__version__</code>&#xB77C;&#xB294; &#xC774;&#xB984;&#xC73C;&#xB85C; &#xAC01; &#xBAA8;&#xB4C8;&#xC758; &#xBC84;&#xC804; &#xBC88;&#xD638;&#xB97C; &#xC120;&#xC5B8;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC77C;&#xBC18;&#xC801;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xAE38;&#xC774;&#xAC00; &#xC870;&#xAE08; &#xB354; &#xAE38;&#xC5B4;&#xC9C0;&#xB294; &#xD55C;&#xC774; &#xC788;&#xB354;&#xB77C;&#xB3C4; &#xD56D;&#xC0C1; <code>import</code> &#xBB38;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xAE38; &#xAD8C;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xAD6C;&#xBB38;&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="lang-python"><span class="hljs-keyword">from</span> mymodule <span class="hljs-keyword">import</span> *
</code></pre>
<p>&#xC774;&#xB807;&#xAC8C; &#xD558;&#xBA74; <code>say_hi</code> &#xAC19;&#xC740; &#xACF5;&#xAC1C;&#xB41C; &#xC774;&#xB984;&#xC740; &#xBAA8;&#xB450; &#xC784;&#xD3EC;&#xD2B8;&#xD558;&#xC9C0;&#xB9CC; <code>__version__</code>&#xC740; &#xC784;&#xD3EC;&#xD2B8;&#xD558;&#xC9C0; &#xC54A;&#xC744; &#xD150;&#xB370; <code>__version__</code>&#xC740; &#xC774;&#xB984;&#xC774; &#xB450; &#xAC1C;&#xC758; &#xBC11;&#xC904;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p>&#xACBD;&#xACE0;: &#xC784;&#xD3EC;&#xD2B8;&#xD560; &#xB54C; &#xBCC4;&#xD45C;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294;, &#xC989; <code>from mymodule import *</code>&#xB294; &#xC790;&#xC81C;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<!-- -->
<blockquote>
<p><strong>&#xD30C;&#xC774;&#xC36C;&#xC758; &#xC120;(&#x79AA;)</strong></p>
<p>&#xD30C;&#xC774;&#xC36C;&#xC758; &#xCF54;&#xB529; &#xC6D0;&#xCE59; &#xC911; &#xD558;&#xB098;&#xB294; &quot;&#xBA85;&#xC2DC;&#xC801;&#xC778; &#xAC83;&#xC774; &#xC554;&#xC2DC;&#xC801;&#xC778; &#xAC83;&#xBCF4;&#xB2E4; &#xB0AB;&#xB2E4;&quot;&#xC785;&#xB2C8;&#xB2E4;. &#xC790;&#xC138;&#xD55C; &#xB0B4;&#xC6A9;&#xC744; &#xBCF4;&#xB824;&#xBA74; &#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xC11C; <code>import this</code>&#xB97C; &#xC2E4;&#xD589;&#xD574; &#xBCF4;&#xC138;&#xC694;.</p>
</blockquote>
<h2 id="dir-function"><code>dir</code> &#xD568;&#xC218; </h2>
<p>&#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xB0B4;&#xC7A5;&#xB41C; <code>dir()</code> &#xD568;&#xC218;&#xB294; &#xAC1D;&#xCCB4;&#xC5D0; &#xC815;&#xC758;&#xB41C; &#xC774;&#xB984; &#xB9AC;&#xC2A4;&#xD2B8;&#xB97C; &#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;. &#xAC1D;&#xCCB4;&#xAC00; &#xBAA8;&#xB4C8;&#xC774;&#xBA74; &#xC774; &#xB9AC;&#xC2A4;&#xD2B8;&#xC5D0;&#xB294; &#xD574;&#xB2F9; &#xBAA8;&#xB4C8; &#xC548;&#xC5D0; &#xC815;&#xC758;&#xB41C; &#xD568;&#xC218;, &#xD074;&#xB798;&#xC2A4;, &#xBCC0;&#xC218;&#xAC00; &#xB2F4;&#xACA8; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xD568;&#xC218;&#xB294; &#xC778;&#xC218;&#xB97C; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC778;&#xC218;&#xAC00; &#xBAA8;&#xB4C8;&#xC758; &#xC774;&#xB984;&#xC774;&#xBA74; &#xD574;&#xB2F9; &#xBAA8;&#xB4C8;&#xC758; &#xC774;&#xB984; &#xB9AC;&#xC2A4;&#xD2B8;&#xB97C; &#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;. &#xC778;&#xC218;&#xB97C; &#xC9C0;&#xC815;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; &#xD604;&#xC7AC; &#xBAA8;&#xB4C8;&#xC758; &#xC774;&#xB984; &#xB9AC;&#xC2A4;&#xD2B8;&#xB97C; &#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xC81C;:</p>
<pre><code class="lang-python">$ python
<span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">import</span> sys

<span class="hljs-comment"># sys &#xBAA8;&#xB4C8; &#xC548;&#xC758; &#xC18D;&#xC131;&#xBA85;&#xC744; &#xAC00;&#xC838;&#xC635;&#xB2C8;&#xB2E4;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>dir(sys)
[<span class="hljs-string">&apos;__displayhook__&apos;</span>, <span class="hljs-string">&apos;__doc__&apos;</span>,
<span class="hljs-string">&apos;argv&apos;</span>, <span class="hljs-string">&apos;builtin_module_names&apos;</span>,
<span class="hljs-string">&apos;version&apos;</span>, <span class="hljs-string">&apos;version_info&apos;</span>]
<span class="hljs-comment"># &#xC5EC;&#xAE30;&#xC11C;&#xB294; &#xBA87; &#xAC1C;&#xC758; &#xD56D;&#xBAA9;&#xB9CC; &#xD45C;&#xC2DC;&#xD569;&#xB2C8;&#xB2E4;</span>

<span class="hljs-comment"># &#xD604;&#xC7AC; &#xBAA8;&#xB4C8;&#xC758; &#xC18D;&#xC131;&#xBA85;&#xC744; &#xAC00;&#xC838;&#xC635;&#xB2C8;&#xB2E4;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>dir()
[<span class="hljs-string">&apos;__builtins__&apos;</span>, <span class="hljs-string">&apos;__doc__&apos;</span>,
<span class="hljs-string">&apos;__name__&apos;</span>, <span class="hljs-string">&apos;__package__&apos;</span>, <span class="hljs-string">&apos;sys&apos;</span>]

<span class="hljs-comment"># &apos;a&apos;&#xB77C;&#xB294; &#xC0C8; &#xBCC0;&#xC218;&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>a = <span class="hljs-number">5</span>

<span class="hljs-meta">&gt;&gt;&gt; </span>dir()
[<span class="hljs-string">&apos;__builtins__&apos;</span>, <span class="hljs-string">&apos;__doc__&apos;</span>, <span class="hljs-string">&apos;__name__&apos;</span>, <span class="hljs-string">&apos;__package__&apos;</span>, <span class="hljs-string">&apos;sys&apos;</span>, <span class="hljs-string">&apos;a&apos;</span>]

<span class="hljs-comment"># &#xC774;&#xB984;&#xC744; &#xC0AD;&#xC81C;/&#xC81C;&#xAC70;&#xD569;&#xB2C8;&#xB2E4;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">del</span> a

<span class="hljs-meta">&gt;&gt;&gt; </span>dir()
[<span class="hljs-string">&apos;__builtins__&apos;</span>, <span class="hljs-string">&apos;__doc__&apos;</span>, <span class="hljs-string">&apos;__name__&apos;</span>, <span class="hljs-string">&apos;__package__&apos;</span>, <span class="hljs-string">&apos;sys&apos;</span>]
</code></pre>
<p><strong>&#xB3D9;&#xC791; &#xC6D0;&#xB9AC;</strong></p>
<p>&#xBA3C;&#xC800; &#xC784;&#xD3EC;&#xD2B8;&#xD55C; <code>sys</code> &#xBAA8;&#xB4C8;&#xC744; &#xB300;&#xC0C1;&#xC73C;&#xB85C; <code>dir</code>&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xC9C0; &#xBD05;&#xB2C8;&#xB2E4;. &#xC774; &#xBAA8;&#xB4C8;&#xC5D0; &#xD3EC;&#xD568;&#xB41C; &#xAC70;&#xB300;&#xD55C; &#xC18D;&#xC131; &#xB9AC;&#xC2A4;&#xD2B8;&#xB97C; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C;&#xC73C;&#xB85C; <code>dir</code> &#xD568;&#xC218;&#xC5D0; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB97C; &#xC804;&#xB2EC;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xD604;&#xC7AC; &#xBAA8;&#xB4C8;&#xC758; &#xC18D;&#xC131; &#xB9AC;&#xC2A4;&#xD2B8;&#xB97C; &#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;. &#xC784;&#xD3EC;&#xD2B8;&#xD55C; &#xBAA8;&#xB4C8;&#xC758; &#xB9AC;&#xC2A4;&#xD2B8;&#xB3C4; &#xC774; &#xB9AC;&#xC2A4;&#xD2B8;&#xC5D0; &#xD3EC;&#xD568;&#xB41C;&#xB2E4;&#xB294; &#xC810;&#xC5D0; &#xC720;&#xC758;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><code>dir</code>&#xC774; &#xC2E4;&#xC81C;&#xB85C; &#xC5B4;&#xB5BB;&#xAC8C; &#xB3D9;&#xC791;&#xD558;&#xB294;&#xC9C0; &#xAD00;&#xCC30;&#xD558;&#xAE30; &#xC704;&#xD574; <code>a</code>&#xB77C;&#xB294; &#xBCC0;&#xC218;&#xB97C; &#xC0C8;&#xB85C; &#xC815;&#xC758;&#xD558;&#xACE0; &#xAC12;&#xC744; &#xD560;&#xB2F9;&#xD55C; &#xB2E4;&#xC74C; <code>dir</code>&#xC744; &#xD655;&#xC778;&#xD574; &#xB9AC;&#xC2A4;&#xD2B8;&#xC5D0; &#xAC19;&#xC740; &#xC774;&#xB984;&#xC73C;&#xB85C; &#xAC12;&#xC774; &#xCD94;&#xAC00;&#xB41C; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;. <code>del</code> &#xBB38;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xD604;&#xC7AC; &#xBAA8;&#xB4C8;&#xC758; &#xBCC0;&#xC218;/&#xC18D;&#xC131;&#xC744; &#xC81C;&#xAC70;&#xD558;&#xACE0; <code>dir</code> &#xD568;&#xC218;&#xC758; &#xCD9C;&#xB825; &#xACB0;&#xACFC;&#xB97C; &#xD1B5;&#xD574; &#xB2E4;&#xC2DC; &#xD55C;&#xBC88; &#xBCC0;&#xACBD; &#xC0AC;&#xD56D;&#xC774; &#xBC18;&#xC601;&#xB418;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><code>del</code> &#xC54C;&#xC544;&#xB450;&#xAE30;: <code>del</code> &#xBB38;&#xC740; &#xBCC0;&#xC218;/&#xC774;&#xB984;&#xC744; <em>&#xC0AD;&#xC81C;</em>&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xBA70;, <code>del</code> &#xBB38;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xACE0; &#xB098;&#xBA74;(&#xC5EC;&#xAE30;&#xC11C;&#xB294; <code>del a</code>) &#xB354;&#xB294; <code>a</code> &#xBCC0;&#xC218;&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989;, &#xC804;&#xD600; &#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xC558;&#xB358; &#xAC83;&#xCC98;&#xB7FC; &#xCC98;&#xB9AC;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><code>dir()</code> &#xD568;&#xC218;&#xB294; <em>&#xC5B4;&#xB5A0;&#xD55C;</em> &#xAC1D;&#xCCB4;&#xC5D0;&#xB3C4; &#xB3D9;&#xC791;&#xD55C;&#xB2E4;&#xB294; &#xB370; &#xC8FC;&#xC758;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, <code>dir(str)</code>&#xC744; &#xC2E4;&#xD589;&#xD574; <code>str</code>(&#xBB38;&#xC790;&#xC5F4;) &#xD074;&#xB798;&#xC2A4;&#xC758; &#xC18D;&#xC131;&#xC744; &#xD655;&#xC778;&#xD574; &#xBCF4;&#xC138;&#xC694;.</p>
<p>&#xC7A0;&#xC7AC;&#xC801;&#xC73C;&#xB85C; &#xC18D;&#xC131;&#xACFC; &#xC18D;&#xC131;&#xAC12;&#xC744; &#xBC18;&#xD658;&#xD560; &#xC218; &#xC788;&#xB294; <a href="http://docs.python.org/3/library/functions.html#vars" target="_blank"><code>vars()</code></a> &#xD568;&#xC218;&#xB3C4; &#xC788;&#xC9C0;&#xB9CC; &#xC774; &#xD568;&#xC218;&#xB294; &#xBAA8;&#xB4E0; &#xACBD;&#xC6B0;&#xC5D0; &#xB3D9;&#xC791;&#xD558;&#xC9C0;&#xB294; &#xC54A;&#xC744; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xD328;&#xD0A4;&#xC9C0;">&#xD328;&#xD0A4;&#xC9C0;</h2>
<p>&#xC774;&#xC81C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xACC4;&#xCE35;&#xAD6C;&#xC870;&#xAC00; &#xBCF4;&#xC774;&#xAE30; &#xC2DC;&#xC791;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xB300;&#xAC1C; &#xBCC0;&#xC218;&#xB294; &#xD568;&#xC218; &#xC548;&#xC5D0; &#xB4E4;&#xC5B4;&#xAC11;&#xB2C8;&#xB2E4;. &#xD568;&#xC218;&#xC640; &#xC804;&#xC5ED; &#xBCC0;&#xC218;&#xB294; &#xBAA8;&#xB4C8; &#xC548;&#xC5D0; &#xB4E4;&#xC5B4;&#xAC11;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7FC; &#xBAA8;&#xB4C8;&#xC744; &#xC870;&#xC9C1;&#xD654;&#xD558;&#xACE0; &#xC2F6;&#xB2E4;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xD574;&#xC57C; &#xD560;&#xAE4C;&#xC694;? &#xC774;&#xB54C; &#xD328;&#xD0A4;&#xC9C0;(package)&#xAC00; &#xB4F1;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD328;&#xD0A4;&#xC9C0;&#xB294; &#xD2B9;&#xBCC4;&#xD55C; <code>__init__.py</code> &#xD30C;&#xC77C;&#xC774; &#xD3EC;&#xD568;&#xB41C;, &#xC5EC;&#xB7EC; &#xBAA8;&#xB4C8;&#xB85C; &#xAD6C;&#xC131;&#xB41C; &#xD3F4;&#xB354;&#xC5D0; &#xBD88;&#xACFC;&#xD569;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; <code>__init__.py</code> &#xD30C;&#xC77C;&#xC740; &#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xAC8C; &#xC774; &#xD3F4;&#xB354;&#xC5D0;&#xB294; &#xD30C;&#xC774;&#xC36C; &#xBAA8;&#xB4C8;&#xC774; &#xB4E4;&#xC5B4; &#xC788;&#xC5B4;&#xC11C; &#xD2B9;&#xBCC4;&#xD558;&#xB2E4;&#xACE0; &#xC54C;&#xB824;&#xC8FC;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&apos;asia&apos;, &apos;africa&apos; &#xB4F1;&#xC758; &#xD558;&#xC704; &#xD328;&#xD0A4;&#xC9C0;&#xAC00; &#xC788;&#xACE0;, &#xC774;&#xB7EC;&#xD55C; &#xD558;&#xC704; &#xD328;&#xD0A4;&#xC9C0;&#xC5D0;&#xB294; &apos;india&apos;, &apos;madagascar&apos; &#xB4F1;&#xC758; &#xBAA8;&#xB4C8;&#xC774; &#xD3EC;&#xD568;&#xB41C; &apos;world&apos;&#xB77C;&#xB294; &#xD328;&#xD0A4;&#xC9C0;&#xB97C; &#xB9CC;&#xB4E4;&#xACE0; &#xC2F6;&#xB2E4;&#xACE0; &#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C;&#xC740; &#xC774;&#xB97C; &#xBC18;&#xC601;&#xD55C; &#xD3F4;&#xB354; &#xAD6C;&#xC870;&#xC785;&#xB2C8;&#xB2E4;.</p>
<pre><code>- &lt;sys.path&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xC5B4;&#xB5A4; &#xD3F4;&#xB354;&gt;/
    - world/
        - __init__.py
        - asia/
            - __init__.py
            - india/
                - __init__.py
                - foo.py
        - africa/
            - __init__.py
            - madagascar/
                - __init__.py
                - bar.py
</code></pre><p>&#xD328;&#xD0A4;&#xC9C0;&#xB294; &#xBAA8;&#xB4C8;&#xC744; &#xACC4;&#xCE35;&#xC801;&#xC73C;&#xB85C; &#xC870;&#xC9C1;&#xD654;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xD3B8;&#xC758; &#xAE30;&#xB2A5;&#xC5D0; &#xBD88;&#xACFC;&#xD569;&#xB2C8;&#xB2E4;. &#xD328;&#xD0A4;&#xC9C0;&#xC758; &#xC5EC;&#xB7EC; &#xC0AC;&#xB840;&#xB4E4;&#xC744; <a href="stdlib.html#stdlib">&#xD45C;&#xC900; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;</a>&#xC5D0;&#xC11C; &#xBCF4;&#xAC8C; &#xB420; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xC815;&#xB9AC;">&#xC815;&#xB9AC;</h2>
<p>&#xD568;&#xC218;&#xAC00; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC7AC;&#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; &#xBD80;&#xD488;&#xC778; &#xAC83;&#xACFC; &#xAC19;&#xC774; &#xBAA8;&#xB4C8;&#xC740; &#xC7AC;&#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774;&#xB77C;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD328;&#xD0A4;&#xC9C0;&#xB294; &#xBAA8;&#xB4C8;&#xC744; &#xC870;&#xC9C1;&#xD654;&#xD558;&#xB294; &#xB610; &#xD558;&#xB098;&#xC758; &#xACC4;&#xCE35;&#xAD6C;&#xC870;&#xC785;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xD0D1;&#xC7AC;&#xB41C; &#xD45C;&#xC900; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB294; &#xADF8;&#xB7EC;&#xD55C; &#xD328;&#xD0A4;&#xC9C0;&#xC640; &#xBAA8;&#xB4C8; &#xB4E4;&#xC758; &#xC608;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xC774;&#xB7EC;&#xD55C; &#xBAA8;&#xB4C8;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC9C1;&#xC811; &#xBAA8;&#xB4C8;&#xC744; &#xB9CC;&#xB4DC;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC0B4;&#xD3B4;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C; &#xC7A5;&#xC5D0;&#xC11C;&#xB294; &#xC790;&#xB8CC;&#xAD6C;&#xC870;&#xB77C;&#xACE0; &#xD558;&#xB294; &#xD765;&#xBBF8;&#xB85C;&#xC6B4; &#xAC1C;&#xB150;&#xC5D0; &#xAD00;&#xD574; &#xBC30;&#xC6B0;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="functions.html" class="navigation navigation-prev " aria-label="Previous page: 함수">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="data_structures.html" class="navigation navigation-next " aria-label="Next page: 자료구조">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"모듈","level":"1.11","depth":1,"next":{"title":"자료구조","level":"1.12","depth":1,"path":"data_structures.md","ref":"data_structures.md","articles":[]},"previous":{"title":"함수","level":"1.10","depth":1,"path":"functions.md","ref":"functions.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{"authorUrl":"https://www.swaroopch.com/about/","buyBookUrl":"https://www.swaroopch.com/buybook/","contactUrl":"https://www.swaroopch.com/contact/","downloadUrl":"https://github.com/swaroopch/byte-of-python/releases/latest","officialUrl":"https://python.swaroopch.com/","pythonVersion":"3.6.0","sourceUrl":"https://github.com/swaroopch/byte-of-python","vimBookUrl":"https://vim.swaroopch.com/"},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"modules.md","mtime":"2020-06-12T15:30:19.306Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-06-15T14:40:44.479Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

