
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>객체지향 프로그래밍 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="io.html" />
    
    
    <link rel="prev" href="problem_solving.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="dedication.html">
            
                <a href="dedication.html">
            
                    
                    헌사
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    들어가며
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="about_python.html">
            
                <a href="about_python.html">
            
                    
                    파이썬 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="installation.html">
            
                <a href="installation.html">
            
                    
                    설치
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="first_steps.html">
            
                <a href="first_steps.html">
            
                    
                    첫 걸음
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="basics.html">
            
                <a href="basics.html">
            
                    
                    기초
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="op_exp.html">
            
                <a href="op_exp.html">
            
                    
                    연산자와 표현식
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="control_flow.html">
            
                <a href="control_flow.html">
            
                    
                    제어 흐름
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="functions.html">
            
                <a href="functions.html">
            
                    
                    함수
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="modules.html">
            
                <a href="modules.html">
            
                    
                    모듈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="data_structures.html">
            
                <a href="data_structures.html">
            
                    
                    자료구조
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="problem_solving.html">
            
                <a href="problem_solving.html">
            
                    
                    문제 해결
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.14" data-path="oop.html">
            
                <a href="oop.html">
            
                    
                    객체지향 프로그래밍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="io.html">
            
                <a href="io.html">
            
                    
                    입출력
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="exceptions.html">
            
                <a href="exceptions.html">
            
                    
                    예외
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="stdlib.html">
            
                <a href="stdlib.html">
            
                    
                    표준 라이브러리
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="more.html">
            
                <a href="more.html">
            
                    
                    기타 주제
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="what_next.html">
            
                <a href="what_next.html">
            
                    
                    더 나아가기
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="floss.html">
            
                <a href="floss.html">
            
                    
                    부록: FLOSS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="about.html">
            
                <a href="about.html">
            
                    
                    부록: 이 책에 관해
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="revision_history.html">
            
                <a href="revision_history.html">
            
                    
                    부록: 개정 이력
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="translations.html">
            
                <a href="translations.html">
            
                    
                    부록: 번역본
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="translation_howto.html">
            
                <a href="translation_howto.html">
            
                    
                    부록: 번역 방법
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="feedback.html">
            
                <a href="feedback.html">
            
                    
                    피드백
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >객체지향 프로그래밍</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="oop">&#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; </h1>
<p>&#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xC791;&#xC131;&#xD55C; &#xBAA8;&#xB4E0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xD568;&#xC218;, &#xC989; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC870;&#xC791;&#xD558;&#xB294; &#xBB38;&#xC7A5; &#xBE14;&#xB85D; &#xC704;&#xC8FC;&#xB85C; &#xC124;&#xACC4;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; <em>&#xC808;&#xCC28;&#xC9C0;&#xD5A5;(procedure-oriented)</em> &#xBC29;&#xC2DD;&#xC758; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774;&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xB370;&#xC774;&#xD130;&#xC640; &#xAE30;&#xB2A5;&#xC744; &#xACB0;&#xD569;&#xD574;&#xC11C; &#xADF8;&#xAC83;&#xC744; &#xAC1D;&#xCCB4;(object)&#xB77C;&#xACE0; &#xD558;&#xB294; &#xAC83; &#xC548;&#xC5D0; &#xAC10;&#xC2F8;&#xB294; &#xC2DD;&#xC73C;&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC870;&#xC9C1;&#xD654;&#xD558;&#xB294; &#xB610; &#xB2E4;&#xB978; &#xBC29;&#xBC95;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; <em>&#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5;(object-oriented)</em> &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xD328;&#xB7EC;&#xB2E4;&#xC784;&#xC774;&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xB300;&#xBD80;&#xBD84;&#xC758; &#xACBD;&#xC6B0; &#xC808;&#xCC28;&#xC801; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xC774;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC9C0;&#xB9CC; &#xADDC;&#xBAA8;&#xAC00; &#xD070; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD558;&#xAC70;&#xB098; &#xC774; &#xBC29;&#xBC95;&#xC5D0; &#xB354; &#xC801;&#xD569;&#xD55C; &#xBB38;&#xC81C;&#xAC00; &#xC788;&#xC744; &#xACBD;&#xC6B0; &#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xAE30;&#xBC95;&#xC744; &#xC774;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD074;&#xB798;&#xC2A4;&#xC640; &#xAC1D;&#xCCB4;&#xB294; &#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC758; &#xB450; &#xAC00;&#xC9C0; &#xC8FC;&#xC694; &#xCE21;&#xBA74;&#xC785;&#xB2C8;&#xB2E4;. <strong>&#xD074;&#xB798;&#xC2A4;(class)</strong>&#xB294; &#xC0C8;&#xB85C;&#xC6B4; <em>&#xD0C0;&#xC785;(type)</em>&#xC744; &#xC0DD;&#xC131;&#xD558;&#xBA70;, &#xC774;&#xB54C; <strong>&#xAC1D;&#xCCB4;(object)</strong>&#xB294; &#xD574;&#xB2F9; &#xD074;&#xB798;&#xC2A4;&#xC758; <strong>&#xC778;&#xC2A4;&#xD134;&#xC2A4;(instance)</strong>&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; <code>int</code> &#xD0C0;&#xC785;&#xC758; &#xBCC0;&#xC218;&#xC5D0; &#xBE44;&#xC720;&#xD558;&#xC790;&#xBA74; &#xC815;&#xC218;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xBCC0;&#xC218;&#xB294; <code>int</code> &#xD074;&#xB798;&#xC2A4;&#xC758; &#xC778;&#xC2A4;&#xD134;&#xC2A4;(&#xAC1D;&#xCCB4;)&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xB294; &#xBCC0;&#xC218;&#xB77C;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p><strong>&#xC815;&#xC801; &#xC5B8;&#xC5B4; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xB97C; &#xC704;&#xD55C; &#xBA54;&#xBAA8;</strong></p>
<p>&#xC2EC;&#xC9C0;&#xC5B4; &#xC815;&#xC218;&#xB3C4; &#xAC1D;&#xCCB4;(<code>int</code> &#xD074;&#xB798;&#xC2A4;&#xC758;)&#xB85C; &#xAC04;&#xC8FC;&#xB41C;&#xB2E4;&#xB294; &#xC810;&#xC5D0; &#xC720;&#xC758;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xC815;&#xC218;&#xAC00; &#xC6D0;&#xC2DC; &#xB124;&#xC774;&#xD2F0;&#xBE0C; &#xD0C0;&#xC785;(primitive native type)&#xC5D0; &#xD574;&#xB2F9;&#xD558;&#xB294; C++&#xB098; &#xC790;&#xBC14;(1.5 &#xBC84;&#xC804; &#xC774;&#xC804;&#xC758;)&#xC640;&#xB294; &#xB2E4;&#xB978; &#xC810;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xD074;&#xB798;&#xC2A4;&#xC5D0; &#xB300;&#xD55C; &#xC790;&#xC138;&#xD55C; &#xC0AC;&#xD56D;&#xC740; <code>help(int)</code>&#xB97C; &#xCC38;&#xACE0;&#xD558;&#xC138;&#xC694;.</p>
<p>C#&#xACFC; &#xC790;&#xBC14; 1.5 &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xB294; &#xC774;&#xAC83;&#xC774; <em>&#xBC15;&#xC2F1;(boxing)&#xACFC; &#xC5B8;&#xBC15;&#xC2F1;(unboxing)</em>&#xC758; &#xAC1C;&#xB150;&#xACFC; &#xBE44;&#xC2B7;&#xD558;&#xB2E4;&#xACE0; &#xB290;&#xB084; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p>&#xAC1D;&#xCCB4;&#xC5D0;&#xB294; &#xD574;&#xB2F9; &#xAC1D;&#xCCB4;&#xC5D0; <em>&#xC18D;&#xD558;&#xB294;(belong)</em> &#xD3C9;&#xBC94;&#xD55C; &#xBCC0;&#xC218;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC800;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5B4;&#xB5A4; &#xAC1D;&#xCCB4;&#xB098; &#xD074;&#xB798;&#xC2A4;&#xC5D0; &#xC18D;&#xD558;&#xB294; &#xBCC0;&#xC218;&#xB97C; <strong>&#xD544;&#xB4DC;(field)</strong>&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xAC1D;&#xCCB4;&#xB294; &#xD074;&#xB798;&#xC2A4;&#xC5D0; <em>&#xC18D;&#xD558;&#xB294;</em> &#xD568;&#xC218;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xAE30;&#xB2A5;&#xC744; &#xAC00;&#xC9C8; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xD568;&#xC218;&#xB97C; &#xD574;&#xB2F9; &#xD074;&#xB798;&#xC2A4;&#xC758; <strong>&#xBA54;&#xC11C;&#xB4DC;(method)</strong>&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xAC19;&#xC740; &#xC6A9;&#xC5B4;&#xB294; &#xC911;&#xC694;&#xD55C;&#xB370;, &#xD074;&#xB798;&#xC2A4;&#xB098; &#xAC1D;&#xCCB4;&#xC5D0; &#xC18D;&#xD558;&#xB294; &#xD568;&#xC218; &#xBC0F; &#xBCC0;&#xC218;&#xB97C; &#xD074;&#xB798;&#xC2A4;&#xB098; &#xAC1D;&#xCCB4;&#xC640; &#xC0C1;&#xAD00;&#xC5C6;&#xC774; &#xB3C5;&#xB9BD;&#xC801;&#xC778; &#xD568;&#xC218; &#xBC0F; &#xBCC0;&#xC218;&#xC640; &#xAD6C;&#xBD84;&#xD558;&#xB294; &#xB370; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xD544;&#xB4DC;&#xC640; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xD1B5;&#xD2C0;&#xC5B4;&#xC11C; &#xD574;&#xB2F9; &#xD074;&#xB798;&#xC2A4;&#xC758; <strong>&#xC18D;&#xC131;(attribute)</strong>&#xC774;&#xB77C;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD544;&#xB4DC;&#xC5D0;&#xB294; &#xB450; &#xAC00;&#xC9C0; &#xC720;&#xD615;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD074;&#xB798;&#xC2A4;&#xC758; &#xAC01; &#xC778;&#xC2A4;&#xD134;&#xC2A4;/&#xAC1D;&#xCCB4;&#xC5D0; &#xC18D;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xACE0; &#xD074;&#xB798;&#xC2A4; &#xC790;&#xCCB4;&#xC5D0; &#xC18D;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xAC01;&#xAC01; <strong>&#xC778;&#xC2A4;&#xD134;&#xC2A4; &#xBCC0;&#xC218;(instance variable)</strong>&#xC640; <strong>&#xD074;&#xB798;&#xC2A4; &#xBCC0;&#xC218;(class variable)</strong>&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xD074;&#xB798;&#xC2A4;&#xB294; <code>class</code> &#xD0A4;&#xC6CC;&#xB4DC;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xD074;&#xB798;&#xC2A4;&#xC758; &#xD544;&#xB4DC;&#xC640; &#xBA54;&#xC11C;&#xB4DC;&#xB294; &#xB4E4;&#xC5EC;&#xC4F0;&#xAE30;&#xD55C; &#xBE14;&#xB85D; &#xC548;&#xC5D0; &#xB098;&#xC5F4;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="self"><code>self</code> </h2>
<p>&#xD074;&#xB798;&#xC2A4;&#xC758; &#xBA54;&#xC11C;&#xB4DC;&#xB294; &#xC77C;&#xBC18; &#xD568;&#xC218;&#xC640; &#xD55C; &#xAC00;&#xC9C0; &#xCC28;&#xC774;&#xC810;&#xB9CC; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989;, &#xB9E4;&#xAC1C;&#xBCC0;&#xC218; &#xBAA9;&#xB85D;&#xC758; &#xB9E8; &#xC55E;&#xC5D0; &#xBC18;&#xB4DC;&#xC2DC; &#xBCC4;&#xB3C4;&#xC758; &#xC774;&#xB984;&#xC744; &#xCCAB; &#xBC88;&#xC9F8;&#xB85C; &#xCD94;&#xAC00;&#xD574;&#xC57C; &#xD558;&#xC9C0;&#xB9CC; &#xD574;&#xB2F9; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xD638;&#xCD9C;&#xD560; &#xB54C;&#xB294; &#xC774; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xC5D0; &#xAC12;&#xC744; &#xC9C0;&#xC815;&#xD574;&#xC11C;&#xB294; <strong>&#xC548; &#xB418;&#xACE0;</strong>, &#xD30C;&#xC774;&#xC36C;&#xC774; &#xAC12;&#xC744; &#xC81C;&#xACF5;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xCC98;&#xB7FC; &#xD2B9;&#xBCC4;&#xD55C; &#xBCC0;&#xC218;&#xB294; &#xD574;&#xB2F9; &#xAC1D;&#xCCB4; <em>&#xC790;&#xCCB4;</em>&#xB97C; &#xAC00;&#xB9AC;&#xD0A4;&#xACE0;, &#xAD00;&#xB840;&#xC0C1; <code>self</code>&#xB77C;&#xB294; &#xC774;&#xB984;&#xC744; &#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xC5D0; &#xB2E4;&#xB978; &#xC774;&#xB984;&#xC744; &#xC904; &#xC218;&#xB3C4; &#xC788;&#xC9C0;&#xB9CC; <code>self</code>&#xB77C;&#xB294; &#xC774;&#xB984;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xAE38; <em>&#xC801;&#xADF9; &#xAD8C;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;</em>. &#xB2E4;&#xB978; &#xC774;&#xB984;&#xC744; &#xC9C0;&#xC815;&#xD558;&#xB294; &#xAC83;&#xC740; &#xADF8;&#xB2E4;&#xC9C0; &#xBC14;&#xB78C;&#xC9C1;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD45C;&#xC900;&#xD654;&#xB41C; &#xC774;&#xB984;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xB370;&#xB294; &#xC5EC;&#xB7EC; &#xC774;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989;, <code>self</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xACBD;&#xC6B0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC77D;&#xB294; &#xC0AC;&#xB78C;&#xC774; &#xC774;&#xB97C; &#xACE7;&#xBC14;&#xB85C; &#xC778;&#xC2DD;&#xD560; &#xC218; &#xC788;&#xACE0; &#xC804;&#xBB38;&#xC801;&#xC778; IDE(Integrated Development Environments)&#xC5D0;&#xC11C;&#xB294; &#xC774;&#xB97C; &#xD65C;&#xC6A9;&#xD574; &#xCF54;&#xB4DC; &#xC791;&#xC131;&#xC5D0; &#xB3C4;&#xC6C0;&#xC744; &#xC904; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<blockquote>
<p><strong>C++/&#xC790;&#xBC14;/C# &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xB97C; &#xC704;&#xD55C; &#xBA54;&#xBAA8;</strong></p>
<p>&#xD30C;&#xC774;&#xC36C;&#xC758; <code>self</code>&#xB294; C++&#xC5D0;&#xC11C;&#xC758; <code>this</code> &#xD3EC;&#xC778;&#xD130;, &#xC790;&#xBC14;&#xC640; C#&#xC5D0;&#xC11C;&#xC758; <code>this</code> &#xCC38;&#xC870;&#xC5D0; &#xD574;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p>&#xD30C;&#xC774;&#xC36C;&#xC774; &#xC5B4;&#xB5BB;&#xAC8C; <code>self</code>&#xC758; &#xAC12;&#xC744; &#xC9C0;&#xC815;&#xD558;&#xACE0; &#xC65C; &#xAC70;&#xAE30;&#xC5D0; &#xAC12;&#xC744; &#xC904; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xB294;&#xC9C0; &#xBD84;&#xBA85; &#xAD81;&#xAE08;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC608;&#xC81C;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; &#xBA85;&#xD655;&#xD558;&#xAC8C; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xC744; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. <code>MyClass</code>&#xB77C;&#xB294; &#xD074;&#xB798;&#xC2A4;&#xAC00; &#xC788;&#xACE0;, &#xC774; &#xD074;&#xB798;&#xC2A4;&#xC758; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; <code>myobject</code>&#xB77C;&#xACE0; &#xD574;&#xBD05;&#xC2DC;&#xB2E4;. <code>myobject.method(arg1, arg2)</code>&#xB85C; &#xC774; &#xAC1D;&#xCCB4;&#xC758; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xBA74; &#xC774;&#xB294; &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xC758;&#xD574; &#xC790;&#xB3D9;&#xC73C;&#xB85C; <code>MyClass.method(myobject, arg1, arg2)</code>&#xC73C;&#xB85C; &#xBCC0;&#xD658;&#xB418;&#xACE0;, &#xC774;&#xAC83;&#xC774; &#xBC14;&#xB85C; &#xD2B9;&#xBCC4;&#xD55C; <code>self</code>&#xC758; &#xC815;&#xCCB4;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xB610;&#xD55C; &#xC774;&#xAC83;&#xC740; &#xC5B4;&#xB5A4; &#xBA54;&#xC11C;&#xB4DC;&#xAC00; &#xC778;&#xC790;&#xB97C; &#xBC1B;&#xC9C0; &#xC54A;&#xB354;&#xB77C;&#xB3C4; &#xC801;&#xC5B4;&#xB3C4; <code>self</code>&#xB294; &#xC778;&#xC790;&#xB85C; &#xC9C0;&#xC815;&#xD574;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="class">&#xD074;&#xB798;&#xC2A4; </h2>
<p>&#xAC00;&#xC7A5; &#xAC04;&#xB2E8;&#xD55C; &#xD074;&#xB798;&#xC2A4;&#xC758; &#xC608;&#xB97C; &#xB2E4;&#xC74C; &#xC608;&#xC81C;&#xC5D0;&#xC11C; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;(<code>oop_simplestclass.py</code>).</p>
<pre><code class="lang-python"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Person</span>:</span>
    <span class="hljs-keyword">pass</span>  <span class="hljs-comment"># &#xBE48; &#xBE14;&#xB85D;</span>

p = Person()
print(p)
</code></pre>

<p>&#xCD9C;&#xB825; &#xACB0;&#xACFC;:</p>
<pre><code>$ python oop_simplestclass.py
&lt;__main__.Person instance at 0x10171f518&gt;
</code></pre>

<p><strong>&#xB3D9;&#xC791; &#xC6D0;&#xB9AC;</strong></p>
<p><code>class</code> &#xBB38;&#xACFC; &#xD074;&#xB798;&#xC2A4;&#xC758; &#xC774;&#xB984;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xC0C8; &#xD074;&#xB798;&#xC2A4;&#xB97C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C;&#xC73C;&#xB85C; &#xC774; &#xD074;&#xB798;&#xC2A4;&#xC758; &#xBCF8;&#xBB38;&#xC744; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xB4E4;&#xC5EC;&#xC4F0;&#xAE30;&#xB41C; &#xBB38;&#xC7A5; &#xBE14;&#xB85D;&#xC774; &#xB098;&#xC635;&#xB2C8;&#xB2E4;. &#xC774; &#xACBD;&#xC6B0; <code>pass</code> &#xBB38;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xBE48; &#xBE14;&#xB85D;&#xC744; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C;&#xC73C;&#xB85C;, &#xD074;&#xB798;&#xC2A4;&#xBA85; &#xB2E4;&#xC74C;&#xC5D0; &#xAD04;&#xD638; &#xC30D;&#xC744; &#xC9C0;&#xC815;&#xD574; &#xC774; &#xD074;&#xB798;&#xC2A4;&#xC758; &#xAC1D;&#xCCB4;/&#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. (<a href="#init">&#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xD654;&#xC5D0; &#xB300;&#xD55C; &#xB354; &#xC790;&#xC138;&#xD55C; &#xB0B4;&#xC6A9;</a>&#xC740; &#xB2E4;&#xC74C; &#xC808;&#xC5D0;&#xC11C; &#xBC30;&#xC6C1;&#xB2C8;&#xB2E4;). &#xD655;&#xC778; &#xCC28;&#xC6D0;&#xC5D0;&#xC11C; &#xBCC0;&#xC218;&#xB97C; &#xCD9C;&#xB825;&#xD574; &#xBCC0;&#xC218;&#xC758; &#xD0C0;&#xC785;&#xC744; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;. &#xCD9C;&#xB825; &#xACB0;&#xACFC;&#xB97C; &#xD1B5;&#xD574; <code>__main__</code> &#xBAA8;&#xB4C8;&#xC758; <code>Person</code> &#xD074;&#xB798;&#xC2A4;&#xC758; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xC784;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xAC1D;&#xCCB4;&#xAC00; &#xC800;&#xC7A5;&#xB41C; &#xCEF4;&#xD4E8;&#xD130; &#xBA54;&#xBAA8;&#xB9AC;&#xC758; &#xC8FC;&#xC18C;&#xB3C4; &#xCD9C;&#xB825;&#xB41C;&#xB2E4;&#xB294; &#xC810;&#xC5D0; &#xC720;&#xC758;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xC8FC;&#xC18C;&#xB294; &#xD30C;&#xC774;&#xC36C;&#xC774; &#xACF5;&#xAC04;&#xC744; &#xCC3E;&#xC544;&#xC57C; &#xAC1D;&#xCCB4;&#xB97C; &#xC800;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xCEF4;&#xD4E8;&#xD130;&#xB9C8;&#xB2E4; &#xAC12;&#xC774; &#xB2EC;&#xB77C;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xBA54;&#xC11C;&#xB4DC;">&#xBA54;&#xC11C;&#xB4DC;</h2>
<p>&#xC774;&#xBBF8; &#xC55E;&#xC5D0;&#xC11C; &#xD074;&#xB798;&#xC2A4;/&#xAC1D;&#xCCB4;&#xB294; &#xBCC4;&#xB3C4;&#xC758; <code>self</code> &#xBCC0;&#xC218;&#xB97C; &#xAC16;&#xB294;&#xB2E4;&#xB294; &#xC810;&#xB9CC; &#xC81C;&#xC678;&#xD558;&#xBA74; &#xD568;&#xC218;&#xC640; &#xBE44;&#xC2B7;&#xD55C; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xAC00;&#xC9C8; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC0B4;&#xD3B4;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xC81C; &#xC608;&#xC81C;&#xB97C; &#xD558;&#xB098; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;(<code>oop_method.py</code>).</p>
<pre><code class="lang-python"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Person</span>:</span>
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">say_hi</span><span class="hljs-params">(self)</span>:</span>
        print(<span class="hljs-string">&apos;Hello, how are you?&apos;</span>)

p = Person()
p.say_hi()
<span class="hljs-comment"># &#xC704;&#xC758; &#xB450; &#xC904;&#xC740; Person(&apos;Swaroop&apos;).say_hi()&#xB77C;&#xACE0; &#xC791;&#xC131;&#xD574;&#xB3C4; &#xB429;&#xB2C8;&#xB2E4;</span>
</code></pre>

<p>&#xCD9C;&#xB825; &#xACB0;&#xACFC;:</p>
<pre><code>$ python oop_method.py
Hello, how are you?
</code></pre>

<p><strong>&#xB3D9;&#xC791; &#xC6D0;&#xB9AC;</strong></p>
<p>&#xC5EC;&#xAE30;&#xC11C; <code>self</code>&#xB97C; &#xC2E4;&#xC81C;&#xB85C; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCC38;&#xACE0;&#xB85C; <code>say_hi</code> &#xBA54;&#xC11C;&#xB4DC;&#xB294; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB97C; &#xBC1B;&#xC9C0; &#xC54A;&#xB294;&#xB370;&#xB3C4; &#xD568;&#xC218; &#xC815;&#xC758;&#xC5D0;&#xB294; <code>self</code>&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="init"><code>__init__</code> &#xBA54;&#xC11C;&#xB4DC; </h2>
<p>&#xD30C;&#xC774;&#xC36C; &#xD074;&#xB798;&#xC2A4;&#xC5D0;&#xB294; &#xD2B9;&#xBCC4;&#xD55C; &#xC758;&#xBBF8;&#xB97C; &#xAC00;&#xC9C4; &#xBA54;&#xC11C;&#xB4DC;&#xAC00; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xBC88;&#xC5D0;&#xB294; <code>__init__</code> &#xBA54;&#xC11C;&#xB4DC;&#xC758; &#xC758;&#xBBF8;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><code>__init__</code> &#xBA54;&#xC11C;&#xB4DC;&#xB294; &#xD074;&#xB798;&#xC2A4;&#xC758; &#xAC1D;&#xCCB4;&#xAC00; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xD654;(&#xC989;, &#xC0DD;&#xC131;)&#xB418;&#xC790;&#xB9C8;&#xC790; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;. &#xC774; &#xBA54;&#xC11C;&#xB4DC;&#xB294; &#xAC1D;&#xCCB4;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xD558;&#xACE0; &#xC2F6;&#xC740; <em>&#xCD08;&#xAE30;&#xD654;(initialization)</em>(&#xC989;, &#xAC1D;&#xCCB4;&#xC758; &#xCD08;&#xAE43;&#xAC12;&#xC744; &#xC804;&#xB2EC;)&#xB97C; &#xC218;&#xD589;&#xD558;&#xB294; &#xB370; &#xC720;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; &#xBA54;&#xC11C;&#xB4DC;&#xBA85; &#xC55E;&#xB4A4;&#xB85C; &#xBC11;&#xC904;&#xC744; &#xB450; &#xAC1C; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xB294; &#xB370; &#xC8FC;&#xBAA9;&#xD558;&#xC138;&#xC694;.</p>
<p>&#xC608;&#xC81C;(<code>oop_init.py</code>):</p>
<pre><code class="lang-python"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Person</span>:</span>
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">__init__</span><span class="hljs-params">(self, name)</span>:</span>
        self.name = name

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">say_hi</span><span class="hljs-params">(self)</span>:</span>
        print(<span class="hljs-string">&apos;Hello, my name is&apos;</span>, self.name)

p = Person(<span class="hljs-string">&apos;Swaroop&apos;</span>)
p.say_hi()
<span class="hljs-comment"># &#xC704;&#xC758; &#xB450; &#xC904;&#xC740; Person(&apos;Swaroop&apos;).say_hi()&#xB77C;&#xACE0; &#xC791;&#xC131;&#xD574;&#xB3C4; &#xB429;&#xB2C8;&#xB2E4;</span>
</code></pre>

<p>&#xCD9C;&#xB825; &#xACB0;&#xACFC;:</p>
<pre><code>$ python oop_init.py
Hello, my name is Swaroop
</code></pre>

<p><strong>&#xB3D9;&#xC791; &#xC6D0;&#xB9AC;</strong></p>
<p>&#xC5EC;&#xAE30;&#xC11C;&#xB294; <code>name</code>&#xC774;&#xB77C;&#xB294; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;(&#xB298; &#xADF8;&#xB807;&#xB4EF;&#xC774; <code>self</code>&#xC640; &#xD568;&#xAED8;)&#xB97C; &#xBC1B;&#xB294; <code>__init__</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xC815;&#xC758;&#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; <code>name</code>&#xC774;&#xB77C;&#xB294; &#xD544;&#xB4DC;&#xB3C4; &#xC0C8;&#xB85C; &#xD558;&#xB098; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xB450; &#xBCC0;&#xC218; &#xBAA8;&#xB450; &#xC774;&#xB984;&#xC774; &apos;name&apos;&#xC774;&#xC9C0;&#xB9CC; &#xC11C;&#xB85C; &#xB2E4;&#xB978; &#xBCC0;&#xC218;&#xB77C;&#xB294; &#xC810;&#xC5D0; &#xC8FC;&#xBAA9;&#xD558;&#xC138;&#xC694;. &#xC5EC;&#xAE30;&#xC11C; <code>self.name</code>&#xB77C;&#xB294; &#xC810; &#xD45C;&#xAE30;&#xBC95;&#xC740; &quot;name&quot;&#xC774;&#xB77C;&#xB294; &#xAC83;&#xC774; &quot;self&quot;&#xB77C;&#xB294; &#xAC1D;&#xCCB4;&#xC758; &#xC77C;&#xBD80;&#xC774;&#xACE0; &#xB2E4;&#xB978; <code>name</code>&#xC740; &#xC9C0;&#xC5ED; &#xBCC0;&#xC218;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC544;&#xBB34;&#xB7F0; &#xBB38;&#xC81C;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xC81C;&#xC5D0;&#xC11C;&#xB294; &#xBA85;&#xC2DC;&#xC801;&#xC73C;&#xB85C; &#xC5B4;&#xB290; &#xC774;&#xB984;&#xC744; &#xCC38;&#xC870;&#xD558;&#xB294;&#xC9C0; &#xB098;&#xD0C0;&#xB0B4;&#xACE0; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD30C;&#xC774;&#xC36C;&#xC774; &#xD63C;&#xB3D9;&#xD560; &#xC5EC;&#xC9C0;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><code>Person</code> &#xD074;&#xB798;&#xC2A4;&#xC758; &#xC0C8; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xC778; <code>p</code>&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xB54C;&#xB294; <code>p = Person(&apos;Swaroop&apos;)</code>&#xCC98;&#xB7FC; &#xD074;&#xB798;&#xC2A4;&#xBA85; &#xB2E4;&#xC74C;&#xC5D0; &#xB098;&#xC624;&#xB294; &#xAD04;&#xD638; &#xC548;&#xC5D0; &#xC778;&#xC218;&#xB97C; &#xB123;&#xC5B4;&#xC11C; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xBCF4;&#xB2E4;&#xC2DC;&#xD53C; <code>__init__</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xBA85;&#xC2DC;&#xC801;&#xC73C;&#xB85C; &#xD638;&#xCD9C;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xAC83;&#xC774; &#xBC14;&#xB85C; &#xC774; &#xBA54;&#xC11C;&#xB4DC;&#xC758; &#xD2B9;&#xBCC4;&#xD55C; &#xC810;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC81C; &#xBA54;&#xC11C;&#xB4DC; &#xB0B4;&#xC5D0;&#xC11C; <code>self.name</code> &#xD544;&#xB4DC;&#xB97C; &#xC774;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; <code>say_hi</code> &#xBA54;&#xC11C;&#xB4DC;&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="class-obj-vars">&#xD074;&#xB798;&#xC2A4;&#xC640; &#xAC1D;&#xCCB4; &#xBCC0;&#xC218; </h2>
<p>&#xC774;&#xBBF8; &#xC55E;&#xC5D0;&#xC11C; &#xD074;&#xB798;&#xC2A4;&#xC640; &#xAC1D;&#xCCB4;&#xC758; &#xAE30;&#xB2A5;&#xBD80;(&#xC989;, &#xBA54;&#xC11C;&#xB4DC;)&#xB97C; &#xC0B4;&#xD3B4;&#xBD24;&#xC73C;&#xBBC0;&#xB85C; &#xC774;&#xC81C; &#xB370;&#xC774;&#xD130;&#xBD80;&#xC5D0; &#xAD00;&#xD574; &#xBC30;&#xC6CC;&#xBD05;&#xC2DC;&#xB2E4;. &#xB370;&#xC774;&#xD130;&#xBD80;, &#xC989; &#xD544;&#xB4DC;&#xB294; &#xD074;&#xB798;&#xC2A4;&#xC640; &#xAC1D;&#xCCB4;&#xC758; <strong>&#xB124;&#xC784;&#xC2A4;&#xD398;&#xC774;&#xC2A4;(namespace)</strong>&#xC5D0; <em>&#xBB36;&#xC778;(bound)</em> &#xD3C9;&#xBC94;&#xD55C; &#xBCC0;&#xC218;&#xC5D0; &#xBD88;&#xACFC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xAC83;&#xC740; &#xC774;&#xB7EC;&#xD55C; &#xC774;&#xB984;&#xB4E4;&#xC774; &#xD574;&#xB2F9; &#xD074;&#xB798;&#xC2A4;&#xC640; &#xAC1D;&#xCCB4;&#xC758; &#xBB38;&#xB9E5; &#xB0B4;&#xC5D0;&#xC11C;&#xB9CC; &#xC720;&#xD6A8;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xC774;&#xC720;&#xB85C; &#xADF8;&#xAC83;&#xB4E4;&#xC744; <em>&#xB124;&#xC784; &#xC2A4;&#xD398;&#xC774;&#xC2A4;(name space)</em>&#xB77C;&#xACE0; &#xBD80;&#xB974;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><em>&#xD544;&#xB4DC;</em>&#xC5D0;&#xB294; &#xD074;&#xB798;&#xC2A4; &#xBCC0;&#xC218;&#xC640; &#xAC1D;&#xCCB4; &#xBCC0;&#xC218;&#xB85C; &#xB450; &#xAC00;&#xC9C0; &#xC720;&#xD615;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB450; &#xC720;&#xD615;&#xC740; &#xD074;&#xB798;&#xC2A4; &#xB610;&#xB294; &#xAC1D;&#xCCB4; &#xC911; &#xC5B4;&#xB290; &#xAC83;&#xC774; &#xD574;&#xB2F9; &#xBCC0;&#xC218;&#xB97C; <em>&#xC18C;&#xC720;(own)</em>&#xD558;&#xB290;&#xB0D0;&#xC5D0; &#xB530;&#xB77C; &#xAC01;&#xAE30; &#xAD6C;&#xBD84;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><strong>&#xD074;&#xB798;&#xC2A4; &#xBCC0;&#xC218;(class variable)</strong>&#xB294; &#xACF5;&#xC720;&#xB418;&#xC5B4; &#xD074;&#xB798;&#xC2A4;&#xC758; &#xBAA8;&#xB4E0; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xC5D0;&#xC11C; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD074;&#xB798;&#xC2A4; &#xBCC0;&#xC218;&#xB294; &#xB2E8; &#xD558;&#xB098;&#xC758; &#xC0AC;&#xBCF8;&#xB9CC;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xACE0;, &#xD55C; &#xAC1D;&#xCCB4;&#xAC00; &#xD074;&#xB798;&#xC2A4; &#xBCC0;&#xC218;&#xB97C; &#xBCC0;&#xACBD;&#xD558;&#xBA74; &#xD574;&#xB2F9; &#xBCC0;&#xACBD; &#xC0AC;&#xD56D;&#xC740; &#xB2E4;&#xB978; &#xBAA8;&#xB4E0; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xC5D0; &#xBC18;&#xC601;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><strong>&#xAC1D;&#xCCB4; &#xBCC0;&#xC218;(object variable)</strong>&#xB294; &#xD074;&#xB798;&#xC2A4;&#xC758; &#xAC01; &#xAC1C;&#xBCC4; &#xAC1D;&#xCCB4;/&#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xC5D0;&#xC11C; &#xC18C;&#xC720;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xACBD;&#xC6B0; &#xAC01; &#xAC1D;&#xCCB4;&#xB294; &#xC790;&#xC2E0;&#xB9CC;&#xC758; &#xD544;&#xB4DC; &#xC0AC;&#xBCF8;&#xC744; &#xAC00;&#xC9D1;&#xB2C8;&#xB2E4;. &#xC989;, &#xACF5;&#xC720;&#xB418;&#xC9C0; &#xC54A;&#xC73C;&#xBA70;, &#xC11C;&#xB85C; &#xB2E4;&#xB978; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xC5D0;&#xC11C; &#xC774;&#xB984;&#xC740; &#xAC19;&#xC544;&#xB3C4; &#xD544;&#xB4DC;&#xC640; &#xC544;&#xBB34;&#xB7F0; &#xAD00;&#xB828;&#xC774; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C;&#xC740; &#xC774;&#xB97C; &#xC27D;&#xAC8C; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xB294; &#xC608;&#xC81C;&#xC785;&#xB2C8;&#xB2E4;(<code>oop_objvar.py</code>).</p>
<pre><code class="lang-python"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Robot</span>:</span>
    <span class="hljs-string">&quot;&quot;&quot;&#xC774;&#xB984;&#xC744; &#xAC00;&#xC9C4; &#xB85C;&#xBD07;&#xC744; &#xB098;&#xD0C0;&#xB0C5;&#xB2C8;&#xB2E4;.&quot;&quot;&quot;</span>

    <span class="hljs-comment"># &#xB85C;&#xBD07;&#xC758; &#xC218;&#xB97C; &#xC138;&#xB294; &#xD074;&#xB798;&#xC2A4; &#xBCC0;&#xC218;</span>
    population = <span class="hljs-number">0</span>

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">__init__</span><span class="hljs-params">(self, name)</span>:</span>
        <span class="hljs-string">&quot;&quot;&quot;&#xB370;&#xC774;&#xD130;&#xB97C; &#xCD08;&#xAE30;&#xD654;&#xD569;&#xB2C8;&#xB2E4;.&quot;&quot;&quot;</span>
        self.name = name
        print(<span class="hljs-string">&quot;(Initializing {})&quot;</span>.format(self.name))

        <span class="hljs-comment"># &#xC774; &#xB85C;&#xBD07;&#xC774; &#xC0DD;&#xC131;&#xB418;&#xBA74; &#xB85C;&#xBD07; &#xC218;&#xC5D0; &#xB354;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;.</span>
        Robot.population += <span class="hljs-number">1</span>

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">die</span><span class="hljs-params">(self)</span>:</span>
        <span class="hljs-string">&quot;&quot;&quot;&#xC800;&#xB294; &#xC8FD;&#xC5B4;&#xAC00;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.&quot;&quot;&quot;</span>
        print(<span class="hljs-string">&quot;{} is being destroyed!&quot;</span>.format(self.name))

        Robot.population -= <span class="hljs-number">1</span>

        <span class="hljs-keyword">if</span> Robot.population == <span class="hljs-number">0</span>:
            print(<span class="hljs-string">&quot;{} was the last one.&quot;</span>.format(self.name))
        <span class="hljs-keyword">else</span>:
            print(<span class="hljs-string">&quot;There are still {:d} robots working.&quot;</span>.format(
                Robot.population))

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">say_hi</span><span class="hljs-params">(self)</span>:</span>
        <span class="hljs-string">&quot;&quot;&quot;&#xB85C;&#xBD07;&#xC774; &#xC778;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.

        &#xB85C;&#xBD07;&#xC740; &#xC778;&#xC0AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.&quot;&quot;&quot;</span>
        print(<span class="hljs-string">&quot;Greetings, my masters call me {}.&quot;</span>.format(self.name))

<span class="hljs-meta">    @classmethod</span>
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">how_many</span><span class="hljs-params">(cls)</span>:</span>
        <span class="hljs-string">&quot;&quot;&quot;&#xD604;&#xC7AC; &#xB85C;&#xBD07; &#xC218;&#xB97C; &#xCD9C;&#xB825;&#xD569;&#xB2C8;&#xB2E4;.&quot;&quot;&quot;</span>
        print(<span class="hljs-string">&quot;We have {:d} robots.&quot;</span>.format(cls.population))


droid1 = Robot(<span class="hljs-string">&quot;R2-D2&quot;</span>)
droid1.say_hi()
Robot.how_many()

droid2 = Robot(<span class="hljs-string">&quot;C-3PO&quot;</span>)
droid2.say_hi()
Robot.how_many()

print(<span class="hljs-string">&quot;\nRobots can do some work here.\n&quot;</span>)

print(<span class="hljs-string">&quot;Robots have finished their work. So let&apos;s destroy them.&quot;</span>)
droid1.die()
droid2.die()

Robot.how_many()
</code></pre>

<p>&#xCD9C;&#xB825; &#xACB0;&#xACFC;:</p>
<pre><code>$ python oop_objvar.py
(Initializing R2-D2)
Greetings, my masters call me R2-D2.
We have 1 robots.
(Initializing C-3PO)
Greetings, my masters call me C-3PO.
We have 2 robots.

Robots can do some work here.

Robots have finished their work. So let&apos;s destroy them.
R2-D2 is being destroyed!
There are still 1 robots working.
C-3PO is being destroyed!
C-3PO was the last one.
We have 0 robots.
</code></pre>

<p><strong>&#xB3D9;&#xC791; &#xC6D0;&#xB9AC;</strong></p>
<p>&#xC608;&#xC81C; &#xCF54;&#xB4DC;&#xAC00; &#xAE38;&#xC9C0;&#xB9CC; &#xD074;&#xB798;&#xC2A4; &#xBCC0;&#xC218;&#xC640; &#xAC1D;&#xCCB4; &#xBCC0;&#xC218;&#xC758; &#xD2B9;&#xC131;&#xC744; &#xC798; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; <code>population</code>&#xC740; <code>Robot</code> &#xD074;&#xB798;&#xC2A4;&#xC5D0; &#xC18D;&#xD558;&#xACE0;, &#xB530;&#xB77C;&#xC11C; &#xD074;&#xB798;&#xC2A4; &#xBCC0;&#xC218;&#xC5D0; &#xD574;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;. <code>name</code> &#xBCC0;&#xC218;&#xB294; &#xAC1D;&#xCCB4;&#xC5D0; &#xC18D;&#xD558;&#xACE0;(<code>self</code>&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xD560;&#xB2F9;&#xB428;), &#xB530;&#xB77C;&#xC11C; &#xAC1D;&#xCCB4; &#xBCC0;&#xC218;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xBBC0;&#xB85C; <code>self.population</code>&#xC774; &#xC544;&#xB2CC; <code>Robot.population</code>&#xC73C;&#xB85C; <code>population</code> &#xD074;&#xB798;&#xC2A4; &#xBCC0;&#xC218;&#xB97C; &#xCC38;&#xC870;&#xD569;&#xB2C8;&#xB2E4;. <code>name</code> &#xAC1D;&#xCCB4; &#xBCC0;&#xC218;&#xB294; &#xAC1D;&#xCCB4;&#xC758; &#xBA54;&#xC11C;&#xB4DC; &#xB0B4;&#xC5D0;&#xC11C; <code>self.name</code> &#xD45C;&#xAE30;&#xBC95;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xCC38;&#xC870;&#xD569;&#xB2C8;&#xB2E4;. &#xD074;&#xB798;&#xC2A4; &#xBCC0;&#xC218;&#xC640; &#xAC1D;&#xCCB4; &#xBCC0;&#xC218;&#xC758; &#xC774; &#xAC19;&#xC740; &#xCC28;&#xC774;&#xC810;&#xC744; &#xAE30;&#xC5B5;&#xD574; &#xB450;&#xC138;&#xC694;. &#xB610;&#xD55C; &#xD074;&#xB798;&#xC2A4; &#xBCC0;&#xC218;&#xC640; &#xC774;&#xB984;&#xC774; &#xAC19;&#xC740; &#xAC1D;&#xCCB4; &#xBCC0;&#xC218;&#xB294; &#xD074;&#xB798;&#xC2A4; &#xBCC0;&#xC218;&#xC5D0; &#xC758;&#xD574; &#xC228;&#xACA8;&#xC9C4;&#xB2E4;&#xB294; &#xC810;&#xB3C4; &#xC54C;&#xC544;&#xB450;&#xC138;&#xC694;!</p>
<p><code>Robot.population</code> &#xB300;&#xC2E0; <code>self.__class__.population</code>&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xB294;&#xB370;, &#xBAA8;&#xB4E0; &#xAC1D;&#xCCB4;&#xB294; &#xC790;&#xAE30; &#xC790;&#xC2E0;&#xC758; &#xD074;&#xB798;&#xC2A4;&#xB97C; <code>self.__class__</code> &#xC18D;&#xC131;&#xC744; &#xD1B5;&#xD574; &#xCC38;&#xC870;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC0AC;&#xC2E4; <code>how_many</code>&#xB294; &#xAC1D;&#xCCB4;&#xAC00; &#xC544;&#xB2CC; &#xD074;&#xB798;&#xC2A4;&#xC5D0; &#xC18D;&#xD558;&#xB294; &#xBA54;&#xC11C;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xAC83;&#xC740; &#xD544;&#xB4DC;&#xB098; &#xBA54;&#xC11C;&#xB4DC;&#xAC00; &#xC5B4;&#xB290; &#xD074;&#xB798;&#xC2A4;&#xC5D0; &#xC18D;&#xD558;&#xB294;&#xC9C0; &#xC54C; &#xD544;&#xC694;&#xAC00; &#xC788;&#xB290;&#xB0D0;&#xC5D0; &#xB530;&#xB77C; &#xD574;&#xB2F9; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; <code>classmethod</code>&#xB098; <code>staticmethod</code>&#xB85C; &#xC815;&#xC758;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xB73B;&#xC785;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C;&#xB294; &#xD074;&#xB798;&#xC2A4; &#xBCC0;&#xC218;&#xB97C; &#xCC38;&#xC870;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xBBC0;&#xB85C; <code>classmethod</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xC81C;&#xC5D0;&#xC11C;&#xB294; <a href="more.html#decorator">&#xB370;&#xCF54;&#xB808;&#xC774;&#xD130;(decorator)</a>&#xB97C; &#xC774;&#xC6A9;&#xD574; <code>how_many</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xD074;&#xB798;&#xC2A4; &#xBA54;&#xC11C;&#xB4DC;&#xB85C; &#xD45C;&#xC2DC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB370;&#xCF54;&#xB808;&#xC774;&#xD130;&#xB294; &#xB798;&#xD37C; &#xD568;&#xC218;(&#xC989;, &#xB0B4;&#xBD80; &#xD568;&#xC218;&#xC758; &#xC55E;&#xB4A4;&#xB85C; &#xBB54;&#xAC00;&#xB97C; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xB2E4;&#xB978; &#xD568;&#xC218;&#xB97C; &quot;&#xAC10;&#xC2F8;&#xB294;&quot; &#xD568;&#xC218;)&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xCD95;&#xC57D; &#xD45C;&#xD604;&#xC73C;&#xB85C; &#xC0DD;&#xAC01;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C; <code>@classmethod</code> &#xB370;&#xCF54;&#xB808;&#xC774;&#xD130;&#xB97C; &#xC801;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xAC83;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="lang-python">how_many = classmethod(how_many)
</code></pre>
<p><code>__init__</code> &#xBA54;&#xC11C;&#xB4DC;&#xB85C; <code>Robot</code> &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xC5D0; &#xC774;&#xB984;&#xC744; &#xC804;&#xB2EC;&#xD574; &#xCD08;&#xAE30;&#xD654;&#xD558;&#xB294; &#xAC83;&#xC744; &#xB208;&#xC5EC;&#xACA8;&#xBD05;&#xC2DC;&#xB2E4;. &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xB85C;&#xBD07;&#xC774; &#xD558;&#xB098; &#xB354; &#xCD94;&#xAC00;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; <code>__init__</code> &#xBA54;&#xC11C;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; <code>population</code>&#xC758; &#xAC12;&#xC744; 1&#xB9CC;&#xD07C; &#xC99D;&#xAC00;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; <code>self.name</code>&#xC758; &#xAC12;&#xC774; &#xAC01; &#xAC1D;&#xCCB4;&#xC5D0; &#xB530;&#xB77C; &#xB2E4;&#xB978;&#xB370;, &#xC774;&#xB294; &#xAC1D;&#xCCB4; &#xBCC0;&#xC218;&#xC758; &#xD2B9;&#xC131;&#xC744; &#xB098;&#xD0C0;&#xB0C5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD55C; &#xAC00;&#xC9C0; &#xAE30;&#xC5B5;&#xD574;&#xC57C; &#xD560; &#xAC83;&#xC740; &#xBC18;&#xB4DC;&#xC2DC; <code>self</code><em>&#xB9CC;&#xC744;</em> &#xC774;&#xC6A9;&#xD574; &#xB3D9;&#xC77C; &#xAC1D;&#xCCB4;&#xC758; &#xBCC0;&#xC218;&#xC640; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xCC38;&#xC870;&#xD574;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; <em>&#xC18D;&#xC131; &#xCC38;&#xC870;(attribute reference)</em>&#xB77C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xD074;&#xB798;&#xC2A4;&#xC640; &#xBA54;&#xC11C;&#xB4DC;&#xC5D0; <em>&#xB3C5;&#xC2A4;&#xD2B8;&#xB9C1;</em>&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD074;&#xB798;&#xC2A4; &#xB3C5;&#xC2A4;&#xD2B8;&#xB9C1;&#xC740; &#xB7F0;&#xD0C0;&#xC784;&#xC5D0; <code>Robot.__doc__</code>&#xC73C;&#xB85C;, &#xBA54;&#xC11C;&#xB4DC; &#xB3C5;&#xC2A4;&#xD2B8;&#xB9C1;&#xC740; <code>Robot.say_hi.__doc__</code>&#xC73C;&#xB85C; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><code>die</code> &#xBA54;&#xC11C;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; <code>Robot.population</code> &#xAC12;&#xC744; 1&#xB9CC;&#xD07C; &#xC904;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xBAA8;&#xB4E0; &#xD074;&#xB798;&#xC2A4; &#xBA64;&#xBC84;&#xB294; &#xC678;&#xBD80;&#xC5D0; &#xACF5;&#xAC1C;&#xB429;&#xB2C8;&#xB2E4;. &#xD55C; &#xAC00;&#xC9C0; &#xC608;&#xC678;&#xAC00; &#xC788;&#xB294;&#xB370;, <code>__privatevar</code>&#xCC98;&#xB7FC; &#xC774;&#xB984;&#xC774; <em>&#xBC11;&#xC904; 2&#xAC1C;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294;</em> &#xB370;&#xC774;&#xD130; &#xBA64;&#xBC84;&#xB294; &#xD30C;&#xC774;&#xC36C;&#xC774; &#xB124;&#xC784; &#xB9F9;&#xAE00;&#xB9C1;(name-mangling)&#xC744; &#xC774;&#xC6A9;&#xD574; &#xC0AC;&#xC2E4;&#xC0C1; &#xBE44;&#xACF5;&#xAC1C; &#xBCC0;&#xC218;&#xB85C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C; &#xD074;&#xB798;&#xC2A4;&#xB098; &#xAC1D;&#xCCB4; &#xB0B4;&#xC5D0;&#xC11C;&#xB9CC; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xBCC0;&#xC218;&#xC758; &#xC774;&#xB984;&#xC740; &#xBC11;&#xC904;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xAC83;&#xC774; &#xAD00;&#xB840;&#xC774;&#xACE0;, &#xB2E4;&#xB978; &#xBAA8;&#xB4E0; &#xC774;&#xB984;&#xB4E4;&#xC740; &#xACF5;&#xAC1C;&#xB418;&#xC5B4; &#xB2E4;&#xB978; &#xD074;&#xB798;&#xC2A4;/&#xAC1D;&#xCCB4;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xB2E4;&#xB9CC; &#xC774;&#xAC83;&#xC740; &#xAD00;&#xB840;&#xC77C; &#xBFD0; &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xC758;&#xD574; &#xAC15;&#xC81C;&#xB418;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xB294; &#xC810;&#xC744; &#xAE30;&#xC5B5;&#xD558;&#xC138;&#xC694;(&#xC774;&#xB984;&#xC774; &#xBC11;&#xC904; 2&#xAC1C;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xB97C; &#xC81C;&#xC678;&#xD558;&#xACE0;).</p>
<blockquote>
<p><strong>C++/&#xC790;&#xBC14;/C# &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xB97C; &#xC704;&#xD55C; &#xBA54;&#xBAA8;</strong></p>
<p>&#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xC11C; &#xBAA8;&#xB4E0; &#xD074;&#xB798;&#xC2A4; &#xBA64;&#xBC84;(&#xB370;&#xC774;&#xD130; &#xBA64;&#xBC84;&#xB97C; &#xD3EC;&#xD568;&#xD574;&#xC11C;)&#xB294; <em>&#xACF5;&#xAC1C;(public)</em>&#xB418;&#xACE0; &#xBAA8;&#xB4E0; &#xBA54;&#xC11C;&#xB4DC;&#xB294; <em>&#xAC00;&#xC0C1;(virtual)</em> &#xBA54;&#xC11C;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<h2 id="&#xC0C1;&#xC18D;">&#xC0C1;&#xC18D;</h2>
<p>&#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC758; &#xC8FC;&#xB41C; &#xC774;&#xC810; &#xC911; &#xD558;&#xB098;&#xB294; &#xCF54;&#xB4DC;&#xC758; <strong>&#xC7AC;&#xC0AC;&#xC6A9;(reuse)</strong>&#xC774;&#xACE0;, &#xC774;&#xB807;&#xAC8C; &#xD558;&#xB294; &#xD55C; &#xAC00;&#xC9C0; &#xBC29;&#xBC95;&#xC740; <strong>&#xC0C1;&#xC18D;(inheritance)</strong> &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC744; &#xC774;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC0C1;&#xC18D;&#xC740; &#xD074;&#xB798;&#xC2A4; &#xAC04;&#xC758; <strong>&#xD0C0;&#xC785;&#xACFC; &#xD558;&#xC704; &#xD0C0;&#xC785;</strong> &#xAD00;&#xACC4;&#xB97C; &#xAD6C;&#xD604;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xD559;&#xAD50;&#xC5D0;&#xC11C; &#xAD50;&#xC0AC;&#xC640; &#xD559;&#xC0DD;&#xC744; &#xAD00;&#xB9AC;&#xD574;&#xC57C; &#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD55C;&#xB2E4;&#xACE0; &#xD574;&#xBD05;&#xC2DC;&#xB2E4;. &#xAD50;&#xC0AC;&#xC640; &#xD559;&#xC0DD;&#xC740; &#xC774;&#xB984;&#xC774;&#xB098; &#xB098;&#xC774;, &#xC8FC;&#xC18C;&#xC640; &#xAC19;&#xC740; &#xACF5;&#xD1B5;&#xC801;&#xC778; &#xD2B9;&#xC131;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xAD50;&#xC0AC;&#xC5D0;&#xAC8C;&#xB294; &#xAE09;&#xC5EC;, &#xC218;&#xC5C5;, &#xD734;&#xAC00; &#xAC19;&#xC740; &#xD2B9;&#xC9D5;&#xC774;, &#xD559;&#xC0DD;&#xC5D0;&#xAC8C;&#xB294; &#xC810;&#xC218;&#xC640; &#xC218;&#xC5C5;&#xB8CC; &#xAC19;&#xC740; &#xD2B9;&#xC131;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xACBD;&#xC6B0; &#xAC01; &#xD0C0;&#xC785;&#xC5D0; &#xB300;&#xD574; &#xC11C;&#xB85C; &#xB3C5;&#xB9BD;&#xC801;&#xC778; &#xB450; &#xAC1C;&#xC758; &#xD074;&#xB798;&#xC2A4;&#xB97C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC11C; &#xCC98;&#xB9AC;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC9C0;&#xB9CC; &#xC0C8;&#xB85C;&#xC6B4; &#xACF5;&#xD1B5;&#xC801;&#xC778; &#xD2B9;&#xC131;&#xC744; &#xCD94;&#xAC00;&#xD558;&#xB824;&#xBA74; &#xC774;&#xB7EC;&#xD55C; &#xB3C5;&#xB9BD;&#xC801;&#xC778; &#xD074;&#xB798;&#xC2A4;&#xC5D0; &#xBAA8;&#xB450; &#xCD94;&#xAC00;&#xD574;&#xC57C; &#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xB418;&#xBA74; &#xCF54;&#xB4DC; &#xAD00;&#xB9AC;&#xAC00; &#xAE08;&#xBC29; &#xC5B4;&#xB824;&#xC6CC;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<p>&#xB354; &#xB098;&#xC740; &#xBC29;&#xBC95;&#xC740; <code>SchoolMember</code>&#xB77C;&#xB294; &#xACF5;&#xD1B5; &#xD074;&#xB798;&#xC2A4;&#xB97C; &#xB9CC;&#xB4E4;&#xACE0; &#xAD50;&#xC0AC;&#xC640; &#xD559;&#xC0DD; &#xD074;&#xB798;&#xC2A4;&#xAC00; &#xC774; &#xD074;&#xB798;&#xC2A4;&#xB85C;&#xBD80;&#xD130; <em>&#xC0C1;&#xC18D;&#xBC1B;&#xB294;(inherit)</em> &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC989;, &#xAD50;&#xC0AC;&#xC640; &#xD559;&#xC0DD; &#xD074;&#xB798;&#xC2A4;&#xAC00; &#xC774; &#xD0C0;&#xC785;(&#xD074;&#xB798;&#xC2A4;)&#xC758; &#xD558;&#xC704; &#xD0C0;&#xC785;&#xC774; &#xB418;&#xACE0; &#xC774;&#xB7EC;&#xD55C; &#xD558;&#xC704; &#xD0C0;&#xC785;&#xC5D0;&#xB9CC; &#xD2B9;&#xD654;&#xB41C; &#xD2B9;&#xC131;&#xC744; &#xCD94;&#xAC00;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xBC29;&#xBC95;&#xC5D0;&#xB294; &#xC5EC;&#xB7EC; &#xC774;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <code>SchoolMember</code>&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xCD94;&#xAC00;&#xD558;&#xAC70;&#xB098; &#xBCC0;&#xACBD;&#xD560; &#xACBD;&#xC6B0; &#xD558;&#xC704; &#xD0C0;&#xC785;&#xC5D0;&#xB3C4; &#xC774;&#xB7EC;&#xD55C; &#xBCC0;&#xD654;&#xAC00; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xBC18;&#xC601;&#xB429;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, <code>SchoolMember</code> &#xD074;&#xB798;&#xC2A4;&#xC5D0; &#xAC04;&#xB2E8;&#xD788; &#xC0C8;&#xB85C;&#xC6B4; ID &#xCE74;&#xB4DC; &#xD544;&#xB4DC;&#xB97C; &#xCD94;&#xAC00;&#xD558;&#xAE30;&#xB9CC; &#xD574;&#xB3C4; &#xAD50;&#xC0AC;&#xC640; &#xD559;&#xC0DD;&#xC5D0; &#xB300;&#xD574; &#xBAA8;&#xB450; &#xC0C8;&#xB85C;&#xC6B4; ID &#xCE74;&#xB4DC; &#xD544;&#xB4DC;&#xAC00; &#xCD94;&#xAC00;&#xB429;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xD558;&#xC704; &#xD0C0;&#xC785;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD55C; &#xBCC0;&#xACBD; &#xC0AC;&#xD56D;&#xC740; &#xB2E4;&#xB978; &#xD0C0;&#xC785;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xC8FC;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610; &#xD55C; &#xAC00;&#xC9C0; &#xC774;&#xC810;&#xC740; &#xAD50;&#xC0AC;&#xB098; &#xD559;&#xC0DD; &#xAC1D;&#xCCB4;&#xB97C; <code>SchoolMember</code> &#xAC1D;&#xCCB4;&#xB85C; &#xCC38;&#xC870;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC778;&#xB370;, &#xC774;&#xB294; &#xD559;&#xAD50; &#xAD6C;&#xC131;&#xC6D0;&#xC758; &#xC218;&#xB97C; &#xC140; &#xB54C;&#xCC98;&#xB7FC; &#xD2B9;&#xC815; &#xC0C1;&#xD669;&#xC5D0; &#xC720;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; <strong>&#xB2E4;&#xD615;&#xC131;(polymorphism)</strong>&#xC774;&#xB77C; &#xD558;&#xBA70;, &#xC0C1;&#xC704; &#xD0C0;&#xC785;&#xC744; &#xAE30;&#xB300;&#xD558;&#xB294; &#xC0C1;&#xD669;, &#xC989; &#xC5B4;&#xB5A4; &#xAC1D;&#xCCB4;&#xB97C; &#xC0C1;&#xC704; &#xD074;&#xB798;&#xC2A4;&#xC758; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB85C; &#xCDE8;&#xAE09;&#xD560; &#xC218; &#xC788;&#xB294; &#xC0C1;&#xD669;&#xC5D0;&#xC11C; &#xD558;&#xC704; &#xD0C0;&#xC785;&#xC744; &#xC0C1;&#xC704; &#xD0C0;&#xC785;&#xC73C;&#xB85C; &#xB300;&#xCCB4;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB610;&#xD55C; &#xC0C1;&#xC704; &#xD074;&#xB798;&#xC2A4;&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xC7AC;&#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xB2E4;&#xB978; &#xD074;&#xB798;&#xC2A4;&#xC5D0;&#xC11C; &#xCF54;&#xB4DC;&#xB97C; &#xBC18;&#xBCF5;&#xD574;&#xC11C; &#xC791;&#xC131;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xB2E4;&#xB294; &#xC810;&#xB3C4; &#xB208;&#xC5EC;&#xACA8;&#xBCFC; &#xD544;&#xC694;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC11C;&#xB85C; &#xB3C5;&#xB9BD;&#xC801;&#xC778; &#xD074;&#xB798;&#xC2A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD588;&#xB2E4;&#xBA74; &#xCF54;&#xB4DC;&#xB97C; &#xBC18;&#xBCF5;&#xD574;&#xC11C; &#xC791;&#xC131;&#xD574;&#xC57C; &#xD588;&#xC744; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xAC19;&#xC740; &#xC0C1;&#xD669;&#xC5D0;&#xC11C; <code>SchoolMember</code> &#xD074;&#xB798;&#xC2A4;&#xB97C; <strong>&#xAE30;&#xBC18; &#xD074;&#xB798;&#xC2A4;(base class)</strong> &#xB610;&#xB294; <strong>&#xC0C1;&#xC704; &#xD074;&#xB798;&#xC2A4;(superclass)</strong>&#xB77C; &#xD569;&#xB2C8;&#xB2E4;. &#xBC18;&#xBA74; <code>Teacher</code>&#xC640; <code>Student</code> &#xD074;&#xB798;&#xC2A4;&#xB294; <strong>&#xD30C;&#xC0DD; &#xD074;&#xB798;&#xC2A4;(derived classes)</strong> &#xB610;&#xB294; <strong>&#xD558;&#xC704; &#xD074;&#xB798;&#xC2A4;(subclasses)</strong>&#xB77C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC81C; &#xC774; &#xC608;&#xC81C;&#xB97C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC73C;&#xB85C; &#xC0B4;&#xD3B4;&#xBD05;&#xC2DC;&#xB2E4;(<code>oop_subclass.py</code>).</p>
<pre><code class="lang-python"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">SchoolMember</span>:</span>
    <span class="hljs-string">&apos;&apos;&apos;&#xD559;&#xAD50; &#xAD6C;&#xC131;&#xC6D0;&#xC744; &#xB098;&#xD0C0;&#xB0C5;&#xB2C8;&#xB2E4;.&apos;&apos;&apos;</span>
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">__init__</span><span class="hljs-params">(self, name, age)</span>:</span>
        self.name = name
        self.age = age
        print(<span class="hljs-string">&apos;(Initialized SchoolMember: {})&apos;</span>.format(self.name))

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">tell</span><span class="hljs-params">(self)</span>:</span>
        <span class="hljs-string">&apos;&apos;&apos;&#xC138;&#xBD80;&#xC0AC;&#xD56D;&#xC744; &#xCD9C;&#xB825;&#xD569;&#xB2C8;&#xB2E4;.&apos;&apos;&apos;</span>
        print(<span class="hljs-string">&apos;Name:&quot;{}&quot; Age:&quot;{}&quot;&apos;</span>.format(self.name, self.age), end=<span class="hljs-string">&quot; &quot;</span>)


<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Teacher</span><span class="hljs-params">(SchoolMember)</span>:</span>
    <span class="hljs-string">&apos;&apos;&apos;&#xAD50;&#xC0AC;&#xB97C; &#xB098;&#xD0C0;&#xB0C5;&#xB2C8;&#xB2E4;.&apos;&apos;&apos;</span>
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">__init__</span><span class="hljs-params">(self, name, age, salary)</span>:</span>
        SchoolMember.__init__(self, name, age)
        self.salary = salary
        print(<span class="hljs-string">&apos;(Initialized Teacher: {})&apos;</span>.format(self.name))

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">tell</span><span class="hljs-params">(self)</span>:</span>
        SchoolMember.tell(self)
        print(<span class="hljs-string">&apos;Salary: &quot;{:d}&quot;&apos;</span>.format(self.salary))


<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Student</span><span class="hljs-params">(SchoolMember)</span>:</span>
    <span class="hljs-string">&apos;&apos;&apos;&#xD559;&#xC0DD;&#xC744; &#xB098;&#xD0C0;&#xB0C5;&#xB2C8;&#xB2E4;.&apos;&apos;&apos;</span>
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">__init__</span><span class="hljs-params">(self, name, age, marks)</span>:</span>
        SchoolMember.__init__(self, name, age)
        self.marks = marks
        print(<span class="hljs-string">&apos;(Initialized Student: {})&apos;</span>.format(self.name))

    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">tell</span><span class="hljs-params">(self)</span>:</span>
        SchoolMember.tell(self)
        print(<span class="hljs-string">&apos;Marks: &quot;{:d}&quot;&apos;</span>.format(self.marks))

t = Teacher(<span class="hljs-string">&apos;Mrs. Shrividya&apos;</span>, <span class="hljs-number">40</span>, <span class="hljs-number">30000</span>)
s = Student(<span class="hljs-string">&apos;Swaroop&apos;</span>, <span class="hljs-number">25</span>, <span class="hljs-number">75</span>)

<span class="hljs-comment"># &#xBE48; &#xC904;&#xC744; &#xCD9C;&#xB825;&#xD569;&#xB2C8;&#xB2E4;</span>
print()

members = [t, s]
<span class="hljs-keyword">for</span> member <span class="hljs-keyword">in</span> members:
    <span class="hljs-comment"># Teacher&#xC640; Student&#xC5D0; &#xB300;&#xD574; &#xBAA8;&#xB450; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;</span>
    member.tell()
</code></pre>

<p>&#xCD9C;&#xB825; &#xACB0;&#xACFC;:</p>
<pre><code>$ python oop_subclass.py
(Initialized SchoolMember: Mrs. Shrividya)
(Initialized Teacher: Mrs. Shrividya)
(Initialized SchoolMember: Swaroop)
(Initialized Student: Swaroop)

Name:&quot;Mrs. Shrividya&quot; Age:&quot;40&quot; Salary: &quot;30000&quot;
Name:&quot;Swaroop&quot; Age:&quot;25&quot; Marks: &quot;75&quot;
</code></pre>

<p><strong>&#xB3D9;&#xC791; &#xC6D0;&#xB9AC;</strong></p>
<p>&#xC0C1;&#xC18D;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD574; &#xD074;&#xB798;&#xC2A4; &#xC815;&#xC758;&#xC5D0;&#xC11C; &#xD074;&#xB798;&#xC2A4;&#xBA85; &#xB2E4;&#xC74C;&#xC5D0; &#xB098;&#xC624;&#xB294; &#xD29C;&#xD50C;&#xC5D0; &#xAE30;&#xBC18; &#xD074;&#xB798;&#xC2A4;&#xC758; &#xC774;&#xB984;&#xC744; &#xC9C0;&#xC815;&#xD569;&#xB2C8;&#xB2E4;(&#xC608;: <code>class Teacher(SchoolMember)</code>). &#xB2E4;&#xC74C;&#xC73C;&#xB85C;, &#xD558;&#xC704; &#xD074;&#xB798;&#xC2A4;&#xC5D0;&#xC11C; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xC758; &#xAE30;&#xBC18; &#xD074;&#xB798;&#xC2A4; &#xBD80;&#xBD84;&#xC744; &#xCD08;&#xAE30;&#xD654;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; <code>self</code> &#xBCC0;&#xC218;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xAE30;&#xBC18; &#xD074;&#xB798;&#xC2A4;&#xC758; <code>__init__</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xBA85;&#xC2DC;&#xC801;&#xC73C;&#xB85C; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xAC83;&#xC740; &#xB9E4;&#xC6B0; &#xC911;&#xC694;&#xD558;&#xBBC0;&#xB85C; &#xAE30;&#xC5B5;&#xD574; &#xB450;&#xC138;&#xC694;. &#xC608;&#xC81C;&#xC5D0;&#xC11C;&#xB294; <code>Teacher</code>&#xC640; <code>Student</code> &#xD558;&#xC704; &#xD074;&#xB798;&#xC2A4;&#xC5D0;&#xC11C; <code>__init__</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xC815;&#xC758;&#xD558;&#xACE0; &#xC788;&#xC5B4; &#xD30C;&#xC774;&#xC36C;&#xC774; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xAE30;&#xBC18; &#xD074;&#xB798;&#xC2A4;&#xC778; <code>SchoolMember</code>&#xC758; &#xC0DD;&#xC131;&#xC790;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xC9C0; &#xC54A;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC9C1;&#xC811; <code>__init__</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xBA85;&#xC2DC;&#xC801;&#xC73C;&#xB85C; &#xD638;&#xCD9C;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC640; &#xB2EC;&#xB9AC; &#xD558;&#xC704; &#xD074;&#xB798;&#xC2A4;&#xC5D0;&#xC11C; <code>__init__</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xC815;&#xC758;&#xD558;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;&#xBA74; &#xD30C;&#xC774;&#xC36C;&#xC774; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xAE30;&#xBC18; &#xD074;&#xB798;&#xC2A4;&#xC758; &#xC0DD;&#xC131;&#xC790;&#xB97C; &#xD638;&#xCD9C;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p><code>Teacher</code>&#xB098; <code>Student</code>&#xC758; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; <code>SchoolMember</code>&#xC758; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB85C; &#xCDE8;&#xAE09;&#xD574;&#xC11C; <code>Teacher.tell</code>&#xC774;&#xB098; <code>Student.tell</code>&#xB85C; <code>SchoolMember</code>&#xC758; <code>tell</code> &#xBA54;&#xC11C;&#xB4DC;&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xC74C;&#xC5D0;&#xB3C4; &#xAC01; &#xD558;&#xC704; &#xD074;&#xB798;&#xC2A4;&#xC5D0; &#xB9DE;&#xCDB0; <code>tell</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xAC01; &#xD558;&#xC704; &#xD074;&#xB798;&#xC2A4;&#xC5D0; &#xBCC4;&#xB3C4;&#xB85C; &#xC815;&#xC758;&#xD569;&#xB2C8;&#xB2E4;(&#xBA54;&#xC11C;&#xB4DC; &#xC548;&#xC5D0;&#xC11C; <code>SchoolMember</code>&#xC758; <code>tell</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD574;). &#xC5EC;&#xAE30;&#xC11C; &#xC774;&#xB807;&#xAC8C; &#xD588;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; <code>Teacher.tell</code>&#xC774;&#xB77C;&#xACE0; &#xC791;&#xC131;&#xD588;&#xC744; &#xB54C; &#xD30C;&#xC774;&#xC36C;&#xC774; &#xC0C1;&#xC704; &#xD074;&#xB798;&#xC2A4;&#xAC00; &#xC544;&#xB2CC; &#xD574;&#xB2F9; &#xD558;&#xC704; &#xD074;&#xB798;&#xC2A4;&#xC758; <code>tell</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xD558;&#xC704; &#xD074;&#xB798;&#xC2A4;&#xC5D0;&#xC11C; <code>tell</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xC815;&#xC758;&#xD558;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;&#xBA74; &#xD30C;&#xC774;&#xC36C;&#xC740; &#xC0C1;&#xC704; &#xD074;&#xB798;&#xC2A4;&#xC758; <code>tell</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC740; &#xC5B8;&#xC81C;&#xB098; &#xC2E4;&#xC81C; &#xD558;&#xC704; &#xD074;&#xB798;&#xC2A4; &#xD0C0;&#xC785;&#xC5D0;&#xC11C; &#xBA3C;&#xC800; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xCC3E;&#xACE0;, &#xB9CC;&#xC57D; &#xD558;&#xC704; &#xD074;&#xB798;&#xC2A4;&#xC5D0;&#xC11C; &#xC544;&#xBB34;&#xAC83;&#xB3C4; &#xCC3E;&#xC9C0; &#xBABB;&#xD558;&#xBA74; &#xD074;&#xB798;&#xC2A4; &#xC815;&#xC758;&#xC5D0;&#xC11C; &#xD29C;&#xD50C;&#xC5D0; &#xC9C0;&#xC815;&#xB41C; &#xC21C;&#xC11C;&#xB300;&#xB85C; &#xD558;&#xB098;&#xC529;(&#xC5EC;&#xAE30;&#xC11C;&#xB294; &#xAE30;&#xBC18; &#xD074;&#xB798;&#xC2A4;&#xAC00; &#xD558;&#xB098;&#xBC16;&#xC5D0; &#xC5C6;&#xC9C0;&#xB9CC; &#xAE30;&#xBC18; &#xD074;&#xB798;&#xC2A4;&#xB97C; &#xC5EC;&#xB7EC; &#xAC1C; &#xB458; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;) &#xAE30;&#xBC18; &#xD074;&#xB798;&#xC2A4;&#xC5D0;&#xC11C; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xCC3E;&#xAE30; &#xC2DC;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. </p>
<p>&#xC6A9;&#xC5B4; &#xB178;&#xD2B8;: &#xC0C1;&#xC18D; &#xD29C;&#xD50C;&#xC5D0; &#xD074;&#xB798;&#xC2A4;&#xB97C; 2&#xAC1C; &#xC774;&#xC0C1; &#xC9C0;&#xC815;&#xD55C; &#xACBD;&#xC6B0; &#xC774;&#xB97C; <strong>&#xB2E4;&#xC911; &#xC0C1;&#xC18D;(multiple inheritance)</strong>&#xC774;&#xB77C; &#xD569;&#xB2C8;&#xB2E4;. </p>
<p>&#xC0C1;&#xC704; &#xD074;&#xB798;&#xC2A4;&#xC758; <code>tell()</code> &#xBA54;&#xC11C;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; <code>end</code> &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xD55C; &#xC904;&#xC744; &#xCD9C;&#xB825;&#xD558;&#xACE0; &#xB2E4;&#xC74C; &#xCD9C;&#xB825;&#xC744; &#xAC19;&#xC740; &#xC904;&#xC5D0; &#xACC4;&#xC18D; &#xC774;&#xC5B4;&#xC9C0;&#xAC8C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xD558;&#xBA74; <code>print</code>&#xAC00; &#xCD9C;&#xB825; &#xACB0;&#xACFC;&#xC758; &#xB05D;&#xC5D0; <code>\n</code>(&#xAC1C;&#xD589;) &#xAE30;&#xD638;&#xB97C; &#xCD9C;&#xB825;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xC815;&#xB9AC;">&#xC815;&#xB9AC;</h2>
<p>&#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xD074;&#xB798;&#xC2A4;&#xC640; &#xAC1D;&#xCCB4;&#xC758; &#xB2E4;&#xC591;&#xD55C; &#xCE21;&#xBA74;&#xC744; &#xBE44;&#xB86F;&#xD574; &#xC774;&#xC640; &#xC5F0;&#xAD00;&#xB41C; &#xB2E4;&#xC591;&#xD55C; &#xC6A9;&#xC5B4;&#xB97C; &#xC0B4;&#xD3B4;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC758; &#xC774;&#xC810;&#xACFC; &#xD568;&#xC815;&#xB3C4; &#xC0B4;&#xD3B4;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC740; &#xB300;&#xB2E8;&#xD788; &#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5;&#xC801;&#xC774;&#xACE0; &#xC774;&#xB7EC;&#xD55C; &#xAC1C;&#xB150;&#xC744; &#xC2E0;&#xACBD; &#xC368;&#xC11C; &#xC774;&#xD574;&#xD55C;&#xB2E4;&#xBA74; &#xC7A5;&#xAE30;&#xC801;&#xC73C;&#xB85C; &#xD06C;&#xAC8C; &#xB3C4;&#xC6C0;&#xC774; &#xB420; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xB2E4;&#xC74C; &#xC7A5;&#xC5D0;&#xC11C;&#xB294; &#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xC11C; &#xC785;&#xB825;/&#xCD9C;&#xB825;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xACE0; &#xD30C;&#xC77C;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xBC30;&#xC6B0;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="problem_solving.html" class="navigation navigation-prev " aria-label="Previous page: 문제 해결">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="io.html" class="navigation navigation-next " aria-label="Next page: 입출력">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"객체지향 프로그래밍","level":"1.14","depth":1,"next":{"title":"입출력","level":"1.15","depth":1,"path":"io.md","ref":"io.md","articles":[]},"previous":{"title":"문제 해결","level":"1.13","depth":1,"path":"problem_solving.md","ref":"problem_solving.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{"authorUrl":"https://www.swaroopch.com/about/","buyBookUrl":"https://www.swaroopch.com/buybook/","contactUrl":"https://www.swaroopch.com/contact/","downloadUrl":"https://github.com/swaroopch/byte-of-python/releases/latest","officialUrl":"https://python.swaroopch.com/","pythonVersion":"3.6.0","sourceUrl":"https://github.com/swaroopch/byte-of-python","vimBookUrl":"https://vim.swaroopch.com/"},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"oop.md","mtime":"2020-06-14T02:50:54.020Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-06-15T14:40:44.479Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

