
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>부록: 개정 이력 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="translations.html" />
    
    
    <link rel="prev" href="about.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="dedication.html">
            
                <a href="dedication.html">
            
                    
                    헌사
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    들어가며
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="about_python.html">
            
                <a href="about_python.html">
            
                    
                    파이썬 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="installation.html">
            
                <a href="installation.html">
            
                    
                    설치
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="first_steps.html">
            
                <a href="first_steps.html">
            
                    
                    첫 걸음
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="basics.html">
            
                <a href="basics.html">
            
                    
                    기초
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="op_exp.html">
            
                <a href="op_exp.html">
            
                    
                    연산자와 표현식
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="control_flow.html">
            
                <a href="control_flow.html">
            
                    
                    제어 흐름
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="functions.html">
            
                <a href="functions.html">
            
                    
                    함수
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="modules.html">
            
                <a href="modules.html">
            
                    
                    모듈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="data_structures.html">
            
                <a href="data_structures.html">
            
                    
                    자료구조
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="problem_solving.html">
            
                <a href="problem_solving.html">
            
                    
                    문제 해결
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="oop.html">
            
                <a href="oop.html">
            
                    
                    객체지향 프로그래밍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="io.html">
            
                <a href="io.html">
            
                    
                    입출력
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="exceptions.html">
            
                <a href="exceptions.html">
            
                    
                    예외
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="stdlib.html">
            
                <a href="stdlib.html">
            
                    
                    표준 라이브러리
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="more.html">
            
                <a href="more.html">
            
                    
                    기타 주제
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="what_next.html">
            
                <a href="what_next.html">
            
                    
                    더 나아가기
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="floss.html">
            
                <a href="floss.html">
            
                    
                    부록: FLOSS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="about.html">
            
                <a href="about.html">
            
                    
                    부록: 이 책에 관해
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.22" data-path="revision_history.html">
            
                <a href="revision_history.html">
            
                    
                    부록: 개정 이력
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="translations.html">
            
                <a href="translations.html">
            
                    
                    부록: 번역본
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="translation_howto.html">
            
                <a href="translation_howto.html">
            
                    
                    부록: 번역 방법
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="feedback.html">
            
                <a href="feedback.html">
            
                    
                    피드백
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >부록: 개정 이력</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
                                <section class="normal markdown-section">
                                
                                <h1 id="history-lesson">&#xBD80;&#xB85D;: &#xC774; &#xCC45;&#xC774; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C0;&#xAE30;&#xAE4C;&#xC9C0; </h1>
<p>&#xC81C;&#xAC00; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xCC98;&#xC74C; &#xC2DC;&#xC791;&#xD55C; &#xACC4;&#xAE30;&#xB294; &#xC81C;&#xAC00; &#xC791;&#xC131;&#xD55C; &apos;Diamond&apos;&#xB77C;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xB354; &#xC27D;&#xAC8C; &#xC124;&#xCE58;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC774; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC124;&#xCE58; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xB9CC;&#xB4E4;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; Qt &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC5D0; &#xB300;&#xD574; &#xD30C;&#xC774;&#xC36C;&#xACFC; &#xD384; &#xBC14;&#xC778;&#xB529; &#xC911;&#xC5D0;&#xC11C; &#xD558;&#xB098;&#xB97C; &#xD0DD;&#xD574;&#xC57C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6F9;&#xC5D0;&#xC11C; &#xAD00;&#xB828; &#xC790;&#xB8CC;&#xB97C; &#xCC3E;&#xC544;&#xBCF4;&#xB2E4;&#xAC00; &#xC800;&#xBA85;&#xD558;&#xACE0; &#xC874;&#xACBD;&#xBC1B;&#xB294; &#xD574;&#xCEE4;&#xC778; <a href="http://www.python.org/about/success/esr/" target="_blank">&#xC5D0;&#xB9AD; S. &#xB808;&#xC774;&#xBAAC;&#xB4DC;&#xAC00; &#xC4F4; &#xAE00;</a>&#xC744; &#xBC1C;&#xACAC;&#xD588;&#xB294;&#xB370;, &#xADF8; &#xAE00;&#xC5D0;&#xC11C;&#xB294; &#xD30C;&#xC774;&#xC36C;&#xC774; &#xC5B4;&#xC9F8;&#xC11C; &#xC790;&#xC2E0;&#xC758; &#xAC00;&#xC7A5; &#xC778;&#xAE30; &#xC788;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xAC00; &#xB410;&#xB294;&#xC9C0; &#xC774;&#xC57C;&#xAE30;&#xD558;&#xACE0; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xC800;&#xB3C4; PyQt &#xBC14;&#xC778;&#xB529;&#xC774; Perl-Qt&#xC5D0; &#xBE44;&#xD574; &#xC880; &#xB354; &#xC644;&#xC131;&#xB3C4; &#xC788;&#xB2E4;&#xB294; &#xC0AC;&#xC2E4;&#xC744; &#xC54C;&#xAC8C; &#xB410;&#xAE30;&#xC5D0; &#xD30C;&#xC774;&#xC36C;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xAE30;&#xB85C; &#xB9C8;&#xC74C;&#xBA39;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xACE0; &#xB098;&#xC11C; &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xAD00;&#xD55C; &#xC88B;&#xC740; &#xCC45;&#xC744; &#xCC3E;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7F0;&#xB370; &#xADF8;&#xB7F0; &#xCC45;&#xC774; &#xC5C6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC800;&#xB294; &#xBA87;&#xBA87; &#xC624;&#xB77C;&#xC77C;&#xB9AC; &#xCC45;&#xC744; &#xCC3E;&#xC558;&#xC9C0;&#xB9CC; &#xCC45;&#xAC12;&#xC774; &#xB108;&#xBB34; &#xBE44;&#xC2F8;&#xAC70;&#xB098; &#xC548;&#xB0B4;&#xC11C;&#xB77C;&#xAE30;&#xBCF4;&#xB2E4;&#xB294; &#xCC38;&#xC870; &#xB9E4;&#xB274;&#xC5BC;&#xC5D0; &#xAC00;&#xAE4C;&#xC6E0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xD3EC;&#xD568;&#xB41C; &#xBB38;&#xC11C;&#xB85C; &#xB9CC;&#xC871;&#xD574;&#xC57C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xD30C;&#xC774;&#xC36C; &#xBB38;&#xC11C;&#xB294; &#xB108;&#xBB34; &#xAC04;&#xB7B5;&#xD558;&#xACE0; &#xBD84;&#xB7C9;&#xC774; &#xC801;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xAD00;&#xD55C; &#xAC1C;&#xB150;&#xC744; &#xBC30;&#xC6B0;&#xB294; &#xB370;&#xB294; &#xAD1C;&#xCC2E;&#xC558;&#xC9C0;&#xB9CC; &#xC644;&#xC804;&#xD558;&#xC9C4; &#xC54A;&#xC558;&#xC8E0;. &#xC800;&#xC57C; &#xC774;&#xC804;&#xC5D0; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xACBD;&#xD5D8;&#xD574;&#xBD24;&#xAE30;&#xC5D0; &#xADF8;&#xB7ED;&#xC800;&#xB7ED; &#xD574;&#xB098;&#xAC08; &#xC218; &#xC788;&#xC5C8;&#xC9C0;&#xB9CC; &#xCD08;&#xBCF4;&#xC790;&#xC5D0;&#xAC8C; &#xC801;&#xD569;&#xD55C; &#xB0B4;&#xC6A9;&#xC740; &#xC544;&#xB2C8;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD30C;&#xC774;&#xC36C;&#xC744; &#xCC98;&#xC74C; &#xC811;&#xD55C; &#xC9C0; 6&#xAC1C;&#xC6D4;&#xC774; &#xC9C0;&#xB098;&#xACE0; &#xC800;&#xB294; &#xADF8;&#xB54C; &#xB2F9;&#xC2DC; &#xCD5C;&#xC2E0; &#xB808;&#xB4DC;&#xD587; 9.0 &#xB9AC;&#xB205;&#xC2A4;&#xB97C; &#xC124;&#xCE58;&#xD558;&#xACE0; KWord&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC774;&#xB9AC;&#xC800;&#xB9AC; &#xB180;&#xACE0; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. Kword&#xC5D0; &#xBE60;&#xC838;&#xC11C; &#xB180;&#xACE0; &#xC788;&#xB2E4;&#xAC00; &#xAC11;&#xC790;&#xAE30; &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xAD00;&#xD574; &#xAE00;&#xC744; &#xC368;&#xBCF4;&#xC790;&#xB294; &#xC0DD;&#xAC01;&#xC774; &#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBA87; &#xD398;&#xC774;&#xC9C0; &#xC4F0;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xACE0;, &#xAE08;&#xBC29; 30&#xD398;&#xC774;&#xC9C0;&#xB85C; &#xB298;&#xC5B4;&#xB0AC;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xACE0; &#xB098;&#xC11C; &#xC880; &#xB354; &#xC4F8;&#xBAA8; &#xC788;&#xB294; &#xCC45; &#xD615;&#xD0DC;&#xB85C; &#xB9CC;&#xB4E4;&#xC5EC; &#xBCF4;&#xC790;&#xB294; &#xC0DD;&#xAC01;&#xC774; &#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. <em>&#xC5EC;&#xB7EC; &#xBC88;&#xC5D0; &#xAC78;&#xCE5C;</em> &#xC4F0;&#xACE0; &#xC9C0;&#xC6B0;&#xB294; &#xACFC;&#xC815;&#xC744; &#xAC70;&#xCCD0; &#xD30C;&#xC774;&#xC36C; &#xC5B8;&#xC5B4;&#xB97C; &#xBC30;&#xC6B0;&#xB294; &#xB370; &#xC720;&#xC6A9;&#xD55C; &#xAE38;&#xC7A1;&#xC774; &#xC5ED;&#xD560;&#xC744; &#xD560; &#xB9CC;&#xD55C; &#xC218;&#xC900;&#xC5D0; &#xB3C4;&#xB2EC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xB294; &#xC774; &#xCC45;&#xC744; &#xC624;&#xD508;&#xC18C;&#xC2A4; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC5D0; &#xB300;&#xD55C; &#xAE30;&#xC5EC;&#xC640; &#xD5CC;&#xC0AC;&#xB85C; &#xC5EC;&#xAE41;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xCC45;&#xC740; &#xD30C;&#xC774;&#xC36C;&#xC5D0; &#xAD00;&#xD55C; &#xC800;&#xC758; &#xAC1C;&#xC778;&#xC801;&#xC778; &#xAE30;&#xB85D;&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xB410;&#xACE0;, &#xBE44;&#xB85D; &#xB2E4;&#xB978; &#xBD84;&#xB4E4;&#xC774; &#xBCF4;&#xAE30;&#xC5D0; &#xB354; &#xC77D;&#xAE30; &#xC88B;&#xB3C4;&#xB85D; &#xB9CE;&#xC740; &#xB178;&#xB825;&#xC744; &#xAE30;&#xC6B8;&#xC774;&#xAE34; &#xD588;&#xC9C0;&#xB9CC; &#xC9C0;&#xAE08;&#xB3C4; &#xC5EC;&#xC804;&#xD788; &#xAC19;&#xC740; &#xC2DD;&#xC73C;&#xB85C; &#xC0DD;&#xAC01;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. :)</p>
<p>&#xC9C4;&#xC815;&#xD55C; &#xC624;&#xD508;&#xC18C;&#xC2A4;&#xC758; &#xC815;&#xC2E0;&#xC5D0; &#xC785;&#xAC01;&#xD574;&#xC11C; &#xC800;&#xB294; &#xC5F4;&#xC131;&#xC801;&#xC778; &#xB3C5;&#xC790;&#xBD84;&#xB4E4;&#xB85C;&#xBD80;&#xD130; &#xC218;&#xB9CE;&#xC740; &#xAC74;&#xC124;&#xC801;&#xC778; &#xC81C;&#xC548;, &#xBE44;&#xD3C9;, <a href="./#who-reads-bop">&#xD53C;&#xB4DC;&#xBC31;</a>&#xC744; &#xBC1B;&#xC558;&#xACE0;, &#xC774;&#xAC83;&#xB4E4;&#xC740; &#xBAA8;&#xB450; &#xC774; &#xCC45;&#xC744; &#xB354;&#xC6B1;&#xB354; &#xAC1C;&#xC120;&#xD558;&#xB294; &#xB370; &#xC774;&#xBC14;&#xC9C0;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xC774;-&#xCC45;&#xC758;-&#xC0C1;&#xD0DC;">&#xC774; &#xCC45;&#xC758; &#xC0C1;&#xD0DC;</h2>
<p>&#xC774; &#xCC45;&#xC758; &#xC5B4;&#xB5A4; &#xBD80;&#xBD84;&#xC774; &#xC88B;&#xC9C0; &#xC54A;&#xAC70;&#xB098;, &#xC774;&#xD574;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xAC70;&#xB098;, &#xB610;&#xB294; &#xB2E8;&#xC21C;&#xD788; &#xC624;&#xB958;&#xAC00; &#xC788;&#xB294;&#xC9C0;&#xB97C; &#xC9C0;&#xC801;&#xD574;&#xC904; &#xC5EC;&#xB7EC;&#xBD84;&#xACFC; &#xAC19;&#xC740; &#xB3C5;&#xC790;&#xBD84;&#xB4E4;&#xC758; &#xB3C4;&#xC6C0;&#xC774; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xCC45;&#xC758; <a href="https://www.swaroopch.com/contact/" target="_blank">&#xC800;&#xC790;</a>&#xB098; &#xAC01; &#xC5B8;&#xC5B4;&#xC758; <a href="translations.html#translations">&#xBC88;&#xC5ED;&#xC790;</a>&#xC5D0;&#xAC8C; &#xD6C4;&#xAE30;&#xB098; &#xC81C;&#xC548; &#xB0B4;&#xC6A9;&#xC744; &#xBCF4;&#xB0B4;&#xC8FC;&#xC2DC;&#xAE30; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;.</p>
<h1 id="revision-history">&#xBD80;&#xB85D;: &#xAC1C;&#xC815; &#xC774;&#xB825; </h1>
<ul>
<li><p>4.0</p>
<ul>
<li>19 Jan 2016</li>
<li>Switched back to Python 3</li>
<li>Switched back to Markdown, using <a href="https://www.gitbook.com" target="_blank">GitBook</a> and <a href="http://spacemacs.org" target="_blank">Spacemacs</a></li>
</ul>
</li>
<li><p>3.0</p>
<ul>
<li>31 Mar 2014</li>
<li>Rewritten for Python 2 using <a href="http://asciidoctor.org/docs/what-is-asciidoc/" target="_blank">AsciiDoc</a> and <a href="https://github.com/sensorflo/adoc-mode/wiki" target="_blank">adoc-mode</a>.</li>
</ul>
</li>
<li><p>2.1</p>
<ul>
<li>03 Aug 2013</li>
<li>Rewritten using Markdown and <a href="http://jblevins.org/projects/markdown-mode/" target="_blank">Jason Blevins&apos; Markdown Mode</a></li>
</ul>
</li>
<li><p>2.0</p>
<ul>
<li>20 Oct 2012</li>
<li>Rewritten in <a href="http://johnmacfarlane.net/pandoc/README.html" target="_blank">Pandoc format</a>, thanks to my wife who did most of the conversion from the Mediawiki format</li>
<li>Simplifying text, removing non-essential sections such as <code>nonlocal</code> and metaclasses</li>
</ul>
</li>
<li><p>1.90</p>
<ul>
<li>04 Sep 2008 and still in progress</li>
<li>Revival after a gap of 3.5 years!</li>
<li>Rewriting for Python 3.0</li>
<li>Rewrite using <a href="http://www.mediawiki.org[MediaWiki" target="_blank">http://www.mediawiki.org[MediaWiki</a>] (again)</li>
</ul>
</li>
<li><p>1.20</p>
<ul>
<li>13 Jan 2005</li>
<li>Complete rewrite using <a href="https://en.wikipedia.org/wiki/Quanta_Plus" target="_blank">Quanta+</a> on <a href="http://fedoraproject.org/" target="_blank">Fedora</a> Core 3 with lot of corrections and updates. Many new examples. Rewrote my DocBook setup from scratch.</li>
</ul>
</li>
<li><p>1.15</p>
<ul>
<li>28 Mar 2004</li>
<li>Minor revisions</li>
</ul>
</li>
<li><p>1.12</p>
<ul>
<li>16 Mar 2004</li>
<li>Additions and corrections</li>
</ul>
</li>
<li><p>1.10</p>
<ul>
<li>09 Mar 2004</li>
<li>More typo corrections, thanks to many enthusiastic and helpful readers.</li>
</ul>
</li>
<li><p>1.00</p>
<ul>
<li>08 Mar 2004</li>
<li>After tremendous feedback and suggestions from readers, I have made significant revisions to the content along with typo corrections.</li>
</ul>
</li>
<li><p>0.99</p>
<ul>
<li>22 Feb 2004</li>
<li>Added a new chapter on modules. Added details about variable number of arguments in functions.</li>
</ul>
</li>
<li><p>0.98</p>
<ul>
<li>16 Feb 2004</li>
<li>Wrote a Python script and CSS stylesheet to improve XHTML output, including a crude-yet-functional lexical analyzer for automatic VIM-like syntax highlighting of the program listings.</li>
</ul>
</li>
<li><p>0.97</p>
<ul>
<li>13 Feb 2004</li>
<li>Another completely rewritten draft, in DocBook XML (again). Book has improved a lot - it is more coherent and readable.</li>
</ul>
</li>
<li><p>0.93</p>
<ul>
<li>25 Jan 2004</li>
<li>Added IDLE talk and more Windows-specific stuff</li>
</ul>
</li>
<li><p>0.92</p>
<ul>
<li>05 Jan 2004</li>
<li>Changes to few examples.</li>
</ul>
</li>
<li><p>0.91</p>
<ul>
<li>30 Dec 2003</li>
<li>Corrected typos. Improvised many topics.</li>
</ul>
</li>
<li><p>0.90</p>
<ul>
<li>18 Dec 2003</li>
<li>Added 2 more chapters. <a href="https://en.wikipedia.org/wiki/OpenOffice" target="_blank">OpenOffice</a> format with revisions.</li>
</ul>
</li>
<li><p>0.60</p>
<ul>
<li>21 Nov 2003</li>
<li>Fully rewritten and expanded.</li>
</ul>
</li>
<li><p>0.20</p>
<ul>
<li>20 Nov 2003</li>
<li>Corrected some typos and errors.</li>
</ul>
</li>
<li><p>0.15</p>
<ul>
<li>20 Nov 2003</li>
<li>Converted to <a href="https://en.wikipedia.org/wiki/DocBook" target="_blank">DocBook XML</a> with XEmacs.</li>
</ul>
</li>
<li><p>0.10</p>
<ul>
<li>14 Nov 2003</li>
<li>Initial draft using <a href="https://en.wikipedia.org/wiki/Kword" target="_blank">KWord</a>.</li>
</ul>
</li>
</ul>

                                
                                </section>
                            
                        </div>
                    </div>
                
            </div>

            
                
                <a href="about.html" class="navigation navigation-prev " aria-label="Previous page: 부록: 이 책에 관해">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="translations.html" class="navigation navigation-next " aria-label="Next page: 부록: 번역본">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"부록: 개정 이력","level":"1.22","depth":1,"next":{"title":"부록: 번역본","level":"1.23","depth":1,"path":"translations.md","ref":"translations.md","articles":[]},"previous":{"title":"부록: 이 책에 관해","level":"1.21","depth":1,"path":"about.md","ref":"about.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{"authorUrl":"https://www.swaroopch.com/about/","buyBookUrl":"https://www.swaroopch.com/buybook/","contactUrl":"https://www.swaroopch.com/contact/","downloadUrl":"https://github.com/swaroopch/byte-of-python/releases/latest","officialUrl":"https://python.swaroopch.com/","pythonVersion":"3.6.0","sourceUrl":"https://github.com/swaroopch/byte-of-python","vimBookUrl":"https://vim.swaroopch.com/"},"plugins":[],"pluginsConfig":{"highlight":{},"search":{"maxIndexSize":1000000},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"revision_history.md","mtime":"2020-06-29T13:39:48.495Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-06-30T09:14:30.454Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/buttons.js"></script>
        
    

    </body>
</html>

